FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/** Macro to clear a bit in register */
    #define CLR_BIT( reg, pos )    ( reg = reg & ( uint32_t ) ( ~( ( uint32_t ) 1 << pos ) ) )

/*
 * ==========================================================================
 * ---------- Interrupt Handler Definition ----------------------------------
 * ==========================================================================
 */
    #define IRQ_Hdlr_0     SCU_0_IRQHandler
    #define IRQ_Hdlr_1     SCU_1_IRQHandler
    #define IRQ_Hdlr_2     SCU_2_IRQHandler
    #define IRQ_Hdlr_3     ERU0_0_IRQHandler
    #define IRQ_Hdlr_4     ERU0_1_IRQHandler
    #define IRQ_Hdlr_5     ERU0_2_IRQHandler
    #define IRQ_Hdlr_6     ERU0_3_IRQHandler

    #define IRQ_Hdlr_9     USIC0_0_IRQHandler
    #define IRQ_Hdlr_10    USIC0_1_IRQHandler
    #define IRQ_Hdlr_11    USIC0_2_IRQHandler
    #define IRQ_Hdlr_12    USIC0_3_IRQHandler
    #define IRQ_Hdlr_13    USIC0_4_IRQHandler
    #define IRQ_Hdlr_14    USIC0_5_IRQHandler
    #define IRQ_Hdlr_15    VADC0_C0_0_IRQHandler
    #define IRQ_Hdlr_16    VADC0_C0_1_IRQHandler
    #define IRQ_Hdlr_17    VADC0_G0_0_IRQHandler
    #define IRQ_Hdlr_18    VADC0_G0_1_IRQHandler
    #define IRQ_Hdlr_19    VADC0_G1_0_IRQHandler
    #define IRQ_Hdlr_20    VADC0_G1_1_IRQHandler
    #define IRQ_Hdlr_21    CCU40_0_IRQHandler
    #define IRQ_Hdlr_22    CCU40_1_IRQHandler
    #define IRQ_Hdlr_23    CCU40_2_IRQHandler
    #define IRQ_Hdlr_24    CCU40_3_IRQHandler
    #define IRQ_Hdlr_29    LEDTS0_0_IRQHandler
    #define IRQ_Hdlr_30    LEDTS1_0_IRQHandler
    #define IRQ_Hdlr_31    BCCU0_0_IRQHandler

/*
 * ==========================================================================
 * ---------- Interrupt Handler retrieval macro -----------------------------
 * ==========================================================================
 */
    #define GET_IRQ_HANDLER( N )    IRQ_Hdlr_ ## N


/** @addtogroup Device_Peripheral_Registers
 * @{
 */


/* -------------------  Start of section using anonymous unions  ------------------ */
    #if defined( __CC_ARM )
        #pragma push
        #pragma anon_unions
    #elif defined( __ICCARM__ )
        #pragma language=extended
    #elif defined( __GNUC__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TMS470__ )
/* anonymous unions are enabled by default */
    #elif defined( __TASKING__ )
        #pragma warning 586
    #else /* if defined( __CC_ARM ) */
        #warning Not supported compiler type
    #endif /* if defined( __CC_ARM ) */



/* ================================================================================ */
/* ================                       PPB                      ================ */
/* ================================================================================ */


/**
 * @brief Cortex-M0 Private Peripheral Block (PPB)
 */

    typedef struct                                  /*!< (@ 0xE000E000) PPB Structure                                          */
    {
        __I uint32_t RESERVED0[ 4 ];
        __IO uint32_t SYST_CSR;                     /*!< (@ 0xE000E010) SysTick Control and Status Register                    */
        __IO uint32_t SYST_RVR;                     /*!< (@ 0xE000E014) SysTick Reload Value Register                          */
        __IO uint32_t SYST_CVR;                     /*!< (@ 0xE000E018) SysTick Current Value Register                         */
        __I uint32_t SYST_CALIB;                    /*!< (@ 0xE000E01C) SysTick Calibration Value Register                     */
        __I uint32_t RESERVED1[ 56 ];
        __IO uint32_t NVIC_ISER;                    /*!< (@ 0xE000E100) Interrupt Set-enable Register                          */
        __I uint32_t RESERVED2[ 31 ];
        __IO uint32_t NVIC_ICER;                    /*!< (@ 0xE000E180) IInterrupt Clear-enable Register                       */
        __I uint32_t RESERVED3[ 31 ];
        __IO uint32_t NVIC_ISPR;                    /*!< (@ 0xE000E200) Interrupt Set-pending Register                         */
        __I uint32_t RESERVED4[ 31 ];
        __IO uint32_t NVIC_ICPR;                    /*!< (@ 0xE000E280) Interrupt Clear-pending Register                       */
        __I uint32_t RESERVED5[ 95 ];
        __IO uint32_t NVIC_IPR0;                    /*!< (@ 0xE000E400) Interrupt Priority Register 0                          */
        __IO uint32_t NVIC_IPR1;                    /*!< (@ 0xE000E404) Interrupt Priority Register 1                          */
        __IO uint32_t NVIC_IPR2;                    /*!< (@ 0xE000E408) Interrupt Priority Register 2                          */
        __IO uint32_t NVIC_IPR3;                    /*!< (@ 0xE000E40C) Interrupt Priority Register 3                          */
        __IO uint32_t NVIC_IPR4;                    /*!< (@ 0xE000E410) Interrupt Priority Register 4                          */
        __IO uint32_t NVIC_IPR5;                    /*!< (@ 0xE000E414) Interrupt Priority Register 5                          */
        __IO uint32_t NVIC_IPR6;                    /*!< (@ 0xE000E418) Interrupt Priority Register 6                          */
        __IO uint32_t NVIC_IPR7;                    /*!< (@ 0xE000E41C) Interrupt Priority Register 7                          */
        __I uint32_t RESERVED6[ 568 ];
        __I uint32_t CPUID;                         /*!< (@ 0xE000ED00) CPUID Base Register                                    */
        __IO uint32_t ICSR;                         /*!< (@ 0xE000ED04) Interrupt Control and State Register                   */
        __I uint32_t RESERVED7;
        __IO uint32_t AIRCR;                        /*!< (@ 0xE000ED0C) Application Interrupt and Reset Control Register       */
        __IO uint32_t SCR;                          /*!< (@ 0xE000ED10) System Control Register                                */
        __I uint32_t CCR;                           /*!< (@ 0xE000ED14) Configuration and Control Register                     */
        __I uint32_t RESERVED8;
        __IO uint32_t SHPR2;                        /*!< (@ 0xE000ED1C) System Handler Priority Register 2                     */
        __IO uint32_t SHPR3;                        /*!< (@ 0xE000ED20) System Handler Priority Register 3                     */
        __IO uint32_t SHCSR;                        /*!< (@ 0xE000ED24) System Handler Control and State Register              */
    } PPB_Type;


/* ================================================================================ */
/* ================                   ERU [ERU0]                   ================ */
/* ================================================================================ */


/**
 * @brief Event Request Unit 0 (ERU)
 */

    typedef struct                                  /*!< (@ 0x40010600) ERU Structure                                          */
    {
        __IO uint32_t EXISEL;                       /*!< (@ 0x40010600) Event Input Select                                     */
        __I uint32_t RESERVED0[ 3 ];
        __IO uint32_t EXICON[ 4 ];                  /*!< (@ 0x40010610) Event Input Control                                    */
        __IO uint32_t EXOCON[ 4 ];                  /*!< (@ 0x40010620) Event Output Trigger Control                           */
    } ERU_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                       PAU                      ================ */
/* ================================================================================ */


/**
 * @brief PAU Unit (PAU)
 */

