FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    typedef struct                                  /*!< (@ 0x40000000) PAU Structure                                          */
    {
        __I uint32_t RESERVED0[ 16 ];
        __I uint32_t AVAIL0;                        /*!< (@ 0x40000040) Peripheral Availability Register 0                     */
        __I uint32_t AVAIL1;                        /*!< (@ 0x40000044) Peripheral Availability Register 1                     */
        __I uint32_t AVAIL2;                        /*!< (@ 0x40000048) Peripheral Availability Register 2                     */
        __I uint32_t RESERVED1[ 13 ];
        __IO uint32_t PRIVDIS0;                     /*!< (@ 0x40000080) Peripheral Privilege Access Register 0                 */
        __IO uint32_t PRIVDIS1;                     /*!< (@ 0x40000084) Peripheral Privilege Access Register 1                 */
        __IO uint32_t PRIVDIS2;                     /*!< (@ 0x40000088) Peripheral Privilege Access Register 2                 */
        __I uint32_t RESERVED2[ 221 ];
        __I uint32_t ROMSIZE;                       /*!< (@ 0x40000400) ROM Size Register                                      */
        __I uint32_t FLSIZE;                        /*!< (@ 0x40000404) Flash Size Register                                    */
        __I uint32_t RESERVED3[ 2 ];
        __I uint32_t RAM0SIZE;                      /*!< (@ 0x40000410) RAM0 Size Register                                     */
    } PAU_Type;


/* ================================================================================ */
/* ================                       NVM                      ================ */
/* ================================================================================ */


/**
 * @brief NVM Unit (NVM)
 */

    typedef struct                                  /*!< (@ 0x40050000) NVM Structure                                          */
    {
        __I uint16_t NVMSTATUS;                     /*!< (@ 0x40050000) NVM Status Register                                    */
        __I uint16_t RESERVED0;
        __IO uint16_t NVMPROG;                      /*!< (@ 0x40050004) NVM Programming Control Register                       */
        __I uint16_t RESERVED1;
        __IO uint16_t NVMCONF;                      /*!< (@ 0x40050008) NVM Configuration Register                             */
    } NVM_Type;


/* ================================================================================ */
/* ================                       WDT                      ================ */
/* ================================================================================ */


/**
 * @brief Watch Dog Timer (WDT)
 */

    typedef struct                                  /*!< (@ 0x40020000) WDT Structure                                          */
    {
        __I uint32_t ID;                            /*!< (@ 0x40020000) WDT Module ID Register                                 */
        __IO uint32_t CTR;                          /*!< (@ 0x40020004) WDT Control Register                                   */
        __O uint32_t SRV;                           /*!< (@ 0x40020008) WDT Service Register                                   */
        __I uint32_t TIM;                           /*!< (@ 0x4002000C) WDT Timer Register                                     */
        __IO uint32_t WLB;                          /*!< (@ 0x40020010) WDT Window Lower Bound Register                        */
        __IO uint32_t WUB;                          /*!< (@ 0x40020014) WDT Window Upper Bound Register                        */
        __I uint32_t WDTSTS;                        /*!< (@ 0x40020018) WDT Status Register                                    */
        __O uint32_t WDTCLR;                        /*!< (@ 0x4002001C) WDT Clear Register                                     */
    } WDT_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */


/**
 * @brief Real Time Clock (RTC)
 */

    typedef struct                                  /*!< (@ 0x40010A00) RTC Structure                                          */
    {
        __I uint32_t ID;                            /*!< (@ 0x40010A00) RTC Module ID Register                                 */
        __IO uint32_t CTR;                          /*!< (@ 0x40010A04) RTC Control Register                                   */
        __I uint32_t RAWSTAT;                       /*!< (@ 0x40010A08) RTC Raw Service Request Register                       */
        __I uint32_t STSSR;                         /*!< (@ 0x40010A0C) RTC Service Request Status Register                    */
        __IO uint32_t MSKSR;                        /*!< (@ 0x40010A10) RTC Service Request Mask Register                      */
        __O uint32_t CLRSR;                         /*!< (@ 0x40010A14) RTC Clear Service Request Register                     */
        __IO uint32_t ATIM0;                        /*!< (@ 0x40010A18) RTC Alarm Time Register 0                              */
        __IO uint32_t ATIM1;                        /*!< (@ 0x40010A1C) RTC Alarm Time Register 1                              */
        __IO uint32_t TIM0;                         /*!< (@ 0x40010A20) RTC Time Register 0                                    */
        __IO uint32_t TIM1;                         /*!< (@ 0x40010A24) RTC Time Register 1                                    */
    } RTC_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                      PRNG                      ================ */
/* ================================================================================ */


/**
 * @brief PRNG Unit (PRNG)
 */

    typedef struct                                  /*!< (@ 0x48020000) PRNG Structure                                         */
    {
        __IO uint16_t WORD;                         /*!< (@ 0x48020000) Pseudo RNG Word Register                               */
        __I uint16_t RESERVED0;
        __I uint16_t CHK;                           /*!< (@ 0x48020004) Pseudo RNG Status Check Register                       */
        __I uint16_t RESERVED1[ 3 ];
        __IO uint16_t CTRL;                         /*!< (@ 0x4802000C) Pseudo RNG Control Register                            */
    } PRNG_Type;


/* ================================================================================ */
/* ================                 LEDTS [LEDTS0]                 ================ */
/* ================================================================================ */


/**
 * @brief LED and Touch Sense Unit 0 (LEDTS)
 */

