FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    typedef struct                                  /*!< (@ 0x50020000) LEDTS Structure                                        */
    {
        __I uint32_t ID;                            /*!< (@ 0x50020000) Module Identification Register                         */
        __IO uint32_t GLOBCTL;                      /*!< (@ 0x50020004) Global Control Register                                */
        __IO uint32_t FNCTL;                        /*!< (@ 0x50020008) Function Control Register                              */
        __O uint32_t EVFR;                          /*!< (@ 0x5002000C) Event Flag Register                                    */
        __IO uint32_t TSVAL;                        /*!< (@ 0x50020010) Touch-sense TS-Counter Value                           */
        __IO uint32_t LINE0;                        /*!< (@ 0x50020014) Line Pattern Register 0                                */
        __IO uint32_t LINE1;                        /*!< (@ 0x50020018) Line Pattern Register 1                                */
        __IO uint32_t LDCMP0;                       /*!< (@ 0x5002001C) LED Compare Register 0                                 */
        __IO uint32_t LDCMP1;                       /*!< (@ 0x50020020) LED Compare Register 1                                 */
        __IO uint32_t TSCMP0;                       /*!< (@ 0x50020024) Touch-sense Compare Register 0                         */
        __IO uint32_t TSCMP1;                       /*!< (@ 0x50020028) Touch-sense Compare Register 1                         */
    } LEDTS0_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                  USIC [USIC0]                  ================ */
/* ================================================================================ */


/**
 * @brief Universal Serial Interface Controller 0 (USIC)
 */

    typedef struct                                  /*!< (@ 0x48000008) USIC Structure                                         */
    {
        __I uint32_t ID;                            /*!< (@ 0x48000008) Module Identification Register                         */
    } USIC_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================               USIC_CH [USIC0_CH0]              ================ */
/* ================================================================================ */


/**
 * @brief Universal Serial Interface Controller 0 (USIC_CH)
 */

    typedef struct                                  /*!< (@ 0x48000000) USIC_CH Structure                                      */
    {
        __I uint32_t RESERVED0;
        __I uint32_t CCFG;                          /*!< (@ 0x48000004) Channel Configuration Register                         */
        __I uint32_t RESERVED1;
        __IO uint32_t KSCFG;                        /*!< (@ 0x4800000C) Kernel State Configuration Register                    */
        __IO uint32_t FDR;                          /*!< (@ 0x48000010) Fractional Divider Register                            */
        __IO uint32_t BRG;                          /*!< (@ 0x48000014) Baud Rate Generator Register                           */
        __IO uint32_t INPR;                         /*!< (@ 0x48000018) Interrupt Node Pointer Register                        */
        __IO uint32_t DX0CR;                        /*!< (@ 0x4800001C) Input Control Register 0                               */
        __IO uint32_t DX1CR;                        /*!< (@ 0x48000020) Input Control Register 1                               */
        __IO uint32_t DX2CR;                        /*!< (@ 0x48000024) Input Control Register 2                               */
        __IO uint32_t DX3CR;                        /*!< (@ 0x48000028) Input Control Register 3                               */
        __IO uint32_t DX4CR;                        /*!< (@ 0x4800002C) Input Control Register 4                               */
        __IO uint32_t DX5CR;                        /*!< (@ 0x48000030) Input Control Register 5                               */
        __IO uint32_t SCTR;                         /*!< (@ 0x48000034) Shift Control Register                                 */
        __IO uint32_t TCSR;                         /*!< (@ 0x48000038) Transmit Control/Status Register                       */

        union
        {
            __IO uint32_t PCR_IICMode;              /*!< (@ 0x4800003C) Protocol Control Register [IIC Mode]                   */
            __IO uint32_t PCR_IISMode;              /*!< (@ 0x4800003C) Protocol Control Register [IIS Mode]                   */
            __IO uint32_t PCR_SSCMode;              /*!< (@ 0x4800003C) Protocol Control Register [SSC Mode]                   */
            __IO uint32_t PCR;                      /*!< (@ 0x4800003C) Protocol Control Register                              */
            __IO uint32_t PCR_ASCMode;              /*!< (@ 0x4800003C) Protocol Control Register [ASC Mode]                   */
        };
        __IO uint32_t CCR;                          /*!< (@ 0x48000040) Channel Control Register                               */
        __IO uint32_t CMTR;                         /*!< (@ 0x48000044) Capture Mode Timer Register                            */

        union
        {
            __IO uint32_t PSR_IICMode;              /*!< (@ 0x48000048) Protocol Status Register [IIC Mode]                    */
            __IO uint32_t PSR_IISMode;              /*!< (@ 0x48000048) Protocol Status Register [IIS Mode]                    */
            __IO uint32_t PSR_SSCMode;              /*!< (@ 0x48000048) Protocol Status Register [SSC Mode]                    */
            __IO uint32_t PSR;                      /*!< (@ 0x48000048) Protocol Status Register                               */
            __IO uint32_t PSR_ASCMode;              /*!< (@ 0x48000048) Protocol Status Register [ASC Mode]                    */
        };
        __O uint32_t PSCR;                          /*!< (@ 0x4800004C) Protocol Status Clear Register                         */
        __I uint32_t RBUFSR;                        /*!< (@ 0x48000050) Receiver Buffer Status Register                        */
        __I uint32_t RBUF;                          /*!< (@ 0x48000054) Receiver Buffer Register                               */
        __I uint32_t RBUFD;                         /*!< (@ 0x48000058) Receiver Buffer Register for Debugger                  */
        __I uint32_t RBUF0;                         /*!< (@ 0x4800005C) Receiver Buffer Register 0                             */
        __I uint32_t RBUF1;                         /*!< (@ 0x48000060) Receiver Buffer Register 1                             */
        __I uint32_t RBUF01SR;                      /*!< (@ 0x48000064) Receiver Buffer 01 Status Register                     */
        __O uint32_t FMR;                           /*!< (@ 0x48000068) Flag Modification Register                             */
        __I uint32_t RESERVED2[ 5 ];
        __IO uint32_t TBUF[ 32 ];                   /*!< (@ 0x48000080) Transmit Buffer                                        */
        __IO uint32_t BYP;                          /*!< (@ 0x48000100) Bypass Data Register                                   */
        __IO uint32_t BYPCR;                        /*!< (@ 0x48000104) Bypass Control Register                                */
        __IO uint32_t TBCTR;                        /*!< (@ 0x48000108) Transmitter Buffer Control Register                    */
        __IO uint32_t RBCTR;                        /*!< (@ 0x4800010C) Receiver Buffer Control Register                       */
        __I uint32_t TRBPTR;                        /*!< (@ 0x48000110) Transmit/Receive Buffer Pointer Register               */
        __IO uint32_t TRBSR;                        /*!< (@ 0x48000114) Transmit/Receive Buffer Status Register                */
        __O uint32_t TRBSCR;                        /*!< (@ 0x48000118) Transmit/Receive Buffer Status Clear Register          */
        __I uint32_t OUTR;                          /*!< (@ 0x4800011C) Receiver Buffer Output Register                        */
        __I uint32_t OUTDR;                         /*!< (@ 0x48000120) Receiver Buffer Output Register L for Debugger         */
        __I uint32_t RESERVED3[ 23 ];
        __O uint32_t IN[ 32 ];                      /*!< (@ 0x48000180) Transmit FIFO Buffer                                   */
    } USIC_CH_TypeDef;


/* ================================================================================ */
/* ================                   SCU_GENERAL                  ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (SCU_GENERAL)
 */

