FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    typedef struct                                  /*!< (@ 0x40010000) SCU_GENERAL Structure                                  */
    {
        __I uint32_t DBGROMID;                      /*!< (@ 0x40010000) Debug System ROM ID Register                           */
        __I uint32_t IDCHIP;                        /*!< (@ 0x40010004) Chip ID Register                                       */
        __I uint32_t ID;                            /*!< (@ 0x40010008) SCU Module ID Register                                 */
        __I uint32_t RESERVED0[ 2 ];
        __IO uint32_t SSW0;                         /*!< (@ 0x40010014) SSW Register 0                                         */
        __I uint32_t RESERVED1[ 3 ];
        __IO uint32_t PASSWD;                       /*!< (@ 0x40010024) Password Register                                      */
        __I uint32_t RESERVED2[ 2 ];
        __IO uint32_t CCUCON;                       /*!< (@ 0x40010030) CCU Control Register                                   */
        __I uint32_t RESERVED3[ 5 ];
        __I uint32_t MIRRSTS;                       /*!< (@ 0x40010048) Mirror Update Status Register                          */
        __I uint32_t RESERVED4[ 2 ];
        __IO uint32_t PMTSR;                        /*!< (@ 0x40010054) Parity Memory Test Select Register                     */
    } SCU_GENERAL_Type;


/* ================================================================================ */
/* ================                  SCU_INTERRUPT                 ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (SCU_INTERRUPT)
 */

    typedef struct                                  /*!< (@ 0x40010038) SCU_INTERRUPT Structure                                */
    {
        __I uint32_t SRRAW;                         /*!< (@ 0x40010038) SCU Raw Service Request Status                         */
        __IO uint32_t SRMSK;                        /*!< (@ 0x4001003C) SCU Service Request Mask                               */
        __O uint32_t SRCLR;                         /*!< (@ 0x40010040) SCU Service Request Clear                              */
        __O uint32_t SRSET;                         /*!< (@ 0x40010044) SCU Service Request Set                                */
    } SCU_INTERRUPT_TypeDef;


/* ================================================================================ */
/* ================                    SCU_POWER                   ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (SCU_POWER)
 */

    typedef struct                                  /*!< (@ 0x40010200) SCU_POWER Structure                                    */
    {
        __I uint32_t VDESR;                         /*!< (@ 0x40010200) Voltage Detector Status Register                       */
    } SCU_POWER_Type;


/* ================================================================================ */
/* ================                     SCU_CLK                    ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (SCU_CLK)
 */

    typedef struct                                  /*!< (@ 0x40010300) SCU_CLK Structure                                      */
    {
        __IO uint32_t CLKCR;                        /*!< (@ 0x40010300) Clock Control Register                                 */
        __IO uint32_t PWRSVCR;                      /*!< (@ 0x40010304) Power Save Control Register                            */
        __I uint32_t CGATSTAT0;                     /*!< (@ 0x40010308) Peripheral 0 Clock Gating Status                       */
        __O uint32_t CGATSET0;                      /*!< (@ 0x4001030C) Peripheral 0 Clock Gating Set                          */
        __O uint32_t CGATCLR0;                      /*!< (@ 0x40010310) Peripheral 0 Clock Gating Clear                        */
        __IO uint32_t OSCCSR;                       /*!< (@ 0x40010314) Oscillator Control and Status Register                 */
    } SCU_CLK_TypeDef;


/* ================================================================================ */
/* ================                    SCU_RESET                   ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (SCU_RESET)
 */

    typedef struct                                  /*!< (@ 0x40010400) SCU_RESET Structure                                    */
    {
        __I uint32_t RSTSTAT;                       /*!< (@ 0x40010400) RCU Reset Status                                       */
        __O uint32_t RSTSET;                        /*!< (@ 0x40010404) RCU Reset Set Register                                 */
        __O uint32_t RSTCLR;                        /*!< (@ 0x40010408) RCU Reset Clear Register                               */
        __IO uint32_t RSTCON;                       /*!< (@ 0x4001040C) RCU Reset Control Register                             */
    } SCU_RESET_Type;


/* ================================================================================ */
/* ================                   COMPARATOR                   ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (COMPARATOR)
 */

    typedef struct                                  /*!< (@ 0x40010500) COMPARATOR Structure                                   */
    {
        __IO uint32_t ORCCTRL;                      /*!< (@ 0x40010500) Out Of Range Comparator Control Register               */
        __I uint32_t RESERVED0[ 726 ];
        __IO uint16_t ANACMP0;                      /*!< (@ 0x4001105C) Analog Comparator 0 Control Register                   */
        __I uint16_t RESERVED1;
        __IO uint16_t ANACMP1;                      /*!< (@ 0x40011060) Analog Comparator 1 Control Register                   */
        __I uint16_t RESERVED2;
        __IO uint16_t ANACMP2;                      /*!< (@ 0x40011064) Analog Comparator 2 Control Register                   */
    } COMPARATOR_Type;


/* ================================================================================ */
/* ================                   SCU_ANALOG                   ================ */
/* ================================================================================ */


/**
 * @brief System Control Unit (SCU_ANALOG)
 */

