FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    typedef struct                                  /*!< (@ 0x40011000) SCU_ANALOG Structure                                   */
    {
        __I uint32_t RESERVED0[ 9 ];
        __IO uint16_t ANATSECTRL;                   /*!< (@ 0x40011024) Temperature Sensor Control Register                    */
        __I uint16_t RESERVED1[ 5 ];
        __IO uint16_t ANATSEIH;                     /*!< (@ 0x40011030) Temperature Sensor High Temperature Interrupt
                                                     *   Register                                                              */
        __I uint16_t RESERVED2;
        __IO uint16_t ANATSEIL;                     /*!< (@ 0x40011034) Temperature Sensor Low Temperature Interrupt
                                                     *   Register                                                              */
        __I uint16_t RESERVED3[ 5 ];
        __I uint16_t ANATSEMON;                     /*!< (@ 0x40011040) Temperature Sensor Counter2 Monitor Register           */
        __I uint16_t RESERVED4[ 7 ];
        __IO uint16_t ANAVDEL;                      /*!< (@ 0x40011050) Voltage Detector Control Register                      */
        __I uint16_t RESERVED5[ 13 ];
        __IO uint16_t ANAOFFSET;                    /*!< (@ 0x4001106C) DCO1 Offset Register                                   */
    } SCU_ANALOG_Type;


/* ================================================================================ */
/* ================                  CCU4 [CCU40]                  ================ */
/* ================================================================================ */


/**
 * @brief Capture Compare Unit 4 - Unit 0 (CCU4)
 */

    typedef struct                                  /*!< (@ 0x48040000) CCU4 Structure                                         */
    {
        __IO uint32_t GCTRL;                        /*!< (@ 0x48040000) Global Control Register                                */
        __I uint32_t GSTAT;                         /*!< (@ 0x48040004) Global Status Register                                 */
        __O uint32_t GIDLS;                         /*!< (@ 0x48040008) Global Idle Set                                        */
        __O uint32_t GIDLC;                         /*!< (@ 0x4804000C) Global Idle Clear                                      */
        __O uint32_t GCSS;                          /*!< (@ 0x48040010) Global Channel Set                                     */
        __O uint32_t GCSC;                          /*!< (@ 0x48040014) Global Channel Clear                                   */
        __I uint32_t GCST;                          /*!< (@ 0x48040018) Global Channel Status                                  */
        __I uint32_t RESERVED0[ 25 ];
        __I uint32_t MIDR;                          /*!< (@ 0x48040080) Module Identification                                  */
    } CCU4_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================              CCU4_CC4 [CCU40_CC40]             ================ */
/* ================================================================================ */


/**
 * @brief Capture Compare Unit 4 - Unit 0 (CCU4_CC4)
 */

    typedef struct                                  /*!< (@ 0x48040100) CCU4_CC4 Structure                                     */
    {
        __IO uint32_t INS;                          /*!< (@ 0x48040100) Input Selector Configuration                           */
        __IO uint32_t CMC;                          /*!< (@ 0x48040104) Connection Matrix Control                              */
        __I uint32_t TCST;                          /*!< (@ 0x48040108) Slice Timer Status                                     */
        __O uint32_t TCSET;                         /*!< (@ 0x4804010C) Slice Timer Run Set                                    */
        __O uint32_t TCCLR;                         /*!< (@ 0x48040110) Slice Timer Clear                                      */
        __IO uint32_t TC;                           /*!< (@ 0x48040114) Slice Timer Control                                    */
        __IO uint32_t PSL;                          /*!< (@ 0x48040118) Passive Level Config                                   */
        __I uint32_t DIT;                           /*!< (@ 0x4804011C) Dither Config                                          */
        __IO uint32_t DITS;                         /*!< (@ 0x48040120) Dither Shadow Register                                 */
        __IO uint32_t PSC;                          /*!< (@ 0x48040124) Prescaler Control                                      */
        __IO uint32_t FPC;                          /*!< (@ 0x48040128) Floating Prescaler Control                             */
        __IO uint32_t FPCS;                         /*!< (@ 0x4804012C) Floating Prescaler Shadow                              */
        __I uint32_t PR;                            /*!< (@ 0x48040130) Timer Period Value                                     */
        __IO uint32_t PRS;                          /*!< (@ 0x48040134) Timer Shadow Period Value                              */
        __I uint32_t CR;                            /*!< (@ 0x48040138) Timer Compare Value                                    */
        __IO uint32_t CRS;                          /*!< (@ 0x4804013C) Timer Shadow Compare Value                             */
        __I uint32_t RESERVED0[ 12 ];
        __IO uint32_t TIMER;                        /*!< (@ 0x48040170) Timer Value                                            */
        __I uint32_t CV[ 4 ];                       /*!< (@ 0x48040174) Capture Register 0                                     */
        __I uint32_t RESERVED1[ 7 ];
        __I uint32_t INTS;                          /*!< (@ 0x480401A0) Interrupt Status                                       */
        __IO uint32_t INTE;                         /*!< (@ 0x480401A4) Interrupt Enable Control                               */
        __IO uint32_t SRS;                          /*!< (@ 0x480401A8) Service Request Selector                               */
        __O uint32_t SWS;                           /*!< (@ 0x480401AC) Interrupt Status Set                                   */
        __O uint32_t SWR;                           /*!< (@ 0x480401B0) Interrupt Status Clear                                 */
        __I uint32_t RESERVED2;
        __I uint32_t ECRD0;                         /*!< (@ 0x480401B8) Extended Read Back 0                                   */
        __I uint32_t ECRD1;                         /*!< (@ 0x480401BC) Extended Read Back 1                                   */
    } CCU4_CC4_TypeDef;


/* ================================================================================ */
/* ================                   VADC [VADC]                  ================ */
/* ================================================================================ */


/**
 * @brief Analog to Digital Converter (VADC)
 */

    typedef struct                                  /*!< (@ 0x48030000) VADC Structure                                         */
    {
        __IO uint32_t CLC;                          /*!< (@ 0x48030000) Clock Control Register                                 */
        __I uint32_t RESERVED0;
        __I uint32_t ID;                            /*!< (@ 0x48030008) Module Identification Register                         */
        __I uint32_t RESERVED1[ 7 ];
        __IO uint32_t OCS;                          /*!< (@ 0x48030028) OCDS Control and Status Register                       */
        __I uint32_t RESERVED2[ 21 ];
        __IO uint32_t GLOBCFG;                      /*!< (@ 0x48030080) Global Configuration Register                          */
        __I uint32_t RESERVED3;
        __IO uint32_t ACCPROT0;                     /*!< (@ 0x48030088) Access Protection Register                             */
        __IO uint32_t ACCPROT1;                     /*!< (@ 0x4803008C) Access Protection Register                             */
        __I uint32_t RESERVED4[ 4 ];
        __IO uint32_t GLOBICLASS[ 2 ];              /*!< (@ 0x480300A0) Input Class Register, Global                           */
        __I uint32_t RESERVED5[ 4 ];
        __IO uint32_t GLOBBOUND;                    /*!< (@ 0x480300B8) Global Boundary Select Register                        */
        __I uint32_t RESERVED6[ 9 ];
        __IO uint32_t GLOBEFLAG;                    /*!< (@ 0x480300E0) Global Event Flag Register                             */
        __I uint32_t RESERVED7[ 23 ];
        __IO uint32_t GLOBEVNP;                     /*!< (@ 0x48030140) Global Event Node Pointer Register                     */
        __I uint32_t RESERVED8[ 15 ];
        __IO uint32_t BRSSEL[ 2 ];                  /*!< (@ 0x48030180) Background Request Source Channel Select Register      */
        __I uint32_t RESERVED9[ 14 ];
        __IO uint32_t BRSPND[ 2 ];                  /*!< (@ 0x480301C0) Background Request Source Pending Register             */
        __I uint32_t RESERVED10[ 14 ];
        __IO uint32_t BRSCTRL;                      /*!< (@ 0x48030200) Background Request Source Control Register             */
        __IO uint32_t BRSMR;                        /*!< (@ 0x48030204) Background Request Source Mode Register                */
        __I uint32_t RESERVED11[ 30 ];
        __IO uint32_t GLOBRCR;                      /*!< (@ 0x48030280) Global Result Control Register                         */
        __I uint32_t RESERVED12[ 31 ];
        __IO uint32_t GLOBRES;                      /*!< (@ 0x48030300) Global Result Register                                 */
        __I uint32_t RESERVED13[ 31 ];
        __IO uint32_t GLOBRESD;                     /*!< (@ 0x48030380) Global Result Register, Debug                          */
        __I uint32_t RESERVED14[ 27 ];
        __IO uint32_t EMUXSEL;                      /*!< (@ 0x480303F0) External Multiplexer Select Register                   */
    } VADC_GLOBAL_TypeDef;


/* ================================================================================ */
/* ================                VADC_G [VADC_G0]                ================ */
/* ================================================================================ */


/**
 * @brief Analog to Digital Converter (VADC_G)
 */

