FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    typedef struct                                  /*!< (@ 0x48030400) VADC_G Structure                                       */
    {
        __I uint32_t RESERVED0[ 32 ];
        __IO uint32_t ARBCFG;                       /*!< (@ 0x48030480) Arbitration Configuration Register                     */
        __IO uint32_t ARBPR;                        /*!< (@ 0x48030484) Arbitration Priority Register                          */
        __IO uint32_t CHASS;                        /*!< (@ 0x48030488) Channel Assignment Register                            */
        __IO uint32_t RRASS;                        /*!< (@ 0x4803048C) Result Assignment Register                             */
        __I uint32_t RESERVED1[ 4 ];
        __IO uint32_t ICLASS[ 2 ];                  /*!< (@ 0x480304A0) Input Class Register 0                                 */
        __I uint32_t RESERVED2[ 2 ];
        __IO uint32_t ALIAS;                        /*!< (@ 0x480304B0) Alias Register                                         */
        __I uint32_t RESERVED3;
        __IO uint32_t BOUND;                        /*!< (@ 0x480304B8) Boundary Select Register                               */
        __I uint32_t RESERVED4;
        __IO uint32_t SYNCTR;                       /*!< (@ 0x480304C0) Synchronization Control Register                       */
        __I uint32_t RESERVED5;
        __IO uint32_t BFL;                          /*!< (@ 0x480304C8) Boundary Flag Register                                 */
        __O uint32_t BFLS;                          /*!< (@ 0x480304CC) Boundary Flag Software Register                        */
        __IO uint32_t BFLC;                         /*!< (@ 0x480304D0) Boundary Flag Control Register                         */
        __IO uint32_t BFLNP;                        /*!< (@ 0x480304D4) Boundary Flag Node Pointer Register                    */
        __I uint32_t RESERVED6[ 10 ];
        __IO uint32_t QCTRL0;                       /*!< (@ 0x48030500) Queue 0 Source Control Register                        */
        __IO uint32_t QMR0;                         /*!< (@ 0x48030504) Queue 0 Mode Register                                  */
        __I uint32_t QSR0;                          /*!< (@ 0x48030508) Queue 0 Status Register                                */
        __I uint32_t Q0R0;                          /*!< (@ 0x4803050C) Queue 0 Register 0                                     */

        union
        {
            __I uint32_t QBUR0;                     /*!< (@ 0x48030510) Queue 0 Backup Register                                */
            __O uint32_t QINR0;                     /*!< (@ 0x48030510) Queue 0 Input Register                                 */
        };
        __I uint32_t RESERVED7[ 3 ];
        __IO uint32_t ASCTRL;                       /*!< (@ 0x48030520) Autoscan Source Control Register                       */
        __IO uint32_t ASMR;                         /*!< (@ 0x48030524) Autoscan Source Mode Register                          */
        __IO uint32_t ASSEL;                        /*!< (@ 0x48030528) Autoscan Source Channel Select Register                */
        __IO uint32_t ASPND;                        /*!< (@ 0x4803052C) Autoscan Source Pending Register                       */
        __I uint32_t RESERVED8[ 20 ];
        __IO uint32_t CEFLAG;                       /*!< (@ 0x48030580) Channel Event Flag Register                            */
        __IO uint32_t REFLAG;                       /*!< (@ 0x48030584) Result Event Flag Register                             */
        __IO uint32_t SEFLAG;                       /*!< (@ 0x48030588) Source Event Flag Register                             */
        __I uint32_t RESERVED9;
        __O uint32_t CEFCLR;                        /*!< (@ 0x48030590) Channel Event Flag Clear Register                      */
        __O uint32_t REFCLR;                        /*!< (@ 0x48030594) Result Event Flag Clear Register                       */
        __O uint32_t SEFCLR;                        /*!< (@ 0x48030598) Source Event Flag Clear Register                       */
        __I uint32_t RESERVED10;
        __IO uint32_t CEVNP0;                       /*!< (@ 0x480305A0) Channel Event Node Pointer Register 0                  */
        __I uint32_t RESERVED11[ 3 ];
        __IO uint32_t REVNP0;                       /*!< (@ 0x480305B0) Result Event Node Pointer Register 0                   */
        __IO uint32_t REVNP1;                       /*!< (@ 0x480305B4) Result Event Node Pointer Register 1                   */
        __I uint32_t RESERVED12[ 2 ];
        __IO uint32_t SEVNP;                        /*!< (@ 0x480305C0) Source Event Node Pointer Register                     */
        __I uint32_t RESERVED13;
        __O uint32_t SRACT;                         /*!< (@ 0x480305C8) Service Request Software Activation Trigger            */
        __I uint32_t RESERVED14[ 9 ];
        __IO uint32_t EMUXCTR;                      /*!< (@ 0x480305F0) E0ternal Multiplexer Control Register, Group
                                                     *   x                                                                     */
        __I uint32_t RESERVED15;
        __IO uint32_t VFR;                          /*!< (@ 0x480305F8) Valid Flag Register, Group 0                           */
        __I uint32_t RESERVED16;
        __IO uint32_t CHCTR[ 8 ];                   /*!< (@ 0x48030600) Channel Ctrl. Reg.                                     */
        __I uint32_t RESERVED17[ 24 ];
        __IO uint32_t RCR[ 16 ];                    /*!< (@ 0x48030680) Result Control Reg.                                    */
        __I uint32_t RESERVED18[ 16 ];
        __IO uint32_t RES[ 16 ];                    /*!< (@ 0x48030700) Result Register                                        */
        __I uint32_t RESERVED19[ 16 ];
        __I uint32_t RESD[ 16 ];                    /*!< (@ 0x48030780) Result Register, Debug                                 */
    } VADC_G_TypeDef;


/* ================================================================================ */
/* ================                   SHS [SHS0]                   ================ */
/* ================================================================================ */


/**
 * @brief Sample and Hold ADC Sequencer (SHS)
 */

    typedef struct                                  /*!< (@ 0x48034000) SHS Structure                                          */
    {
        __I uint32_t RESERVED0[ 2 ];
        __I uint32_t ID;                            /*!< (@ 0x48034008) Module Identification Register                         */
        __I uint32_t RESERVED1[ 13 ];
        __IO uint32_t SHSCFG;                       /*!< (@ 0x48034040) SHS Configuration Register                             */
        __IO uint32_t STEPCFG;                      /*!< (@ 0x48034044) Stepper Configuration Register                         */
        __I uint32_t RESERVED2[ 2 ];
        __IO uint32_t LOOP;                         /*!< (@ 0x48034050) Loop Control Register                                  */
        __I uint32_t RESERVED3[ 11 ];
        __IO uint32_t TIMCFG0;                      /*!< (@ 0x48034080) Timing Configuration Register 0                        */
        __IO uint32_t TIMCFG1;                      /*!< (@ 0x48034084) Timing Configuration Register 1                        */
        __I uint32_t RESERVED4[ 13 ];
        __IO uint32_t CALCTR;                       /*!< (@ 0x480340BC) Calibration Control Register                           */
        __IO uint32_t CALGC0;                       /*!< (@ 0x480340C0) Gain Calibration Control Register 0                    */
        __IO uint32_t CALGC1;                       /*!< (@ 0x480340C4) Gain Calibration Control Register 1                    */
        __I uint32_t RESERVED5[ 46 ];
        __IO uint32_t GNCTR00;                      /*!< (@ 0x48034180) Gain Control Register 00                               */
        __I uint32_t RESERVED6[ 3 ];
        __IO uint32_t GNCTR10;                      /*!< (@ 0x48034190) Gain Control Register 10                               */
    } SHS_Type;


/* ================================================================================ */
/* ================                  BCCU [BCCU0]                  ================ */
/* ================================================================================ */


/**
 * @brief BCCU Unit 0 (BCCU)
 */

    typedef struct                                  /*!< (@ 0x50030000) BCCU Structure                                         */
    {
        __IO uint32_t GLOBCON;                      /*!< (@ 0x50030000) Global Control                                         */
        __IO uint32_t GLOBCLK;                      /*!< (@ 0x50030004) Global Clock                                           */
        __I uint32_t ID;                            /*!< (@ 0x50030008) Module Identification                                  */
        __IO uint32_t CHEN;                         /*!< (@ 0x5003000C) Channel Enable                                         */
        __IO uint32_t CHOCON;                       /*!< (@ 0x50030010) Channel Output Control                                 */
        __IO uint32_t CHTRIG;                       /*!< (@ 0x50030014) Channel Trigger                                        */
        __IO uint32_t CHSTRCON;                     /*!< (@ 0x50030018) Channel Shadow Transfer                                */
        __I uint32_t LTCHOL;                        /*!< (@ 0x5003001C) Last Trigger Channel Output Level                      */
        __IO uint32_t DEEN;                         /*!< (@ 0x50030020) Dimming Engine Enable                                  */
        __IO uint32_t DESTRCON;                     /*!< (@ 0x50030024) Dimming Shadow Transfer                                */
        __IO uint32_t GLOBDIM;                      /*!< (@ 0x50030028) Global Dimming Level                                   */
        __IO uint32_t EVIER;                        /*!< (@ 0x5003002C) Event Interrupt Enable                                 */
        __I uint32_t EVFR;                          /*!< (@ 0x50030030) Event Flag                                             */
        __O uint32_t EVFSR;                         /*!< (@ 0x50030034) Event Flag Set                                         */
        __O uint32_t EVFCR;                         /*!< (@ 0x50030038) Event Flag Clear                                       */
    } BCCU_Type;


/* ================================================================================ */
/* ================               BCCU_CH [BCCU0_CH0]              ================ */
/* ================================================================================ */


/**
 * @brief BCCU Unit 0 (BCCU_CH)
 */

    typedef struct                                  /*!< (@ 0x5003003C) BCCU_CH Structure                                      */
    {
        __IO uint32_t INTS;                         /*!< (@ 0x5003003C) Channel Intensit0 Shadow                               */
        __I uint32_t INT;                           /*!< (@ 0x50030040) Channel Intensit0                                      */
        __IO uint32_t CHCONFIG;                     /*!< (@ 0x50030044) Channel Configuration                                  */
        __IO uint32_t PKCMP;                        /*!< (@ 0x50030048) Packer Compare                                         */
        __IO uint32_t PKCNTR;                       /*!< (@ 0x5003004C) Packer Counter                                         */
    } BCCU_CH_Type;


/* ================================================================================ */
/* ================               BCCU_DE [BCCU0_DE0]              ================ */
/* ================================================================================ */


/**
 * @brief BCCU Unit 0 (BCCU_DE)
 */

