FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    typedef struct                                  /*!< (@ 0x5003017C) BCCU_DE Structure                                      */
    {
        __IO uint32_t DLS;                          /*!< (@ 0x5003017C) Dimming Level Shadow                                   */
        __I uint32_t DL;                            /*!< (@ 0x50030180) Dimming Level                                          */
        __IO uint32_t DTT;                          /*!< (@ 0x50030184) Dimming Transition Time                                */
    } BCCU_DE_Type;


/* ================================================================================ */
/* ================                      PORT0                     ================ */
/* ================================================================================ */


/**
 * @brief Port 0 (PORT0)
 */

    typedef struct                                  /*!< (@ 0x40040000) PORT0 Structure                                        */
    {
        __IO uint32_t OUT;                          /*!< (@ 0x40040000) Port 0 Output Register                                 */
        __O uint32_t OMR;                           /*!< (@ 0x40040004) Port 0 Output Modification Register                    */
        __I uint32_t RESERVED0[ 2 ];
        __IO uint32_t IOCR0;                        /*!< (@ 0x40040010) Port 0 Input/Output Control Register 0                 */
        __IO uint32_t IOCR4;                        /*!< (@ 0x40040014) Port 0 Input/Output Control Register 4                 */
        __IO uint32_t IOCR8;                        /*!< (@ 0x40040018) Port 0 Input/Output Control Register 8                 */
        __IO uint32_t IOCR12;                       /*!< (@ 0x4004001C) Port 0 Input/Output Control Register 12                */
        __I uint32_t RESERVED1;
        __I uint32_t IN;                            /*!< (@ 0x40040024) Port 0 Input Register                                  */
        __I uint32_t RESERVED2[ 6 ];
        __IO uint32_t PHCR0;                        /*!< (@ 0x40040040) Port 0 Pad Hysteresis Control Register 0               */
        __IO uint32_t PHCR1;                        /*!< (@ 0x40040044) Port 0 Pad Hysteresis Control Register 1               */
        __I uint32_t RESERVED3[ 6 ];
        __I uint32_t PDISC;                         /*!< (@ 0x40040060) Port 0 Pin Function Decision Control Register          */
        __I uint32_t RESERVED4[ 3 ];
        __IO uint32_t PPS;                          /*!< (@ 0x40040070) Port 0 Pin Power Save Register                         */
        __IO uint32_t HWSEL;                        /*!< (@ 0x40040074) Port 0 Pin Hardware Select Register                    */
    } PORT0_Type;


/* ================================================================================ */
/* ================                      PORT1                     ================ */
/* ================================================================================ */


/**
 * @brief Port 1 (PORT1)
 */

    typedef struct                                  /*!< (@ 0x40040100) PORT1 Structure                                        */
    {
        __IO uint32_t OUT;                          /*!< (@ 0x40040100) Port 1 Output Register                                 */
        __O uint32_t OMR;                           /*!< (@ 0x40040104) Port 1 Output Modification Register                    */
        __I uint32_t RESERVED0[ 2 ];
        __IO uint32_t IOCR0;                        /*!< (@ 0x40040110) Port 1 Input/Output Control Register 0                 */
        __IO uint32_t IOCR4;                        /*!< (@ 0x40040114) Port 1 Input/Output Control Register 4                 */
        __I uint32_t RESERVED1[ 3 ];
        __I uint32_t IN;                            /*!< (@ 0x40040124) Port 1 Input Register                                  */
        __I uint32_t RESERVED2[ 6 ];
        __IO uint32_t PHCR0;                        /*!< (@ 0x40040140) Port 1 Pad Hysteresis Control Register 0               */
        __I uint32_t RESERVED3[ 7 ];
        __I uint32_t PDISC;                         /*!< (@ 0x40040160) Port 1 Pin Function Decision Control Register          */
        __I uint32_t RESERVED4[ 3 ];
        __IO uint32_t PPS;                          /*!< (@ 0x40040170) Port 1 Pin Power Save Register                         */
        __IO uint32_t HWSEL;                        /*!< (@ 0x40040174) Port 1 Pin Hardware Select Register                    */
    } PORT1_Type;


/* ================================================================================ */
/* ================                      PORT2                     ================ */
/* ================================================================================ */


/**
 * @brief Port 2 (PORT2)
 */

    typedef struct                                  /*!< (@ 0x40040200) PORT2 Structure                                        */
    {
        __IO uint32_t OUT;                          /*!< (@ 0x40040200) Port 2 Output Register                                 */
        __O uint32_t OMR;                           /*!< (@ 0x40040204) Port 2 Output Modification Register                    */
        __I uint32_t RESERVED0[ 2 ];
        __IO uint32_t IOCR0;                        /*!< (@ 0x40040210) Port 2 Input/Output Control Register 0                 */
        __IO uint32_t IOCR4;                        /*!< (@ 0x40040214) Port 2 Input/Output Control Register 4                 */
        __IO uint32_t IOCR8;                        /*!< (@ 0x40040218) Port 2 Input/Output Control Register 8                 */
        __I uint32_t RESERVED1[ 2 ];
        __I uint32_t IN;                            /*!< (@ 0x40040224) Port 2 Input Register                                  */
        __I uint32_t RESERVED2[ 6 ];
        __IO uint32_t PHCR0;                        /*!< (@ 0x40040240) Port 2 Pad Hysteresis Control Register 0               */
        __IO uint32_t PHCR1;                        /*!< (@ 0x40040244) Port 2 Pad Hysteresis Control Register 1               */
        __I uint32_t RESERVED3[ 6 ];
        __IO uint32_t PDISC;                        /*!< (@ 0x40040260) Port 2 Pin Function Decision Control Register          */
        __I uint32_t RESERVED4[ 3 ];
        __IO uint32_t PPS;                          /*!< (@ 0x40040270) Port 2 Pin Power Save Register                         */
        __IO uint32_t HWSEL;                        /*!< (@ 0x40040274) Port 2 Pin Hardware Select Register                    */
    } PORT2_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
    #if defined( __CC_ARM )
        #pragma pop
    #elif defined( __ICCARM__ )
        /* leave anonymous unions enabled */
    #elif defined( __GNUC__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TMS470__ )
        /* anonymous unions are enabled by default */
    #elif defined( __TASKING__ )
        #pragma warning restore
    #else
        #warning Not supported compiler type
    #endif /* if defined( __CC_ARM ) */



/* ================================================================================ */
/* ================          struct 'PPB' Position & Mask          ================ */
/* ================================================================================ */


/* --------------------------------  PPB_SYST_CSR  -------------------------------- */
    #define PPB_SYST_CSR_ENABLE_Pos       0                                                           /*!< PPB SYST_CSR: ENABLE Position           */
    #define PPB_SYST_CSR_ENABLE_Msk       ( 0x01UL << PPB_SYST_CSR_ENABLE_Pos )                       /*!< PPB SYST_CSR: ENABLE Mask               */
    #define PPB_SYST_CSR_TICKINT_Pos      1                                                           /*!< PPB SYST_CSR: TICKINT Position          */
    #define PPB_SYST_CSR_TICKINT_Msk      ( 0x01UL << PPB_SYST_CSR_TICKINT_Pos )                      /*!< PPB SYST_CSR: TICKINT Mask              */
    #define PPB_SYST_CSR_CLKSOURCE_Pos    2                                                           /*!< PPB SYST_CSR: CLKSOURCE Position        */
    #define PPB_SYST_CSR_CLKSOURCE_Msk    ( 0x01UL << PPB_SYST_CSR_CLKSOURCE_Pos )                    /*!< PPB SYST_CSR: CLKSOURCE Mask            */
    #define PPB_SYST_CSR_COUNTFLAG_Pos    16                                                          /*!< PPB SYST_CSR: COUNTFLAG Position        */
    #define PPB_SYST_CSR_COUNTFLAG_Msk    ( 0x01UL << PPB_SYST_CSR_COUNTFLAG_Pos )                    /*!< PPB SYST_CSR: COUNTFLAG Mask            */

/* --------------------------------  PPB_SYST_RVR  -------------------------------- */
    #define PPB_SYST_RVR_RELOAD_Pos       0                                                           /*!< PPB SYST_RVR: RELOAD Position           */
    #define PPB_SYST_RVR_RELOAD_Msk       ( 0x00ffffffUL << PPB_SYST_RVR_RELOAD_Pos )                 /*!< PPB SYST_RVR: RELOAD Mask               */

/* --------------------------------  PPB_SYST_CVR  -------------------------------- */
    #define PPB_SYST_CVR_CURRENT_Pos      0                                                           /*!< PPB SYST_CVR: CURRENT Position          */
    #define PPB_SYST_CVR_CURRENT_Msk      ( 0x00ffffffUL << PPB_SYST_CVR_CURRENT_Pos )                /*!< PPB SYST_CVR: CURRENT Mask              */

/* -------------------------------  PPB_SYST_CALIB  ------------------------------- */
    #define PPB_SYST_CALIB_TENMS_Pos      0                                                           /*!< PPB SYST_CALIB: TENMS Position          */
    #define PPB_SYST_CALIB_TENMS_Msk      ( 0x00ffffffUL << PPB_SYST_CALIB_TENMS_Pos )                /*!< PPB SYST_CALIB: TENMS Mask              */
    #define PPB_SYST_CALIB_SKEW_Pos       30                                                          /*!< PPB SYST_CALIB: SKEW Position           */
    #define PPB_SYST_CALIB_SKEW_Msk       ( 0x01UL << PPB_SYST_CALIB_SKEW_Pos )                       /*!< PPB SYST_CALIB: SKEW Mask               */
    #define PPB_SYST_CALIB_NOREF_Pos      31                                                          /*!< PPB SYST_CALIB: NOREF Position          */
    #define PPB_SYST_CALIB_NOREF_Msk      ( 0x01UL << PPB_SYST_CALIB_NOREF_Pos )                      /*!< PPB SYST_CALIB: NOREF Mask              */

/* --------------------------------  PPB_NVIC_ISER  ------------------------------- */
    #define PPB_NVIC_ISER_SETENA_Pos      0                                                           /*!< PPB NVIC_ISER: SETENA Position          */
    #define PPB_NVIC_ISER_SETENA_Msk      ( 0xffffffffUL << PPB_NVIC_ISER_SETENA_Pos )                /*!< PPB NVIC_ISER: SETENA Mask              */

/* --------------------------------  PPB_NVIC_ICER  ------------------------------- */
    #define PPB_NVIC_ICER_CLRENA_Pos      0                                                           /*!< PPB NVIC_ICER: CLRENA Position          */
    #define PPB_NVIC_ICER_CLRENA_Msk      ( 0xffffffffUL << PPB_NVIC_ICER_CLRENA_Pos )                /*!< PPB NVIC_ICER: CLRENA Mask              */

/* --------------------------------  PPB_NVIC_ISPR  ------------------------------- */
    #define PPB_NVIC_ISPR_SETPEND_Pos     0                                                           /*!< PPB NVIC_ISPR: SETPEND Position         */
    #define PPB_NVIC_ISPR_SETPEND_Msk     ( 0xffffffffUL << PPB_NVIC_ISPR_SETPEND_Pos )               /*!< PPB NVIC_ISPR: SETPEND Mask             */

/* --------------------------------  PPB_NVIC_ICPR  ------------------------------- */
    #define PPB_NVIC_ICPR_CLRPEND_Pos     0                                                           /*!< PPB NVIC_ICPR: CLRPEND Position         */
    #define PPB_NVIC_ICPR_CLRPEND_Msk     ( 0xffffffffUL << PPB_NVIC_ICPR_CLRPEND_Pos )               /*!< PPB NVIC_ICPR: CLRPEND Mask             */

/* --------------------------------  PPB_NVIC_IPR0  ------------------------------- */
    #define PPB_NVIC_IPR0_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR0: PRI_0 Position           */
    #define PPB_NVIC_IPR0_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR0_PRI_0_Pos )                 /*!< PPB NVIC_IPR0: PRI_0 Mask               */
    #define PPB_NVIC_IPR0_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR0: PRI_1 Position           */
    #define PPB_NVIC_IPR0_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR0_PRI_1_Pos )                 /*!< PPB NVIC_IPR0: PRI_1 Mask               */
    #define PPB_NVIC_IPR0_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR0: PRI_2 Position           */
    #define PPB_NVIC_IPR0_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR0_PRI_2_Pos )                 /*!< PPB NVIC_IPR0: PRI_2 Mask               */
    #define PPB_NVIC_IPR0_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR0: PRI_3 Position           */
    #define PPB_NVIC_IPR0_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR0_PRI_3_Pos )                 /*!< PPB NVIC_IPR0: PRI_3 Mask               */

