FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  PPB_NVIC_IPR1  ------------------------------- */
    #define PPB_NVIC_IPR1_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR1: PRI_0 Position           */
    #define PPB_NVIC_IPR1_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR1_PRI_0_Pos )                 /*!< PPB NVIC_IPR1: PRI_0 Mask               */
    #define PPB_NVIC_IPR1_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR1: PRI_1 Position           */
    #define PPB_NVIC_IPR1_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR1_PRI_1_Pos )                 /*!< PPB NVIC_IPR1: PRI_1 Mask               */
    #define PPB_NVIC_IPR1_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR1: PRI_2 Position           */
    #define PPB_NVIC_IPR1_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR1_PRI_2_Pos )                 /*!< PPB NVIC_IPR1: PRI_2 Mask               */
    #define PPB_NVIC_IPR1_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR1: PRI_3 Position           */
    #define PPB_NVIC_IPR1_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR1_PRI_3_Pos )                 /*!< PPB NVIC_IPR1: PRI_3 Mask               */

/* --------------------------------  PPB_NVIC_IPR2  ------------------------------- */
    #define PPB_NVIC_IPR2_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR2: PRI_0 Position           */
    #define PPB_NVIC_IPR2_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR2_PRI_0_Pos )                 /*!< PPB NVIC_IPR2: PRI_0 Mask               */
    #define PPB_NVIC_IPR2_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR2: PRI_1 Position           */
    #define PPB_NVIC_IPR2_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR2_PRI_1_Pos )                 /*!< PPB NVIC_IPR2: PRI_1 Mask               */
    #define PPB_NVIC_IPR2_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR2: PRI_2 Position           */
    #define PPB_NVIC_IPR2_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR2_PRI_2_Pos )                 /*!< PPB NVIC_IPR2: PRI_2 Mask               */
    #define PPB_NVIC_IPR2_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR2: PRI_3 Position           */
    #define PPB_NVIC_IPR2_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR2_PRI_3_Pos )                 /*!< PPB NVIC_IPR2: PRI_3 Mask               */

/* --------------------------------  PPB_NVIC_IPR3  ------------------------------- */
    #define PPB_NVIC_IPR3_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR3: PRI_0 Position           */
    #define PPB_NVIC_IPR3_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR3_PRI_0_Pos )                 /*!< PPB NVIC_IPR3: PRI_0 Mask               */
    #define PPB_NVIC_IPR3_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR3: PRI_1 Position           */
    #define PPB_NVIC_IPR3_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR3_PRI_1_Pos )                 /*!< PPB NVIC_IPR3: PRI_1 Mask               */
    #define PPB_NVIC_IPR3_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR3: PRI_2 Position           */
    #define PPB_NVIC_IPR3_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR3_PRI_2_Pos )                 /*!< PPB NVIC_IPR3: PRI_2 Mask               */
    #define PPB_NVIC_IPR3_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR3: PRI_3 Position           */
    #define PPB_NVIC_IPR3_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR3_PRI_3_Pos )                 /*!< PPB NVIC_IPR3: PRI_3 Mask               */

/* --------------------------------  PPB_NVIC_IPR4  ------------------------------- */
    #define PPB_NVIC_IPR4_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR4: PRI_0 Position           */
    #define PPB_NVIC_IPR4_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR4_PRI_0_Pos )                 /*!< PPB NVIC_IPR4: PRI_0 Mask               */
    #define PPB_NVIC_IPR4_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR4: PRI_1 Position           */
    #define PPB_NVIC_IPR4_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR4_PRI_1_Pos )                 /*!< PPB NVIC_IPR4: PRI_1 Mask               */
    #define PPB_NVIC_IPR4_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR4: PRI_2 Position           */
    #define PPB_NVIC_IPR4_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR4_PRI_2_Pos )                 /*!< PPB NVIC_IPR4: PRI_2 Mask               */
    #define PPB_NVIC_IPR4_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR4: PRI_3 Position           */
    #define PPB_NVIC_IPR4_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR4_PRI_3_Pos )                 /*!< PPB NVIC_IPR4: PRI_3 Mask               */

/* --------------------------------  PPB_NVIC_IPR5  ------------------------------- */
    #define PPB_NVIC_IPR5_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR5: PRI_0 Position           */
    #define PPB_NVIC_IPR5_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR5_PRI_0_Pos )                 /*!< PPB NVIC_IPR5: PRI_0 Mask               */
    #define PPB_NVIC_IPR5_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR5: PRI_1 Position           */
    #define PPB_NVIC_IPR5_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR5_PRI_1_Pos )                 /*!< PPB NVIC_IPR5: PRI_1 Mask               */
    #define PPB_NVIC_IPR5_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR5: PRI_2 Position           */
    #define PPB_NVIC_IPR5_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR5_PRI_2_Pos )                 /*!< PPB NVIC_IPR5: PRI_2 Mask               */
    #define PPB_NVIC_IPR5_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR5: PRI_3 Position           */
    #define PPB_NVIC_IPR5_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR5_PRI_3_Pos )                 /*!< PPB NVIC_IPR5: PRI_3 Mask               */

/* --------------------------------  PPB_NVIC_IPR6  ------------------------------- */
    #define PPB_NVIC_IPR6_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR6: PRI_0 Position           */
    #define PPB_NVIC_IPR6_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR6_PRI_0_Pos )                 /*!< PPB NVIC_IPR6: PRI_0 Mask               */
    #define PPB_NVIC_IPR6_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR6: PRI_1 Position           */
    #define PPB_NVIC_IPR6_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR6_PRI_1_Pos )                 /*!< PPB NVIC_IPR6: PRI_1 Mask               */
    #define PPB_NVIC_IPR6_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR6: PRI_2 Position           */
    #define PPB_NVIC_IPR6_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR6_PRI_2_Pos )                 /*!< PPB NVIC_IPR6: PRI_2 Mask               */
    #define PPB_NVIC_IPR6_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR6: PRI_3 Position           */
    #define PPB_NVIC_IPR6_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR6_PRI_3_Pos )                 /*!< PPB NVIC_IPR6: PRI_3 Mask               */

