FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  PPB_NVIC_IPR7  ------------------------------- */
    #define PPB_NVIC_IPR7_PRI_0_Pos       0                                                           /*!< PPB NVIC_IPR7: PRI_0 Position           */
    #define PPB_NVIC_IPR7_PRI_0_Msk       ( 0x000000ffUL << PPB_NVIC_IPR7_PRI_0_Pos )                 /*!< PPB NVIC_IPR7: PRI_0 Mask               */
    #define PPB_NVIC_IPR7_PRI_1_Pos       8                                                           /*!< PPB NVIC_IPR7: PRI_1 Position           */
    #define PPB_NVIC_IPR7_PRI_1_Msk       ( 0x000000ffUL << PPB_NVIC_IPR7_PRI_1_Pos )                 /*!< PPB NVIC_IPR7: PRI_1 Mask               */
    #define PPB_NVIC_IPR7_PRI_2_Pos       16                                                          /*!< PPB NVIC_IPR7: PRI_2 Position           */
    #define PPB_NVIC_IPR7_PRI_2_Msk       ( 0x000000ffUL << PPB_NVIC_IPR7_PRI_2_Pos )                 /*!< PPB NVIC_IPR7: PRI_2 Mask               */
    #define PPB_NVIC_IPR7_PRI_3_Pos       24                                                          /*!< PPB NVIC_IPR7: PRI_3 Position           */
    #define PPB_NVIC_IPR7_PRI_3_Msk       ( 0x000000ffUL << PPB_NVIC_IPR7_PRI_3_Pos )                 /*!< PPB NVIC_IPR7: PRI_3 Mask               */

/* ----------------------------------  PPB_CPUID  --------------------------------- */
    #define PPB_CPUID_Revision_Pos        0                                                           /*!< PPB CPUID: Revision Position            */
    #define PPB_CPUID_Revision_Msk        ( 0x0fUL << PPB_CPUID_Revision_Pos )                        /*!< PPB CPUID: Revision Mask                */
    #define PPB_CPUID_PartNo_Pos          4                                                           /*!< PPB CPUID: PartNo Position              */
    #define PPB_CPUID_PartNo_Msk          ( 0x00000fffUL << PPB_CPUID_PartNo_Pos )                    /*!< PPB CPUID: PartNo Mask                  */
    #define PPB_CPUID_Architecture_Pos    16                                                          /*!< PPB CPUID: Architecture Position        */
    #define PPB_CPUID_Architecture_Msk    ( 0x0fUL << PPB_CPUID_Architecture_Pos )                    /*!< PPB CPUID: Architecture Mask            */
    #define PPB_CPUID_Variant_Pos         20                                                          /*!< PPB CPUID: Variant Position             */
    #define PPB_CPUID_Variant_Msk         ( 0x0fUL << PPB_CPUID_Variant_Pos )                         /*!< PPB CPUID: Variant Mask                 */
    #define PPB_CPUID_Implementer_Pos     24                                                          /*!< PPB CPUID: Implementer Position         */
    #define PPB_CPUID_Implementer_Msk     ( 0x000000ffUL << PPB_CPUID_Implementer_Pos )               /*!< PPB CPUID: Implementer Mask             */

/* ----------------------------------  PPB_ICSR  ---------------------------------- */
    #define PPB_ICSR_VECTACTIVE_Pos       0                                                           /*!< PPB ICSR: VECTACTIVE Position           */
    #define PPB_ICSR_VECTACTIVE_Msk       ( 0x3fUL << PPB_ICSR_VECTACTIVE_Pos )                       /*!< PPB ICSR: VECTACTIVE Mask               */
    #define PPB_ICSR_VECTPENDING_Pos      12                                                          /*!< PPB ICSR: VECTPENDING Position          */
    #define PPB_ICSR_VECTPENDING_Msk      ( 0x3fUL << PPB_ICSR_VECTPENDING_Pos )                      /*!< PPB ICSR: VECTPENDING Mask              */
    #define PPB_ICSR_ISRPENDING_Pos       22                                                          /*!< PPB ICSR: ISRPENDING Position           */
    #define PPB_ICSR_ISRPENDING_Msk       ( 0x01UL << PPB_ICSR_ISRPENDING_Pos )                       /*!< PPB ICSR: ISRPENDING Mask               */
    #define PPB_ICSR_PENDSTCLR_Pos        25                                                          /*!< PPB ICSR: PENDSTCLR Position            */
    #define PPB_ICSR_PENDSTCLR_Msk        ( 0x01UL << PPB_ICSR_PENDSTCLR_Pos )                        /*!< PPB ICSR: PENDSTCLR Mask                */
    #define PPB_ICSR_PENDSTSET_Pos        26                                                          /*!< PPB ICSR: PENDSTSET Position            */
    #define PPB_ICSR_PENDSTSET_Msk        ( 0x01UL << PPB_ICSR_PENDSTSET_Pos )                        /*!< PPB ICSR: PENDSTSET Mask                */
    #define PPB_ICSR_PENDSVCLR_Pos        27                                                          /*!< PPB ICSR: PENDSVCLR Position            */
    #define PPB_ICSR_PENDSVCLR_Msk        ( 0x01UL << PPB_ICSR_PENDSVCLR_Pos )                        /*!< PPB ICSR: PENDSVCLR Mask                */
    #define PPB_ICSR_PENDSVSET_Pos        28                                                          /*!< PPB ICSR: PENDSVSET Position            */
    #define PPB_ICSR_PENDSVSET_Msk        ( 0x01UL << PPB_ICSR_PENDSVSET_Pos )                        /*!< PPB ICSR: PENDSVSET Mask                */

/* ----------------------------------  PPB_AIRCR  --------------------------------- */
    #define PPB_AIRCR_SYSRESETREQ_Pos     2                                                           /*!< PPB AIRCR: SYSRESETREQ Position         */
    #define PPB_AIRCR_SYSRESETREQ_Msk     ( 0x01UL << PPB_AIRCR_SYSRESETREQ_Pos )                     /*!< PPB AIRCR: SYSRESETREQ Mask             */
    #define PPB_AIRCR_ENDIANNESS_Pos      15                                                          /*!< PPB AIRCR: ENDIANNESS Position          */
    #define PPB_AIRCR_ENDIANNESS_Msk      ( 0x01UL << PPB_AIRCR_ENDIANNESS_Pos )                      /*!< PPB AIRCR: ENDIANNESS Mask              */
    #define PPB_AIRCR_VECTKEY_Pos         16                                                          /*!< PPB AIRCR: VECTKEY Position             */
    #define PPB_AIRCR_VECTKEY_Msk         ( 0x0000ffffUL << PPB_AIRCR_VECTKEY_Pos )                   /*!< PPB AIRCR: VECTKEY Mask                 */

/* -----------------------------------  PPB_SCR  ---------------------------------- */
    #define PPB_SCR_SLEEPONEXIT_Pos       1                                                           /*!< PPB SCR: SLEEPONEXIT Position           */
    #define PPB_SCR_SLEEPONEXIT_Msk       ( 0x01UL << PPB_SCR_SLEEPONEXIT_Pos )                       /*!< PPB SCR: SLEEPONEXIT Mask               */
    #define PPB_SCR_SLEEPDEEP_Pos         2                                                           /*!< PPB SCR: SLEEPDEEP Position             */
    #define PPB_SCR_SLEEPDEEP_Msk         ( 0x01UL << PPB_SCR_SLEEPDEEP_Pos )                         /*!< PPB SCR: SLEEPDEEP Mask                 */
    #define PPB_SCR_SEVONPEND_Pos         4                                                           /*!< PPB SCR: SEVONPEND Position             */
    #define PPB_SCR_SEVONPEND_Msk         ( 0x01UL << PPB_SCR_SEVONPEND_Pos )                         /*!< PPB SCR: SEVONPEND Mask                 */

/* -----------------------------------  PPB_CCR  ---------------------------------- */
    #define PPB_CCR_UNALIGN_TRP_Pos       3                                                           /*!< PPB CCR: UNALIGN_TRP Position           */
    #define PPB_CCR_UNALIGN_TRP_Msk       ( 0x01UL << PPB_CCR_UNALIGN_TRP_Pos )                       /*!< PPB CCR: UNALIGN_TRP Mask               */
    #define PPB_CCR_STKALIGN_Pos          9                                                           /*!< PPB CCR: STKALIGN Position              */
    #define PPB_CCR_STKALIGN_Msk          ( 0x01UL << PPB_CCR_STKALIGN_Pos )                          /*!< PPB CCR: STKALIGN Mask                  */

/* ----------------------------------  PPB_SHPR2  --------------------------------- */
    #define PPB_SHPR2_PRI_11_Pos          24                                                          /*!< PPB SHPR2: PRI_11 Position              */
    #define PPB_SHPR2_PRI_11_Msk          ( 0x000000ffUL << PPB_SHPR2_PRI_11_Pos )                    /*!< PPB SHPR2: PRI_11 Mask                  */

