FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  PPB_SHPR3  --------------------------------- */
    #define PPB_SHPR3_PRI_14_Pos          16                                                          /*!< PPB SHPR3: PRI_14 Position              */
    #define PPB_SHPR3_PRI_14_Msk          ( 0x000000ffUL << PPB_SHPR3_PRI_14_Pos )                    /*!< PPB SHPR3: PRI_14 Mask                  */
    #define PPB_SHPR3_PRI_15_Pos          24                                                          /*!< PPB SHPR3: PRI_15 Position              */
    #define PPB_SHPR3_PRI_15_Msk          ( 0x000000ffUL << PPB_SHPR3_PRI_15_Pos )                    /*!< PPB SHPR3: PRI_15 Mask                  */

/* ----------------------------------  PPB_SHCSR  --------------------------------- */
    #define PPB_SHCSR_SVCALLPENDED_Pos    15                                                          /*!< PPB SHCSR: SVCALLPENDED Position        */
    #define PPB_SHCSR_SVCALLPENDED_Msk    ( 0x01UL << PPB_SHCSR_SVCALLPENDED_Pos )                    /*!< PPB SHCSR: SVCALLPENDED Mask            */


/* ================================================================================ */
/* ================           Group 'ERU' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  ERU_EXISEL  --------------------------------- */
    #define ERU_EXISEL_EXS0A_Pos    0                                                                 /*!< ERU EXISEL: EXS0A Position              */
    #define ERU_EXISEL_EXS0A_Msk    ( 0x03UL << ERU_EXISEL_EXS0A_Pos )                                /*!< ERU EXISEL: EXS0A Mask                  */
    #define ERU_EXISEL_EXS0B_Pos    2                                                                 /*!< ERU EXISEL: EXS0B Position              */
    #define ERU_EXISEL_EXS0B_Msk    ( 0x03UL << ERU_EXISEL_EXS0B_Pos )                                /*!< ERU EXISEL: EXS0B Mask                  */
    #define ERU_EXISEL_EXS1A_Pos    4                                                                 /*!< ERU EXISEL: EXS1A Position              */
    #define ERU_EXISEL_EXS1A_Msk    ( 0x03UL << ERU_EXISEL_EXS1A_Pos )                                /*!< ERU EXISEL: EXS1A Mask                  */
    #define ERU_EXISEL_EXS1B_Pos    6                                                                 /*!< ERU EXISEL: EXS1B Position              */
    #define ERU_EXISEL_EXS1B_Msk    ( 0x03UL << ERU_EXISEL_EXS1B_Pos )                                /*!< ERU EXISEL: EXS1B Mask                  */
    #define ERU_EXISEL_EXS2A_Pos    8                                                                 /*!< ERU EXISEL: EXS2A Position              */
    #define ERU_EXISEL_EXS2A_Msk    ( 0x03UL << ERU_EXISEL_EXS2A_Pos )                                /*!< ERU EXISEL: EXS2A Mask                  */
    #define ERU_EXISEL_EXS2B_Pos    10                                                                /*!< ERU EXISEL: EXS2B Position              */
    #define ERU_EXISEL_EXS2B_Msk    ( 0x03UL << ERU_EXISEL_EXS2B_Pos )                                /*!< ERU EXISEL: EXS2B Mask                  */
    #define ERU_EXISEL_EXS3A_Pos    12                                                                /*!< ERU EXISEL: EXS3A Position              */
    #define ERU_EXISEL_EXS3A_Msk    ( 0x03UL << ERU_EXISEL_EXS3A_Pos )                                /*!< ERU EXISEL: EXS3A Mask                  */
    #define ERU_EXISEL_EXS3B_Pos    14                                                                /*!< ERU EXISEL: EXS3B Position              */
    #define ERU_EXISEL_EXS3B_Msk    ( 0x03UL << ERU_EXISEL_EXS3B_Pos )                                /*!< ERU EXISEL: EXS3B Mask                  */

/* ---------------------------------  ERU_EXICON  --------------------------------- */
    #define ERU_EXICON_PE_Pos       0                                                                 /*!< ERU EXICON: PE Position                 */
    #define ERU_EXICON_PE_Msk       ( 0x01UL << ERU_EXICON_PE_Pos )                                   /*!< ERU EXICON: PE Mask                     */
    #define ERU_EXICON_LD_Pos       1                                                                 /*!< ERU EXICON: LD Position                 */
    #define ERU_EXICON_LD_Msk       ( 0x01UL << ERU_EXICON_LD_Pos )                                   /*!< ERU EXICON: LD Mask                     */
    #define ERU_EXICON_RE_Pos       2                                                                 /*!< ERU EXICON: RE Position                 */
    #define ERU_EXICON_RE_Msk       ( 0x01UL << ERU_EXICON_RE_Pos )                                   /*!< ERU EXICON: RE Mask                     */
    #define ERU_EXICON_FE_Pos       3                                                                 /*!< ERU EXICON: FE Position                 */
    #define ERU_EXICON_FE_Msk       ( 0x01UL << ERU_EXICON_FE_Pos )                                   /*!< ERU EXICON: FE Mask                     */
    #define ERU_EXICON_OCS_Pos      4                                                                 /*!< ERU EXICON: OCS Position                */
    #define ERU_EXICON_OCS_Msk      ( 0x07UL << ERU_EXICON_OCS_Pos )                                  /*!< ERU EXICON: OCS Mask                    */
    #define ERU_EXICON_FL_Pos       7                                                                 /*!< ERU EXICON: FL Position                 */
    #define ERU_EXICON_FL_Msk       ( 0x01UL << ERU_EXICON_FL_Pos )                                   /*!< ERU EXICON: FL Mask                     */
    #define ERU_EXICON_SS_Pos       8                                                                 /*!< ERU EXICON: SS Position                 */
    #define ERU_EXICON_SS_Msk       ( 0x03UL << ERU_EXICON_SS_Pos )                                   /*!< ERU EXICON: SS Mask                     */
    #define ERU_EXICON_NA_Pos       10                                                                /*!< ERU EXICON: NA Position                 */
    #define ERU_EXICON_NA_Msk       ( 0x01UL << ERU_EXICON_NA_Pos )                                   /*!< ERU EXICON: NA Mask                     */
    #define ERU_EXICON_NB_Pos       11                                                                /*!< ERU EXICON: NB Position                 */
    #define ERU_EXICON_NB_Msk       ( 0x01UL << ERU_EXICON_NB_Pos )                                   /*!< ERU EXICON: NB Mask                     */

/* ---------------------------------  ERU_EXOCON  --------------------------------- */
    #define ERU_EXOCON_ISS_Pos      0                                                                 /*!< ERU EXOCON: ISS Position                */
    #define ERU_EXOCON_ISS_Msk      ( 0x03UL << ERU_EXOCON_ISS_Pos )                                  /*!< ERU EXOCON: ISS Mask                    */
    #define ERU_EXOCON_GEEN_Pos     2                                                                 /*!< ERU EXOCON: GEEN Position               */
    #define ERU_EXOCON_GEEN_Msk     ( 0x01UL << ERU_EXOCON_GEEN_Pos )                                 /*!< ERU EXOCON: GEEN Mask                   */
    #define ERU_EXOCON_PDR_Pos      3                                                                 /*!< ERU EXOCON: PDR Position                */
    #define ERU_EXOCON_PDR_Msk      ( 0x01UL << ERU_EXOCON_PDR_Pos )                                  /*!< ERU EXOCON: PDR Mask                    */
    #define ERU_EXOCON_GP_Pos       4                                                                 /*!< ERU EXOCON: GP Position                 */
    #define ERU_EXOCON_GP_Msk       ( 0x03UL << ERU_EXOCON_GP_Pos )                                   /*!< ERU EXOCON: GP Mask                     */
    #define ERU_EXOCON_IPEN0_Pos    12                                                                /*!< ERU EXOCON: IPEN0 Position              */
    #define ERU_EXOCON_IPEN0_Msk    ( 0x01UL << ERU_EXOCON_IPEN0_Pos )                                /*!< ERU EXOCON: IPEN0 Mask                  */
    #define ERU_EXOCON_IPEN1_Pos    13                                                                /*!< ERU EXOCON: IPEN1 Position              */
    #define ERU_EXOCON_IPEN1_Msk    ( 0x01UL << ERU_EXOCON_IPEN1_Pos )                                /*!< ERU EXOCON: IPEN1 Mask                  */
    #define ERU_EXOCON_IPEN2_Pos    14                                                                /*!< ERU EXOCON: IPEN2 Position              */
    #define ERU_EXOCON_IPEN2_Msk    ( 0x01UL << ERU_EXOCON_IPEN2_Pos )                                /*!< ERU EXOCON: IPEN2 Mask                  */
    #define ERU_EXOCON_IPEN3_Pos    15                                                                /*!< ERU EXOCON: IPEN3 Position              */
    #define ERU_EXOCON_IPEN3_Msk    ( 0x01UL << ERU_EXOCON_IPEN3_Pos )                                /*!< ERU EXOCON: IPEN3 Mask                  */


/* ================================================================================ */
/* ================          struct 'PAU' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  PAU_AVAIL0  --------------------------------- */
    #define PAU_AVAIL0_AVAIL22_Pos     22                                                             /*!< PAU AVAIL0: AVAIL22 Position            */
    #define PAU_AVAIL0_AVAIL22_Msk     ( 0x01UL << PAU_AVAIL0_AVAIL22_Pos )                           /*!< PAU AVAIL0: AVAIL22 Mask                */
    #define PAU_AVAIL0_AVAIL23_Pos     23                                                             /*!< PAU AVAIL0: AVAIL23 Position            */
    #define PAU_AVAIL0_AVAIL23_Msk     ( 0x01UL << PAU_AVAIL0_AVAIL23_Pos )                           /*!< PAU AVAIL0: AVAIL23 Mask                */
    #define PAU_AVAIL0_AVAIL24_Pos     24                                                             /*!< PAU AVAIL0: AVAIL24 Position            */
    #define PAU_AVAIL0_AVAIL24_Msk     ( 0x01UL << PAU_AVAIL0_AVAIL24_Pos )                           /*!< PAU AVAIL0: AVAIL24 Mask                */

