FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  PAU_AVAIL1  --------------------------------- */
    #define PAU_AVAIL1_AVAIL0_Pos      0                                                              /*!< PAU AVAIL1: AVAIL0 Position             */
    #define PAU_AVAIL1_AVAIL0_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL0_Pos )                            /*!< PAU AVAIL1: AVAIL0 Mask                 */
    #define PAU_AVAIL1_AVAIL1_Pos      1                                                              /*!< PAU AVAIL1: AVAIL1 Position             */
    #define PAU_AVAIL1_AVAIL1_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL1_Pos )                            /*!< PAU AVAIL1: AVAIL1 Mask                 */
    #define PAU_AVAIL1_AVAIL4_Pos      4                                                              /*!< PAU AVAIL1: AVAIL4 Position             */
    #define PAU_AVAIL1_AVAIL4_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL4_Pos )                            /*!< PAU AVAIL1: AVAIL4 Mask                 */
    #define PAU_AVAIL1_AVAIL5_Pos      5                                                              /*!< PAU AVAIL1: AVAIL5 Position             */
    #define PAU_AVAIL1_AVAIL5_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL5_Pos )                            /*!< PAU AVAIL1: AVAIL5 Mask                 */
    #define PAU_AVAIL1_AVAIL6_Pos      6                                                              /*!< PAU AVAIL1: AVAIL6 Position             */
    #define PAU_AVAIL1_AVAIL6_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL6_Pos )                            /*!< PAU AVAIL1: AVAIL6 Mask                 */
    #define PAU_AVAIL1_AVAIL7_Pos      7                                                              /*!< PAU AVAIL1: AVAIL7 Position             */
    #define PAU_AVAIL1_AVAIL7_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL7_Pos )                            /*!< PAU AVAIL1: AVAIL7 Mask                 */
    #define PAU_AVAIL1_AVAIL8_Pos      8                                                              /*!< PAU AVAIL1: AVAIL8 Position             */
    #define PAU_AVAIL1_AVAIL8_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL8_Pos )                            /*!< PAU AVAIL1: AVAIL8 Mask                 */
    #define PAU_AVAIL1_AVAIL9_Pos      9                                                              /*!< PAU AVAIL1: AVAIL9 Position             */
    #define PAU_AVAIL1_AVAIL9_Msk      ( 0x01UL << PAU_AVAIL1_AVAIL9_Pos )                            /*!< PAU AVAIL1: AVAIL9 Mask                 */
    #define PAU_AVAIL1_AVAIL10_Pos     10                                                             /*!< PAU AVAIL1: AVAIL10 Position            */
    #define PAU_AVAIL1_AVAIL10_Msk     ( 0x01UL << PAU_AVAIL1_AVAIL10_Pos )                           /*!< PAU AVAIL1: AVAIL10 Mask                */
    #define PAU_AVAIL1_AVAIL11_Pos     11                                                             /*!< PAU AVAIL1: AVAIL11 Position            */
    #define PAU_AVAIL1_AVAIL11_Msk     ( 0x01UL << PAU_AVAIL1_AVAIL11_Pos )                           /*!< PAU AVAIL1: AVAIL11 Mask                */
    #define PAU_AVAIL1_AVAIL12_Pos     12                                                             /*!< PAU AVAIL1: AVAIL12 Position            */
    #define PAU_AVAIL1_AVAIL12_Msk     ( 0x01UL << PAU_AVAIL1_AVAIL12_Pos )                           /*!< PAU AVAIL1: AVAIL12 Mask                */

/* ---------------------------------  PAU_AVAIL2  --------------------------------- */
    #define PAU_AVAIL2_AVAIL13_Pos     13                                                             /*!< PAU AVAIL2: AVAIL13 Position            */
    #define PAU_AVAIL2_AVAIL13_Msk     ( 0x01UL << PAU_AVAIL2_AVAIL13_Pos )                           /*!< PAU AVAIL2: AVAIL13 Mask                */
    #define PAU_AVAIL2_AVAIL14_Pos     14                                                             /*!< PAU AVAIL2: AVAIL14 Position            */
    #define PAU_AVAIL2_AVAIL14_Msk     ( 0x01UL << PAU_AVAIL2_AVAIL14_Pos )                           /*!< PAU AVAIL2: AVAIL14 Mask                */
    #define PAU_AVAIL2_AVAIL15_Pos     15                                                             /*!< PAU AVAIL2: AVAIL15 Position            */
    #define PAU_AVAIL2_AVAIL15_Msk     ( 0x01UL << PAU_AVAIL2_AVAIL15_Pos )                           /*!< PAU AVAIL2: AVAIL15 Mask                */

/* --------------------------------  PAU_PRIVDIS0  -------------------------------- */
    #define PAU_PRIVDIS0_PDIS2_Pos     2                                                              /*!< PAU PRIVDIS0: PDIS2 Position            */
    #define PAU_PRIVDIS0_PDIS2_Msk     ( 0x01UL << PAU_PRIVDIS0_PDIS2_Pos )                           /*!< PAU PRIVDIS0: PDIS2 Mask                */
    #define PAU_PRIVDIS0_PDIS5_Pos     5                                                              /*!< PAU PRIVDIS0: PDIS5 Position            */
    #define PAU_PRIVDIS0_PDIS5_Msk     ( 0x01UL << PAU_PRIVDIS0_PDIS5_Pos )                           /*!< PAU PRIVDIS0: PDIS5 Mask                */
    #define PAU_PRIVDIS0_PDIS6_Pos     6                                                              /*!< PAU PRIVDIS0: PDIS6 Position            */
    #define PAU_PRIVDIS0_PDIS6_Msk     ( 0x01UL << PAU_PRIVDIS0_PDIS6_Pos )                           /*!< PAU PRIVDIS0: PDIS6 Mask                */
    #define PAU_PRIVDIS0_PDIS7_Pos     7                                                              /*!< PAU PRIVDIS0: PDIS7 Position            */
    #define PAU_PRIVDIS0_PDIS7_Msk     ( 0x01UL << PAU_PRIVDIS0_PDIS7_Pos )                           /*!< PAU PRIVDIS0: PDIS7 Mask                */
    #define PAU_PRIVDIS0_PDIS19_Pos    19                                                             /*!< PAU PRIVDIS0: PDIS19 Position           */
    #define PAU_PRIVDIS0_PDIS19_Msk    ( 0x01UL << PAU_PRIVDIS0_PDIS19_Pos )                          /*!< PAU PRIVDIS0: PDIS19 Mask               */
    #define PAU_PRIVDIS0_PDIS22_Pos    22                                                             /*!< PAU PRIVDIS0: PDIS22 Position           */
    #define PAU_PRIVDIS0_PDIS22_Msk    ( 0x01UL << PAU_PRIVDIS0_PDIS22_Pos )                          /*!< PAU PRIVDIS0: PDIS22 Mask               */
    #define PAU_PRIVDIS0_PDIS23_Pos    23                                                             /*!< PAU PRIVDIS0: PDIS23 Position           */
    #define PAU_PRIVDIS0_PDIS23_Msk    ( 0x01UL << PAU_PRIVDIS0_PDIS23_Pos )                          /*!< PAU PRIVDIS0: PDIS23 Mask               */
    #define PAU_PRIVDIS0_PDIS24_Pos    24                                                             /*!< PAU PRIVDIS0: PDIS24 Position           */
    #define PAU_PRIVDIS0_PDIS24_Msk    ( 0x01UL << PAU_PRIVDIS0_PDIS24_Pos )                          /*!< PAU PRIVDIS0: PDIS24 Mask               */

/* --------------------------------  PAU_PRIVDIS1  -------------------------------- */
    #define PAU_PRIVDIS1_PDIS0_Pos     0                                                              /*!< PAU PRIVDIS1: PDIS0 Position            */
    #define PAU_PRIVDIS1_PDIS0_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS0_Pos )                           /*!< PAU PRIVDIS1: PDIS0 Mask                */
    #define PAU_PRIVDIS1_PDIS1_Pos     1                                                              /*!< PAU PRIVDIS1: PDIS1 Position            */
    #define PAU_PRIVDIS1_PDIS1_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS1_Pos )                           /*!< PAU PRIVDIS1: PDIS1 Mask                */
    #define PAU_PRIVDIS1_PDIS5_Pos     5                                                              /*!< PAU PRIVDIS1: PDIS5 Position            */
    #define PAU_PRIVDIS1_PDIS5_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS5_Pos )                           /*!< PAU PRIVDIS1: PDIS5 Mask                */
    #define PAU_PRIVDIS1_PDIS6_Pos     6                                                              /*!< PAU PRIVDIS1: PDIS6 Position            */
    #define PAU_PRIVDIS1_PDIS6_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS6_Pos )                           /*!< PAU PRIVDIS1: PDIS6 Mask                */
    #define PAU_PRIVDIS1_PDIS7_Pos     7                                                              /*!< PAU PRIVDIS1: PDIS7 Position            */
    #define PAU_PRIVDIS1_PDIS7_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS7_Pos )                           /*!< PAU PRIVDIS1: PDIS7 Mask                */
    #define PAU_PRIVDIS1_PDIS8_Pos     8                                                              /*!< PAU PRIVDIS1: PDIS8 Position            */
    #define PAU_PRIVDIS1_PDIS8_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS8_Pos )                           /*!< PAU PRIVDIS1: PDIS8 Mask                */
    #define PAU_PRIVDIS1_PDIS9_Pos     9                                                              /*!< PAU PRIVDIS1: PDIS9 Position            */
    #define PAU_PRIVDIS1_PDIS9_Msk     ( 0x01UL << PAU_PRIVDIS1_PDIS9_Pos )                           /*!< PAU PRIVDIS1: PDIS9 Mask                */
    #define PAU_PRIVDIS1_PDIS10_Pos    10                                                             /*!< PAU PRIVDIS1: PDIS10 Position           */
    #define PAU_PRIVDIS1_PDIS10_Msk    ( 0x01UL << PAU_PRIVDIS1_PDIS10_Pos )                          /*!< PAU PRIVDIS1: PDIS10 Mask               */
    #define PAU_PRIVDIS1_PDIS11_Pos    11                                                             /*!< PAU PRIVDIS1: PDIS11 Position           */
    #define PAU_PRIVDIS1_PDIS11_Msk    ( 0x01UL << PAU_PRIVDIS1_PDIS11_Pos )                          /*!< PAU PRIVDIS1: PDIS11 Mask               */
    #define PAU_PRIVDIS1_PDIS12_Pos    12                                                             /*!< PAU PRIVDIS1: PDIS12 Position           */
    #define PAU_PRIVDIS1_PDIS12_Msk    ( 0x01UL << PAU_PRIVDIS1_PDIS12_Pos )                          /*!< PAU PRIVDIS1: PDIS12 Mask               */

/* --------------------------------  PAU_PRIVDIS2  -------------------------------- */
    #define PAU_PRIVDIS2_PDIS13_Pos    13                                                             /*!< PAU PRIVDIS2: PDIS13 Position           */
    #define PAU_PRIVDIS2_PDIS13_Msk    ( 0x01UL << PAU_PRIVDIS2_PDIS13_Pos )                          /*!< PAU PRIVDIS2: PDIS13 Mask               */
    #define PAU_PRIVDIS2_PDIS14_Pos    14                                                             /*!< PAU PRIVDIS2: PDIS14 Position           */
    #define PAU_PRIVDIS2_PDIS14_Msk    ( 0x01UL << PAU_PRIVDIS2_PDIS14_Pos )                          /*!< PAU PRIVDIS2: PDIS14 Mask               */
    #define PAU_PRIVDIS2_PDIS15_Pos    15                                                             /*!< PAU PRIVDIS2: PDIS15 Position           */
    #define PAU_PRIVDIS2_PDIS15_Msk    ( 0x01UL << PAU_PRIVDIS2_PDIS15_Pos )                          /*!< PAU PRIVDIS2: PDIS15 Mask               */

/* ---------------------------------  PAU_ROMSIZE  -------------------------------- */
    #define PAU_ROMSIZE_ADDR_Pos       8                                                              /*!< PAU ROMSIZE: ADDR Position              */
    #define PAU_ROMSIZE_ADDR_Msk       ( 0x3fUL << PAU_ROMSIZE_ADDR_Pos )                             /*!< PAU ROMSIZE: ADDR Mask                  */

/* ---------------------------------  PAU_FLSIZE  --------------------------------- */
    #define PAU_FLSIZE_ADDR_Pos        12                                                             /*!< PAU FLSIZE: ADDR Position               */
    #define PAU_FLSIZE_ADDR_Msk        ( 0x3fUL << PAU_FLSIZE_ADDR_Pos )                              /*!< PAU FLSIZE: ADDR Mask                   */

/* --------------------------------  PAU_RAM0SIZE  -------------------------------- */
    #define PAU_RAM0SIZE_ADDR_Pos      8                                                              /*!< PAU RAM0SIZE: ADDR Position             */
    #define PAU_RAM0SIZE_ADDR_Msk      ( 0x1fUL << PAU_RAM0SIZE_ADDR_Pos )                            /*!< PAU RAM0SIZE: ADDR Mask                 */


/* ================================================================================ */
/* ================          struct 'NVM' Position & Mask          ================ */
/* ================================================================================ */


