FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* -----------------------------------  WDT_TIM  ---------------------------------- */
    #define WDT_TIM_TIM_Pos          0                                                                /*!< WDT TIM: TIM Position                   */
    #define WDT_TIM_TIM_Msk          ( 0xffffffffUL << WDT_TIM_TIM_Pos )                              /*!< WDT TIM: TIM Mask                       */

/* -----------------------------------  WDT_WLB  ---------------------------------- */
    #define WDT_WLB_WLB_Pos          0                                                                /*!< WDT WLB: WLB Position                   */
    #define WDT_WLB_WLB_Msk          ( 0xffffffffUL << WDT_WLB_WLB_Pos )                              /*!< WDT WLB: WLB Mask                       */

/* -----------------------------------  WDT_WUB  ---------------------------------- */
    #define WDT_WUB_WUB_Pos          0                                                                /*!< WDT WUB: WUB Position                   */
    #define WDT_WUB_WUB_Msk          ( 0xffffffffUL << WDT_WUB_WUB_Pos )                              /*!< WDT WUB: WUB Mask                       */

/* ---------------------------------  WDT_WDTSTS  --------------------------------- */
    #define WDT_WDTSTS_ALMS_Pos      0                                                                /*!< WDT WDTSTS: ALMS Position               */
    #define WDT_WDTSTS_ALMS_Msk      ( 0x01UL << WDT_WDTSTS_ALMS_Pos )                                /*!< WDT WDTSTS: ALMS Mask                   */

/* ---------------------------------  WDT_WDTCLR  --------------------------------- */
    #define WDT_WDTCLR_ALMC_Pos      0                                                                /*!< WDT WDTCLR: ALMC Position               */
    #define WDT_WDTCLR_ALMC_Msk      ( 0x01UL << WDT_WDTCLR_ALMC_Pos )                                /*!< WDT WDTCLR: ALMC Mask                   */


/* ================================================================================ */
/* ================          struct 'RTC' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  RTC_ID  ----------------------------------- */
    #define RTC_ID_MOD_REV_Pos       0                                                                /*!< RTC ID: MOD_REV Position                */
    #define RTC_ID_MOD_REV_Msk       ( 0x000000ffUL << RTC_ID_MOD_REV_Pos )                           /*!< RTC ID: MOD_REV Mask                    */
    #define RTC_ID_MOD_TYPE_Pos      8                                                                /*!< RTC ID: MOD_TYPE Position               */
    #define RTC_ID_MOD_TYPE_Msk      ( 0x000000ffUL << RTC_ID_MOD_TYPE_Pos )                          /*!< RTC ID: MOD_TYPE Mask                   */
    #define RTC_ID_MOD_NUMBER_Pos    16                                                               /*!< RTC ID: MOD_NUMBER Position             */
    #define RTC_ID_MOD_NUMBER_Msk    ( 0x0000ffffUL << RTC_ID_MOD_NUMBER_Pos )                        /*!< RTC ID: MOD_NUMBER Mask                 */

/* -----------------------------------  RTC_CTR  ---------------------------------- */
    #define RTC_CTR_ENB_Pos          0                                                                /*!< RTC CTR: ENB Position                   */
    #define RTC_CTR_ENB_Msk          ( 0x01UL << RTC_CTR_ENB_Pos )                                    /*!< RTC CTR: ENB Mask                       */
    #define RTC_CTR_SUS_Pos          1                                                                /*!< RTC CTR: SUS Position                   */
    #define RTC_CTR_SUS_Msk          ( 0x01UL << RTC_CTR_SUS_Pos )                                    /*!< RTC CTR: SUS Mask                       */
    #define RTC_CTR_DIV_Pos          16                                                               /*!< RTC CTR: DIV Position                   */
    #define RTC_CTR_DIV_Msk          ( 0x0000ffffUL << RTC_CTR_DIV_Pos )                              /*!< RTC CTR: DIV Mask                       */

/* ---------------------------------  RTC_RAWSTAT  -------------------------------- */
    #define RTC_RAWSTAT_RPSE_Pos     0                                                                /*!< RTC RAWSTAT: RPSE Position              */
    #define RTC_RAWSTAT_RPSE_Msk     ( 0x01UL << RTC_RAWSTAT_RPSE_Pos )                               /*!< RTC RAWSTAT: RPSE Mask                  */
    #define RTC_RAWSTAT_RPMI_Pos     1                                                                /*!< RTC RAWSTAT: RPMI Position              */
    #define RTC_RAWSTAT_RPMI_Msk     ( 0x01UL << RTC_RAWSTAT_RPMI_Pos )                               /*!< RTC RAWSTAT: RPMI Mask                  */
    #define RTC_RAWSTAT_RPHO_Pos     2                                                                /*!< RTC RAWSTAT: RPHO Position              */
    #define RTC_RAWSTAT_RPHO_Msk     ( 0x01UL << RTC_RAWSTAT_RPHO_Pos )                               /*!< RTC RAWSTAT: RPHO Mask                  */
    #define RTC_RAWSTAT_RPDA_Pos     3                                                                /*!< RTC RAWSTAT: RPDA Position              */
    #define RTC_RAWSTAT_RPDA_Msk     ( 0x01UL << RTC_RAWSTAT_RPDA_Pos )                               /*!< RTC RAWSTAT: RPDA Mask                  */
    #define RTC_RAWSTAT_RPMO_Pos     5                                                                /*!< RTC RAWSTAT: RPMO Position              */
    #define RTC_RAWSTAT_RPMO_Msk     ( 0x01UL << RTC_RAWSTAT_RPMO_Pos )                               /*!< RTC RAWSTAT: RPMO Mask                  */
    #define RTC_RAWSTAT_RPYE_Pos     6                                                                /*!< RTC RAWSTAT: RPYE Position              */
    #define RTC_RAWSTAT_RPYE_Msk     ( 0x01UL << RTC_RAWSTAT_RPYE_Pos )                               /*!< RTC RAWSTAT: RPYE Mask                  */
    #define RTC_RAWSTAT_RAI_Pos      8                                                                /*!< RTC RAWSTAT: RAI Position               */
    #define RTC_RAWSTAT_RAI_Msk      ( 0x01UL << RTC_RAWSTAT_RAI_Pos )                                /*!< RTC RAWSTAT: RAI Mask                   */

/* ----------------------------------  RTC_STSSR  --------------------------------- */
    #define RTC_STSSR_SPSE_Pos       0                                                                /*!< RTC STSSR: SPSE Position                */
    #define RTC_STSSR_SPSE_Msk       ( 0x01UL << RTC_STSSR_SPSE_Pos )                                 /*!< RTC STSSR: SPSE Mask                    */
    #define RTC_STSSR_SPMI_Pos       1                                                                /*!< RTC STSSR: SPMI Position                */
    #define RTC_STSSR_SPMI_Msk       ( 0x01UL << RTC_STSSR_SPMI_Pos )                                 /*!< RTC STSSR: SPMI Mask                    */
    #define RTC_STSSR_SPHO_Pos       2                                                                /*!< RTC STSSR: SPHO Position                */
    #define RTC_STSSR_SPHO_Msk       ( 0x01UL << RTC_STSSR_SPHO_Pos )                                 /*!< RTC STSSR: SPHO Mask                    */
    #define RTC_STSSR_SPDA_Pos       3                                                                /*!< RTC STSSR: SPDA Position                */
    #define RTC_STSSR_SPDA_Msk       ( 0x01UL << RTC_STSSR_SPDA_Pos )                                 /*!< RTC STSSR: SPDA Mask                    */
    #define RTC_STSSR_SPMO_Pos       5                                                                /*!< RTC STSSR: SPMO Position                */
    #define RTC_STSSR_SPMO_Msk       ( 0x01UL << RTC_STSSR_SPMO_Pos )                                 /*!< RTC STSSR: SPMO Mask                    */
    #define RTC_STSSR_SPYE_Pos       6                                                                /*!< RTC STSSR: SPYE Position                */
    #define RTC_STSSR_SPYE_Msk       ( 0x01UL << RTC_STSSR_SPYE_Pos )                                 /*!< RTC STSSR: SPYE Mask                    */
    #define RTC_STSSR_SAI_Pos        8                                                                /*!< RTC STSSR: SAI Position                 */
    #define RTC_STSSR_SAI_Msk        ( 0x01UL << RTC_STSSR_SAI_Pos )                                  /*!< RTC STSSR: SAI Mask                     */

/* ----------------------------------  RTC_MSKSR  --------------------------------- */
    #define RTC_MSKSR_MPSE_Pos       0                                                                /*!< RTC MSKSR: MPSE Position                */
    #define RTC_MSKSR_MPSE_Msk       ( 0x01UL << RTC_MSKSR_MPSE_Pos )                                 /*!< RTC MSKSR: MPSE Mask                    */
    #define RTC_MSKSR_MPMI_Pos       1                                                                /*!< RTC MSKSR: MPMI Position                */
    #define RTC_MSKSR_MPMI_Msk       ( 0x01UL << RTC_MSKSR_MPMI_Pos )                                 /*!< RTC MSKSR: MPMI Mask                    */
    #define RTC_MSKSR_MPHO_Pos       2                                                                /*!< RTC MSKSR: MPHO Position                */
    #define RTC_MSKSR_MPHO_Msk       ( 0x01UL << RTC_MSKSR_MPHO_Pos )                                 /*!< RTC MSKSR: MPHO Mask                    */
    #define RTC_MSKSR_MPDA_Pos       3                                                                /*!< RTC MSKSR: MPDA Position                */
    #define RTC_MSKSR_MPDA_Msk       ( 0x01UL << RTC_MSKSR_MPDA_Pos )                                 /*!< RTC MSKSR: MPDA Mask                    */
    #define RTC_MSKSR_MPMO_Pos       5                                                                /*!< RTC MSKSR: MPMO Position                */
    #define RTC_MSKSR_MPMO_Msk       ( 0x01UL << RTC_MSKSR_MPMO_Pos )                                 /*!< RTC MSKSR: MPMO Mask                    */
    #define RTC_MSKSR_MPYE_Pos       6                                                                /*!< RTC MSKSR: MPYE Position                */
    #define RTC_MSKSR_MPYE_Msk       ( 0x01UL << RTC_MSKSR_MPYE_Pos )                                 /*!< RTC MSKSR: MPYE Mask                    */
    #define RTC_MSKSR_MAI_Pos        8                                                                /*!< RTC MSKSR: MAI Position                 */
    #define RTC_MSKSR_MAI_Msk        ( 0x01UL << RTC_MSKSR_MAI_Pos )                                  /*!< RTC MSKSR: MAI Mask                     */

/* ----------------------------------  RTC_CLRSR  --------------------------------- */
    #define RTC_CLRSR_RPSE_Pos       0                                                                /*!< RTC CLRSR: RPSE Position                */
    #define RTC_CLRSR_RPSE_Msk       ( 0x01UL << RTC_CLRSR_RPSE_Pos )                                 /*!< RTC CLRSR: RPSE Mask                    */
    #define RTC_CLRSR_RPMI_Pos       1                                                                /*!< RTC CLRSR: RPMI Position                */
    #define RTC_CLRSR_RPMI_Msk       ( 0x01UL << RTC_CLRSR_RPMI_Pos )                                 /*!< RTC CLRSR: RPMI Mask                    */
    #define RTC_CLRSR_RPHO_Pos       2                                                                /*!< RTC CLRSR: RPHO Position                */
    #define RTC_CLRSR_RPHO_Msk       ( 0x01UL << RTC_CLRSR_RPHO_Pos )                                 /*!< RTC CLRSR: RPHO Mask                    */
    #define RTC_CLRSR_RPDA_Pos       3                                                                /*!< RTC CLRSR: RPDA Position                */
    #define RTC_CLRSR_RPDA_Msk       ( 0x01UL << RTC_CLRSR_RPDA_Pos )                                 /*!< RTC CLRSR: RPDA Mask                    */
    #define RTC_CLRSR_RPMO_Pos       5                                                                /*!< RTC CLRSR: RPMO Position                */
    #define RTC_CLRSR_RPMO_Msk       ( 0x01UL << RTC_CLRSR_RPMO_Pos )                                 /*!< RTC CLRSR: RPMO Mask                    */
    #define RTC_CLRSR_RPYE_Pos       6                                                                /*!< RTC CLRSR: RPYE Position                */
    #define RTC_CLRSR_RPYE_Msk       ( 0x01UL << RTC_CLRSR_RPYE_Pos )                                 /*!< RTC CLRSR: RPYE Mask                    */
    #define RTC_CLRSR_RAI_Pos        8                                                                /*!< RTC CLRSR: RAI Position                 */
    #define RTC_CLRSR_RAI_Msk        ( 0x01UL << RTC_CLRSR_RAI_Pos )                                  /*!< RTC CLRSR: RAI Mask                     */

/* ----------------------------------  RTC_ATIM0  --------------------------------- */
    #define RTC_ATIM0_ASE_Pos        0                                                                /*!< RTC ATIM0: ASE Position                 */
    #define RTC_ATIM0_ASE_Msk        ( 0x3fUL << RTC_ATIM0_ASE_Pos )                                  /*!< RTC ATIM0: ASE Mask                     */
    #define RTC_ATIM0_AMI_Pos        8                                                                /*!< RTC ATIM0: AMI Position                 */
    #define RTC_ATIM0_AMI_Msk        ( 0x3fUL << RTC_ATIM0_AMI_Pos )                                  /*!< RTC ATIM0: AMI Mask                     */
    #define RTC_ATIM0_AHO_Pos        16                                                               /*!< RTC ATIM0: AHO Position                 */
    #define RTC_ATIM0_AHO_Msk        ( 0x1fUL << RTC_ATIM0_AHO_Pos )                                  /*!< RTC ATIM0: AHO Mask                     */
    #define RTC_ATIM0_ADA_Pos        24                                                               /*!< RTC ATIM0: ADA Position                 */
    #define RTC_ATIM0_ADA_Msk        ( 0x1fUL << RTC_ATIM0_ADA_Pos )                                  /*!< RTC ATIM0: ADA Mask                     */

