FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  RTC_ATIM1  --------------------------------- */
    #define RTC_ATIM1_AMO_Pos        8                                                                /*!< RTC ATIM1: AMO Position                 */
    #define RTC_ATIM1_AMO_Msk        ( 0x0fUL << RTC_ATIM1_AMO_Pos )                                  /*!< RTC ATIM1: AMO Mask                     */
    #define RTC_ATIM1_AYE_Pos        16                                                               /*!< RTC ATIM1: AYE Position                 */
    #define RTC_ATIM1_AYE_Msk        ( 0x0000ffffUL << RTC_ATIM1_AYE_Pos )                            /*!< RTC ATIM1: AYE Mask                     */

/* ----------------------------------  RTC_TIM0  ---------------------------------- */
    #define RTC_TIM0_SE_Pos          0                                                                /*!< RTC TIM0: SE Position                   */
    #define RTC_TIM0_SE_Msk          ( 0x3fUL << RTC_TIM0_SE_Pos )                                    /*!< RTC TIM0: SE Mask                       */
    #define RTC_TIM0_MI_Pos          8                                                                /*!< RTC TIM0: MI Position                   */
    #define RTC_TIM0_MI_Msk          ( 0x3fUL << RTC_TIM0_MI_Pos )                                    /*!< RTC TIM0: MI Mask                       */
    #define RTC_TIM0_HO_Pos          16                                                               /*!< RTC TIM0: HO Position                   */
    #define RTC_TIM0_HO_Msk          ( 0x1fUL << RTC_TIM0_HO_Pos )                                    /*!< RTC TIM0: HO Mask                       */
    #define RTC_TIM0_DA_Pos          24                                                               /*!< RTC TIM0: DA Position                   */
    #define RTC_TIM0_DA_Msk          ( 0x1fUL << RTC_TIM0_DA_Pos )                                    /*!< RTC TIM0: DA Mask                       */

/* ----------------------------------  RTC_TIM1  ---------------------------------- */
    #define RTC_TIM1_DAWE_Pos        0                                                                /*!< RTC TIM1: DAWE Position                 */
    #define RTC_TIM1_DAWE_Msk        ( 0x07UL << RTC_TIM1_DAWE_Pos )                                  /*!< RTC TIM1: DAWE Mask                     */
    #define RTC_TIM1_MO_Pos          8                                                                /*!< RTC TIM1: MO Position                   */
    #define RTC_TIM1_MO_Msk          ( 0x0fUL << RTC_TIM1_MO_Pos )                                    /*!< RTC TIM1: MO Mask                       */
    #define RTC_TIM1_YE_Pos          16                                                               /*!< RTC TIM1: YE Position                   */
    #define RTC_TIM1_YE_Msk          ( 0x0000ffffUL << RTC_TIM1_YE_Pos )                              /*!< RTC TIM1: YE Mask                       */


/* ================================================================================ */
/* ================          struct 'PRNG' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  PRNG_WORD  --------------------------------- */
    #define PRNG_WORD_RDATA_Pos    0                                                                  /*!< PRNG WORD: RDATA Position               */
    #define PRNG_WORD_RDATA_Msk    ( 0x0000ffffUL << PRNG_WORD_RDATA_Pos )                            /*!< PRNG WORD: RDATA Mask                   */

/* ----------------------------------  PRNG_CHK  ---------------------------------- */
    #define PRNG_CHK_RDV_Pos       0                                                                  /*!< PRNG CHK: RDV Position                  */
    #define PRNG_CHK_RDV_Msk       ( 0x01UL << PRNG_CHK_RDV_Pos )                                     /*!< PRNG CHK: RDV Mask                      */

/* ----------------------------------  PRNG_CTRL  --------------------------------- */
    #define PRNG_CTRL_RDBS_Pos     1                                                                  /*!< PRNG CTRL: RDBS Position                */
    #define PRNG_CTRL_RDBS_Msk     ( 0x03UL << PRNG_CTRL_RDBS_Pos )                                   /*!< PRNG CTRL: RDBS Mask                    */
    #define PRNG_CTRL_KLD_Pos      3                                                                  /*!< PRNG CTRL: KLD Position                 */
    #define PRNG_CTRL_KLD_Msk      ( 0x01UL << PRNG_CTRL_KLD_Pos )                                    /*!< PRNG CTRL: KLD Mask                     */


/* ================================================================================ */
/* ================          Group 'LEDTS' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  LEDTS_ID  ---------------------------------- */
    #define LEDTS_ID_MOD_REV_Pos              0                                                       /*!< LEDTS ID: MOD_REV Position              */
    #define LEDTS_ID_MOD_REV_Msk              ( 0x000000ffUL << LEDTS_ID_MOD_REV_Pos )                /*!< LEDTS ID: MOD_REV Mask                  */
    #define LEDTS_ID_MOD_TYPE_Pos             8                                                       /*!< LEDTS ID: MOD_TYPE Position             */
    #define LEDTS_ID_MOD_TYPE_Msk             ( 0x000000ffUL << LEDTS_ID_MOD_TYPE_Pos )               /*!< LEDTS ID: MOD_TYPE Mask                 */
    #define LEDTS_ID_MOD_NUMBER_Pos           16                                                      /*!< LEDTS ID: MOD_NUMBER Position           */
    #define LEDTS_ID_MOD_NUMBER_Msk           ( 0x0000ffffUL << LEDTS_ID_MOD_NUMBER_Pos )             /*!< LEDTS ID: MOD_NUMBER Mask               */

