FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  LEDTS_GLOBCTL  ------------------------------- */
    #define LEDTS_GLOBCTL_TS_EN_Pos           0                                                       /*!< LEDTS GLOBCTL: TS_EN Position           */
    #define LEDTS_GLOBCTL_TS_EN_Msk           ( 0x01UL << LEDTS_GLOBCTL_TS_EN_Pos )                   /*!< LEDTS GLOBCTL: TS_EN Mask               */
    #define LEDTS_GLOBCTL_LD_EN_Pos           1                                                       /*!< LEDTS GLOBCTL: LD_EN Position           */
    #define LEDTS_GLOBCTL_LD_EN_Msk           ( 0x01UL << LEDTS_GLOBCTL_LD_EN_Pos )                   /*!< LEDTS GLOBCTL: LD_EN Mask               */
    #define LEDTS_GLOBCTL_CMTR_Pos            2                                                       /*!< LEDTS GLOBCTL: CMTR Position            */
    #define LEDTS_GLOBCTL_CMTR_Msk            ( 0x01UL << LEDTS_GLOBCTL_CMTR_Pos )                    /*!< LEDTS GLOBCTL: CMTR Mask                */
    #define LEDTS_GLOBCTL_ENSYNC_Pos          3                                                       /*!< LEDTS GLOBCTL: ENSYNC Position          */
    #define LEDTS_GLOBCTL_ENSYNC_Msk          ( 0x01UL << LEDTS_GLOBCTL_ENSYNC_Pos )                  /*!< LEDTS GLOBCTL: ENSYNC Mask              */
    #define LEDTS_GLOBCTL_SUSCFG_Pos          8                                                       /*!< LEDTS GLOBCTL: SUSCFG Position          */
    #define LEDTS_GLOBCTL_SUSCFG_Msk          ( 0x01UL << LEDTS_GLOBCTL_SUSCFG_Pos )                  /*!< LEDTS GLOBCTL: SUSCFG Mask              */
    #define LEDTS_GLOBCTL_MASKVAL_Pos         9                                                       /*!< LEDTS GLOBCTL: MASKVAL Position         */
    #define LEDTS_GLOBCTL_MASKVAL_Msk         ( 0x07UL << LEDTS_GLOBCTL_MASKVAL_Pos )                 /*!< LEDTS GLOBCTL: MASKVAL Mask             */
    #define LEDTS_GLOBCTL_FENVAL_Pos          12                                                      /*!< LEDTS GLOBCTL: FENVAL Position          */
    #define LEDTS_GLOBCTL_FENVAL_Msk          ( 0x01UL << LEDTS_GLOBCTL_FENVAL_Pos )                  /*!< LEDTS GLOBCTL: FENVAL Mask              */
    #define LEDTS_GLOBCTL_ITS_EN_Pos          13                                                      /*!< LEDTS GLOBCTL: ITS_EN Position          */
    #define LEDTS_GLOBCTL_ITS_EN_Msk          ( 0x01UL << LEDTS_GLOBCTL_ITS_EN_Pos )                  /*!< LEDTS GLOBCTL: ITS_EN Mask              */
    #define LEDTS_GLOBCTL_ITF_EN_Pos          14                                                      /*!< LEDTS GLOBCTL: ITF_EN Position          */
    #define LEDTS_GLOBCTL_ITF_EN_Msk          ( 0x01UL << LEDTS_GLOBCTL_ITF_EN_Pos )                  /*!< LEDTS GLOBCTL: ITF_EN Mask              */
    #define LEDTS_GLOBCTL_ITP_EN_Pos          15                                                      /*!< LEDTS GLOBCTL: ITP_EN Position          */
    #define LEDTS_GLOBCTL_ITP_EN_Msk          ( 0x01UL << LEDTS_GLOBCTL_ITP_EN_Pos )                  /*!< LEDTS GLOBCTL: ITP_EN Mask              */
    #define LEDTS_GLOBCTL_CLK_PS_Pos          16                                                      /*!< LEDTS GLOBCTL: CLK_PS Position          */
    #define LEDTS_GLOBCTL_CLK_PS_Msk          ( 0x0000ffffUL << LEDTS_GLOBCTL_CLK_PS_Pos )            /*!< LEDTS GLOBCTL: CLK_PS Mask              */

/* ---------------------------------  LEDTS_FNCTL  -------------------------------- */
    #define LEDTS_FNCTL_PADT_Pos              0                                                       /*!< LEDTS FNCTL: PADT Position              */
    #define LEDTS_FNCTL_PADT_Msk              ( 0x07UL << LEDTS_FNCTL_PADT_Pos )                      /*!< LEDTS FNCTL: PADT Mask                  */
    #define LEDTS_FNCTL_PADTSW_Pos            3                                                       /*!< LEDTS FNCTL: PADTSW Position            */
    #define LEDTS_FNCTL_PADTSW_Msk            ( 0x01UL << LEDTS_FNCTL_PADTSW_Pos )                    /*!< LEDTS FNCTL: PADTSW Mask                */
    #define LEDTS_FNCTL_EPULL_Pos             4                                                       /*!< LEDTS FNCTL: EPULL Position             */
    #define LEDTS_FNCTL_EPULL_Msk             ( 0x01UL << LEDTS_FNCTL_EPULL_Pos )                     /*!< LEDTS FNCTL: EPULL Mask                 */
    #define LEDTS_FNCTL_FNCOL_Pos             5                                                       /*!< LEDTS FNCTL: FNCOL Position             */
    #define LEDTS_FNCTL_FNCOL_Msk             ( 0x07UL << LEDTS_FNCTL_FNCOL_Pos )                     /*!< LEDTS FNCTL: FNCOL Mask                 */
    #define LEDTS_FNCTL_ACCCNT_Pos            16                                                      /*!< LEDTS FNCTL: ACCCNT Position            */
    #define LEDTS_FNCTL_ACCCNT_Msk            ( 0x0fUL << LEDTS_FNCTL_ACCCNT_Pos )                    /*!< LEDTS FNCTL: ACCCNT Mask                */
    #define LEDTS_FNCTL_TSCCMP_Pos            20                                                      /*!< LEDTS FNCTL: TSCCMP Position            */
    #define LEDTS_FNCTL_TSCCMP_Msk            ( 0x01UL << LEDTS_FNCTL_TSCCMP_Pos )                    /*!< LEDTS FNCTL: TSCCMP Mask                */
    #define LEDTS_FNCTL_TSOEXT_Pos            21                                                      /*!< LEDTS FNCTL: TSOEXT Position            */
    #define LEDTS_FNCTL_TSOEXT_Msk            ( 0x03UL << LEDTS_FNCTL_TSOEXT_Pos )                    /*!< LEDTS FNCTL: TSOEXT Mask                */
    #define LEDTS_FNCTL_TSCTRR_Pos            23                                                      /*!< LEDTS FNCTL: TSCTRR Position            */
    #define LEDTS_FNCTL_TSCTRR_Msk            ( 0x01UL << LEDTS_FNCTL_TSCTRR_Pos )                    /*!< LEDTS FNCTL: TSCTRR Mask                */
    #define LEDTS_FNCTL_TSCTRSAT_Pos          24                                                      /*!< LEDTS FNCTL: TSCTRSAT Position          */
    #define LEDTS_FNCTL_TSCTRSAT_Msk          ( 0x01UL << LEDTS_FNCTL_TSCTRSAT_Pos )                  /*!< LEDTS FNCTL: TSCTRSAT Mask              */
    #define LEDTS_FNCTL_NR_TSIN_Pos           25                                                      /*!< LEDTS FNCTL: NR_TSIN Position           */
    #define LEDTS_FNCTL_NR_TSIN_Msk           ( 0x07UL << LEDTS_FNCTL_NR_TSIN_Pos )                   /*!< LEDTS FNCTL: NR_TSIN Mask               */
    #define LEDTS_FNCTL_COLLEV_Pos            28                                                      /*!< LEDTS FNCTL: COLLEV Position            */
    #define LEDTS_FNCTL_COLLEV_Msk            ( 0x01UL << LEDTS_FNCTL_COLLEV_Pos )                    /*!< LEDTS FNCTL: COLLEV Mask                */
    #define LEDTS_FNCTL_NR_LEDCOL_Pos         29                                                      /*!< LEDTS FNCTL: NR_LEDCOL Position         */
    #define LEDTS_FNCTL_NR_LEDCOL_Msk         ( 0x07UL << LEDTS_FNCTL_NR_LEDCOL_Pos )                 /*!< LEDTS FNCTL: NR_LEDCOL Mask             */

