FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  LEDTS_EVFR  --------------------------------- */
    #define LEDTS_EVFR_TSF_Pos                0                                                       /*!< LEDTS EVFR: TSF Position                */
    #define LEDTS_EVFR_TSF_Msk                ( 0x01UL << LEDTS_EVFR_TSF_Pos )                        /*!< LEDTS EVFR: TSF Mask                    */
    #define LEDTS_EVFR_TFF_Pos                1                                                       /*!< LEDTS EVFR: TFF Position                */
    #define LEDTS_EVFR_TFF_Msk                ( 0x01UL << LEDTS_EVFR_TFF_Pos )                        /*!< LEDTS EVFR: TFF Mask                    */
    #define LEDTS_EVFR_TPF_Pos                2                                                       /*!< LEDTS EVFR: TPF Position                */
    #define LEDTS_EVFR_TPF_Msk                ( 0x01UL << LEDTS_EVFR_TPF_Pos )                        /*!< LEDTS EVFR: TPF Mask                    */
    #define LEDTS_EVFR_TSCTROVF_Pos           3                                                       /*!< LEDTS EVFR: TSCTROVF Position           */
    #define LEDTS_EVFR_TSCTROVF_Msk           ( 0x01UL << LEDTS_EVFR_TSCTROVF_Pos )                   /*!< LEDTS EVFR: TSCTROVF Mask               */
    #define LEDTS_EVFR_CTSF_Pos               16                                                      /*!< LEDTS EVFR: CTSF Position               */
    #define LEDTS_EVFR_CTSF_Msk               ( 0x01UL << LEDTS_EVFR_CTSF_Pos )                       /*!< LEDTS EVFR: CTSF Mask                   */
    #define LEDTS_EVFR_CTFF_Pos               17                                                      /*!< LEDTS EVFR: CTFF Position               */
    #define LEDTS_EVFR_CTFF_Msk               ( 0x01UL << LEDTS_EVFR_CTFF_Pos )                       /*!< LEDTS EVFR: CTFF Mask                   */
    #define LEDTS_EVFR_CTPF_Pos               18                                                      /*!< LEDTS EVFR: CTPF Position               */
    #define LEDTS_EVFR_CTPF_Msk               ( 0x01UL << LEDTS_EVFR_CTPF_Pos )                       /*!< LEDTS EVFR: CTPF Mask                   */

/* ---------------------------------  LEDTS_TSVAL  -------------------------------- */
    #define LEDTS_TSVAL_TSCTRVALR_Pos         0                                                       /*!< LEDTS TSVAL: TSCTRVALR Position         */
    #define LEDTS_TSVAL_TSCTRVALR_Msk         ( 0x0000ffffUL << LEDTS_TSVAL_TSCTRVALR_Pos )           /*!< LEDTS TSVAL: TSCTRVALR Mask             */
    #define LEDTS_TSVAL_TSCTRVAL_Pos          16                                                      /*!< LEDTS TSVAL: TSCTRVAL Position          */
    #define LEDTS_TSVAL_TSCTRVAL_Msk          ( 0x0000ffffUL << LEDTS_TSVAL_TSCTRVAL_Pos )            /*!< LEDTS TSVAL: TSCTRVAL Mask              */

/* ---------------------------------  LEDTS_LINE0  -------------------------------- */
    #define LEDTS_LINE0_LINE_0_Pos            0                                                       /*!< LEDTS LINE0: LINE_0 Position            */
    #define LEDTS_LINE0_LINE_0_Msk            ( 0x000000ffUL << LEDTS_LINE0_LINE_0_Pos )              /*!< LEDTS LINE0: LINE_0 Mask                */
    #define LEDTS_LINE0_LINE_1_Pos            8                                                       /*!< LEDTS LINE0: LINE_1 Position            */
    #define LEDTS_LINE0_LINE_1_Msk            ( 0x000000ffUL << LEDTS_LINE0_LINE_1_Pos )              /*!< LEDTS LINE0: LINE_1 Mask                */
    #define LEDTS_LINE0_LINE_2_Pos            16                                                      /*!< LEDTS LINE0: LINE_2 Position            */
    #define LEDTS_LINE0_LINE_2_Msk            ( 0x000000ffUL << LEDTS_LINE0_LINE_2_Pos )              /*!< LEDTS LINE0: LINE_2 Mask                */
    #define LEDTS_LINE0_LINE_3_Pos            24                                                      /*!< LEDTS LINE0: LINE_3 Position            */
    #define LEDTS_LINE0_LINE_3_Msk            ( 0x000000ffUL << LEDTS_LINE0_LINE_3_Pos )              /*!< LEDTS LINE0: LINE_3 Mask                */

/* ---------------------------------  LEDTS_LINE1  -------------------------------- */
    #define LEDTS_LINE1_LINE_4_Pos            0                                                       /*!< LEDTS LINE1: LINE_4 Position            */
    #define LEDTS_LINE1_LINE_4_Msk            ( 0x000000ffUL << LEDTS_LINE1_LINE_4_Pos )              /*!< LEDTS LINE1: LINE_4 Mask                */
    #define LEDTS_LINE1_LINE_5_Pos            8                                                       /*!< LEDTS LINE1: LINE_5 Position            */
    #define LEDTS_LINE1_LINE_5_Msk            ( 0x000000ffUL << LEDTS_LINE1_LINE_5_Pos )              /*!< LEDTS LINE1: LINE_5 Mask                */
    #define LEDTS_LINE1_LINE_6_Pos            16                                                      /*!< LEDTS LINE1: LINE_6 Position            */
    #define LEDTS_LINE1_LINE_6_Msk            ( 0x000000ffUL << LEDTS_LINE1_LINE_6_Pos )              /*!< LEDTS LINE1: LINE_6 Mask                */
    #define LEDTS_LINE1_LINE_A_Pos            24                                                      /*!< LEDTS LINE1: LINE_A Position            */
    #define LEDTS_LINE1_LINE_A_Msk            ( 0x000000ffUL << LEDTS_LINE1_LINE_A_Pos )              /*!< LEDTS LINE1: LINE_A Mask                */

/* --------------------------------  LEDTS_LDCMP0  -------------------------------- */
    #define LEDTS_LDCMP0_CMP_LD0_Pos          0                                                       /*!< LEDTS LDCMP0: CMP_LD0 Position          */
    #define LEDTS_LDCMP0_CMP_LD0_Msk          ( 0x000000ffUL << LEDTS_LDCMP0_CMP_LD0_Pos )            /*!< LEDTS LDCMP0: CMP_LD0 Mask              */
    #define LEDTS_LDCMP0_CMP_LD1_Pos          8                                                       /*!< LEDTS LDCMP0: CMP_LD1 Position          */
    #define LEDTS_LDCMP0_CMP_LD1_Msk          ( 0x000000ffUL << LEDTS_LDCMP0_CMP_LD1_Pos )            /*!< LEDTS LDCMP0: CMP_LD1 Mask              */
    #define LEDTS_LDCMP0_CMP_LD2_Pos          16                                                      /*!< LEDTS LDCMP0: CMP_LD2 Position          */
    #define LEDTS_LDCMP0_CMP_LD2_Msk          ( 0x000000ffUL << LEDTS_LDCMP0_CMP_LD2_Pos )            /*!< LEDTS LDCMP0: CMP_LD2 Mask              */
    #define LEDTS_LDCMP0_CMP_LD3_Pos          24                                                      /*!< LEDTS LDCMP0: CMP_LD3 Position          */
    #define LEDTS_LDCMP0_CMP_LD3_Msk          ( 0x000000ffUL << LEDTS_LDCMP0_CMP_LD3_Pos )            /*!< LEDTS LDCMP0: CMP_LD3 Mask              */

/* --------------------------------  LEDTS_LDCMP1  -------------------------------- */
    #define LEDTS_LDCMP1_CMP_LD4_Pos          0                                                       /*!< LEDTS LDCMP1: CMP_LD4 Position          */
    #define LEDTS_LDCMP1_CMP_LD4_Msk          ( 0x000000ffUL << LEDTS_LDCMP1_CMP_LD4_Pos )            /*!< LEDTS LDCMP1: CMP_LD4 Mask              */
    #define LEDTS_LDCMP1_CMP_LD5_Pos          8                                                       /*!< LEDTS LDCMP1: CMP_LD5 Position          */
    #define LEDTS_LDCMP1_CMP_LD5_Msk          ( 0x000000ffUL << LEDTS_LDCMP1_CMP_LD5_Pos )            /*!< LEDTS LDCMP1: CMP_LD5 Mask              */
    #define LEDTS_LDCMP1_CMP_LD6_Pos          16                                                      /*!< LEDTS LDCMP1: CMP_LD6 Position          */
    #define LEDTS_LDCMP1_CMP_LD6_Msk          ( 0x000000ffUL << LEDTS_LDCMP1_CMP_LD6_Pos )            /*!< LEDTS LDCMP1: CMP_LD6 Mask              */
    #define LEDTS_LDCMP1_CMP_LDA_TSCOM_Pos    24                                                      /*!< LEDTS LDCMP1: CMP_LDA_TSCOM Position    */
    #define LEDTS_LDCMP1_CMP_LDA_TSCOM_Msk    ( 0x000000ffUL << LEDTS_LDCMP1_CMP_LDA_TSCOM_Pos )      /*!< LEDTS LDCMP1: CMP_LDA_TSCOM Mask        */

/* --------------------------------  LEDTS_TSCMP0  -------------------------------- */
    #define LEDTS_TSCMP0_CMP_TS0_Pos          0                                                       /*!< LEDTS TSCMP0: CMP_TS0 Position          */
    #define LEDTS_TSCMP0_CMP_TS0_Msk          ( 0x000000ffUL << LEDTS_TSCMP0_CMP_TS0_Pos )            /*!< LEDTS TSCMP0: CMP_TS0 Mask              */
    #define LEDTS_TSCMP0_CMP_TS1_Pos          8                                                       /*!< LEDTS TSCMP0: CMP_TS1 Position          */
    #define LEDTS_TSCMP0_CMP_TS1_Msk          ( 0x000000ffUL << LEDTS_TSCMP0_CMP_TS1_Pos )            /*!< LEDTS TSCMP0: CMP_TS1 Mask              */
    #define LEDTS_TSCMP0_CMP_TS2_Pos          16                                                      /*!< LEDTS TSCMP0: CMP_TS2 Position          */
    #define LEDTS_TSCMP0_CMP_TS2_Msk          ( 0x000000ffUL << LEDTS_TSCMP0_CMP_TS2_Pos )            /*!< LEDTS TSCMP0: CMP_TS2 Mask              */
    #define LEDTS_TSCMP0_CMP_TS3_Pos          24                                                      /*!< LEDTS TSCMP0: CMP_TS3 Position          */
    #define LEDTS_TSCMP0_CMP_TS3_Msk          ( 0x000000ffUL << LEDTS_TSCMP0_CMP_TS3_Pos )            /*!< LEDTS TSCMP0: CMP_TS3 Mask              */

/* --------------------------------  LEDTS_TSCMP1  -------------------------------- */
    #define LEDTS_TSCMP1_CMP_TS4_Pos          0                                                       /*!< LEDTS TSCMP1: CMP_TS4 Position          */
    #define LEDTS_TSCMP1_CMP_TS4_Msk          ( 0x000000ffUL << LEDTS_TSCMP1_CMP_TS4_Pos )            /*!< LEDTS TSCMP1: CMP_TS4 Mask              */
    #define LEDTS_TSCMP1_CMP_TS5_Pos          8                                                       /*!< LEDTS TSCMP1: CMP_TS5 Position          */
    #define LEDTS_TSCMP1_CMP_TS5_Msk          ( 0x000000ffUL << LEDTS_TSCMP1_CMP_TS5_Pos )            /*!< LEDTS TSCMP1: CMP_TS5 Mask              */
    #define LEDTS_TSCMP1_CMP_TS6_Pos          16                                                      /*!< LEDTS TSCMP1: CMP_TS6 Position          */
    #define LEDTS_TSCMP1_CMP_TS6_Msk          ( 0x000000ffUL << LEDTS_TSCMP1_CMP_TS6_Pos )            /*!< LEDTS TSCMP1: CMP_TS6 Mask              */
    #define LEDTS_TSCMP1_CMP_TS7_Pos          24                                                      /*!< LEDTS TSCMP1: CMP_TS7 Position          */
    #define LEDTS_TSCMP1_CMP_TS7_Msk          ( 0x000000ffUL << LEDTS_TSCMP1_CMP_TS7_Pos )            /*!< LEDTS TSCMP1: CMP_TS7 Mask              */


/* ================================================================================ */
/* ================          Group 'USIC' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  USIC_ID  ---------------------------------- */
    #define USIC_ID_MOD_REV_Pos       0                                                               /*!< USIC ID: MOD_REV Position               */
    #define USIC_ID_MOD_REV_Msk       ( 0x000000ffUL << USIC_ID_MOD_REV_Pos )                         /*!< USIC ID: MOD_REV Mask                   */
    #define USIC_ID_MOD_TYPE_Pos      8                                                               /*!< USIC ID: MOD_TYPE Position              */
    #define USIC_ID_MOD_TYPE_Msk      ( 0x000000ffUL << USIC_ID_MOD_TYPE_Pos )                        /*!< USIC ID: MOD_TYPE Mask                  */
    #define USIC_ID_MOD_NUMBER_Pos    16                                                              /*!< USIC ID: MOD_NUMBER Position            */
    #define USIC_ID_MOD_NUMBER_Msk    ( 0x0000ffffUL << USIC_ID_MOD_NUMBER_Pos )                      /*!< USIC ID: MOD_NUMBER Mask                */


/* ================================================================================ */
/* ================         Group 'USIC_CH' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  USIC_CH_CCFG  -------------------------------- */
    #define USIC_CH_CCFG_SSC_Pos               0                                                      /*!< USIC_CH CCFG: SSC Position              */
    #define USIC_CH_CCFG_SSC_Msk               ( 0x01UL << USIC_CH_CCFG_SSC_Pos )                     /*!< USIC_CH CCFG: SSC Mask                  */
    #define USIC_CH_CCFG_ASC_Pos               1                                                      /*!< USIC_CH CCFG: ASC Position              */
    #define USIC_CH_CCFG_ASC_Msk               ( 0x01UL << USIC_CH_CCFG_ASC_Pos )                     /*!< USIC_CH CCFG: ASC Mask                  */
    #define USIC_CH_CCFG_IIC_Pos               2                                                      /*!< USIC_CH CCFG: IIC Position              */
    #define USIC_CH_CCFG_IIC_Msk               ( 0x01UL << USIC_CH_CCFG_IIC_Pos )                     /*!< USIC_CH CCFG: IIC Mask                  */
    #define USIC_CH_CCFG_IIS_Pos               3                                                      /*!< USIC_CH CCFG: IIS Position              */
    #define USIC_CH_CCFG_IIS_Msk               ( 0x01UL << USIC_CH_CCFG_IIS_Pos )                     /*!< USIC_CH CCFG: IIS Mask                  */
    #define USIC_CH_CCFG_RB_Pos                6                                                      /*!< USIC_CH CCFG: RB Position               */
    #define USIC_CH_CCFG_RB_Msk                ( 0x01UL << USIC_CH_CCFG_RB_Pos )                      /*!< USIC_CH CCFG: RB Mask                   */
    #define USIC_CH_CCFG_TB_Pos                7                                                      /*!< USIC_CH CCFG: TB Position               */
    #define USIC_CH_CCFG_TB_Msk                ( 0x01UL << USIC_CH_CCFG_TB_Pos )                      /*!< USIC_CH CCFG: TB Mask                   */

/* --------------------------------  USIC_CH_KSCFG  ------------------------------- */
    #define USIC_CH_KSCFG_MODEN_Pos            0                                                      /*!< USIC_CH KSCFG: MODEN Position           */
    #define USIC_CH_KSCFG_MODEN_Msk            ( 0x01UL << USIC_CH_KSCFG_MODEN_Pos )                  /*!< USIC_CH KSCFG: MODEN Mask               */
    #define USIC_CH_KSCFG_BPMODEN_Pos          1                                                      /*!< USIC_CH KSCFG: BPMODEN Position         */
    #define USIC_CH_KSCFG_BPMODEN_Msk          ( 0x01UL << USIC_CH_KSCFG_BPMODEN_Pos )                /*!< USIC_CH KSCFG: BPMODEN Mask             */
    #define USIC_CH_KSCFG_NOMCFG_Pos           4                                                      /*!< USIC_CH KSCFG: NOMCFG Position          */
    #define USIC_CH_KSCFG_NOMCFG_Msk           ( 0x03UL << USIC_CH_KSCFG_NOMCFG_Pos )                 /*!< USIC_CH KSCFG: NOMCFG Mask              */
    #define USIC_CH_KSCFG_BPNOM_Pos            7                                                      /*!< USIC_CH KSCFG: BPNOM Position           */
    #define USIC_CH_KSCFG_BPNOM_Msk            ( 0x01UL << USIC_CH_KSCFG_BPNOM_Pos )                  /*!< USIC_CH KSCFG: BPNOM Mask               */
    #define USIC_CH_KSCFG_SUMCFG_Pos           8                                                      /*!< USIC_CH KSCFG: SUMCFG Position          */
    #define USIC_CH_KSCFG_SUMCFG_Msk           ( 0x03UL << USIC_CH_KSCFG_SUMCFG_Pos )                 /*!< USIC_CH KSCFG: SUMCFG Mask              */
    #define USIC_CH_KSCFG_BPSUM_Pos            11                                                     /*!< USIC_CH KSCFG: BPSUM Position           */
    #define USIC_CH_KSCFG_BPSUM_Msk            ( 0x01UL << USIC_CH_KSCFG_BPSUM_Pos )                  /*!< USIC_CH KSCFG: BPSUM Mask               */

/* ---------------------------------  USIC_CH_FDR  -------------------------------- */
    #define USIC_CH_FDR_STEP_Pos               0                                                      /*!< USIC_CH FDR: STEP Position              */
    #define USIC_CH_FDR_STEP_Msk               ( 0x000003ffUL << USIC_CH_FDR_STEP_Pos )               /*!< USIC_CH FDR: STEP Mask                  */
    #define USIC_CH_FDR_DM_Pos                 14                                                     /*!< USIC_CH FDR: DM Position                */
    #define USIC_CH_FDR_DM_Msk                 ( 0x03UL << USIC_CH_FDR_DM_Pos )                       /*!< USIC_CH FDR: DM Mask                    */
    #define USIC_CH_FDR_RESULT_Pos             16                                                     /*!< USIC_CH FDR: RESULT Position            */
    #define USIC_CH_FDR_RESULT_Msk             ( 0x000003ffUL << USIC_CH_FDR_RESULT_Pos )             /*!< USIC_CH FDR: RESULT Mask                */

