FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  USIC_CH_BRG  -------------------------------- */
    #define USIC_CH_BRG_CLKSEL_Pos             0                                                      /*!< USIC_CH BRG: CLKSEL Position            */
    #define USIC_CH_BRG_CLKSEL_Msk             ( 0x03UL << USIC_CH_BRG_CLKSEL_Pos )                   /*!< USIC_CH BRG: CLKSEL Mask                */
    #define USIC_CH_BRG_TMEN_Pos               3                                                      /*!< USIC_CH BRG: TMEN Position              */
    #define USIC_CH_BRG_TMEN_Msk               ( 0x01UL << USIC_CH_BRG_TMEN_Pos )                     /*!< USIC_CH BRG: TMEN Mask                  */
    #define USIC_CH_BRG_PPPEN_Pos              4                                                      /*!< USIC_CH BRG: PPPEN Position             */
    #define USIC_CH_BRG_PPPEN_Msk              ( 0x01UL << USIC_CH_BRG_PPPEN_Pos )                    /*!< USIC_CH BRG: PPPEN Mask                 */
    #define USIC_CH_BRG_CTQSEL_Pos             6                                                      /*!< USIC_CH BRG: CTQSEL Position            */
    #define USIC_CH_BRG_CTQSEL_Msk             ( 0x03UL << USIC_CH_BRG_CTQSEL_Pos )                   /*!< USIC_CH BRG: CTQSEL Mask                */
    #define USIC_CH_BRG_PCTQ_Pos               8                                                      /*!< USIC_CH BRG: PCTQ Position              */
    #define USIC_CH_BRG_PCTQ_Msk               ( 0x03UL << USIC_CH_BRG_PCTQ_Pos )                     /*!< USIC_CH BRG: PCTQ Mask                  */
    #define USIC_CH_BRG_DCTQ_Pos               10                                                     /*!< USIC_CH BRG: DCTQ Position              */
    #define USIC_CH_BRG_DCTQ_Msk               ( 0x1fUL << USIC_CH_BRG_DCTQ_Pos )                     /*!< USIC_CH BRG: DCTQ Mask                  */
    #define USIC_CH_BRG_PDIV_Pos               16                                                     /*!< USIC_CH BRG: PDIV Position              */
    #define USIC_CH_BRG_PDIV_Msk               ( 0x000003ffUL << USIC_CH_BRG_PDIV_Pos )               /*!< USIC_CH BRG: PDIV Mask                  */
    #define USIC_CH_BRG_SCLKOSEL_Pos           28                                                     /*!< USIC_CH BRG: SCLKOSEL Position          */
    #define USIC_CH_BRG_SCLKOSEL_Msk           ( 0x01UL << USIC_CH_BRG_SCLKOSEL_Pos )                 /*!< USIC_CH BRG: SCLKOSEL Mask              */
    #define USIC_CH_BRG_MCLKCFG_Pos            29                                                     /*!< USIC_CH BRG: MCLKCFG Position           */
    #define USIC_CH_BRG_MCLKCFG_Msk            ( 0x01UL << USIC_CH_BRG_MCLKCFG_Pos )                  /*!< USIC_CH BRG: MCLKCFG Mask               */
    #define USIC_CH_BRG_SCLKCFG_Pos            30                                                     /*!< USIC_CH BRG: SCLKCFG Position           */
    #define USIC_CH_BRG_SCLKCFG_Msk            ( 0x03UL << USIC_CH_BRG_SCLKCFG_Pos )                  /*!< USIC_CH BRG: SCLKCFG Mask               */

/* --------------------------------  USIC_CH_INPR  -------------------------------- */
    #define USIC_CH_INPR_TSINP_Pos             0                                                      /*!< USIC_CH INPR: TSINP Position            */
    #define USIC_CH_INPR_TSINP_Msk             ( 0x07UL << USIC_CH_INPR_TSINP_Pos )                   /*!< USIC_CH INPR: TSINP Mask                */
    #define USIC_CH_INPR_TBINP_Pos             4                                                      /*!< USIC_CH INPR: TBINP Position            */
    #define USIC_CH_INPR_TBINP_Msk             ( 0x07UL << USIC_CH_INPR_TBINP_Pos )                   /*!< USIC_CH INPR: TBINP Mask                */
    #define USIC_CH_INPR_RINP_Pos              8                                                      /*!< USIC_CH INPR: RINP Position             */
    #define USIC_CH_INPR_RINP_Msk              ( 0x07UL << USIC_CH_INPR_RINP_Pos )                    /*!< USIC_CH INPR: RINP Mask                 */
    #define USIC_CH_INPR_AINP_Pos              12                                                     /*!< USIC_CH INPR: AINP Position             */
    #define USIC_CH_INPR_AINP_Msk              ( 0x07UL << USIC_CH_INPR_AINP_Pos )                    /*!< USIC_CH INPR: AINP Mask                 */
    #define USIC_CH_INPR_PINP_Pos              16                                                     /*!< USIC_CH INPR: PINP Position             */
    #define USIC_CH_INPR_PINP_Msk              ( 0x07UL << USIC_CH_INPR_PINP_Pos )                    /*!< USIC_CH INPR: PINP Mask                 */

/* --------------------------------  USIC_CH_DX0CR  ------------------------------- */
    #define USIC_CH_DX0CR_DSEL_Pos             0                                                      /*!< USIC_CH DX0CR: DSEL Position            */
    #define USIC_CH_DX0CR_DSEL_Msk             ( 0x07UL << USIC_CH_DX0CR_DSEL_Pos )                   /*!< USIC_CH DX0CR: DSEL Mask                */
    #define USIC_CH_DX0CR_INSW_Pos             4                                                      /*!< USIC_CH DX0CR: INSW Position            */
    #define USIC_CH_DX0CR_INSW_Msk             ( 0x01UL << USIC_CH_DX0CR_INSW_Pos )                   /*!< USIC_CH DX0CR: INSW Mask                */
    #define USIC_CH_DX0CR_DFEN_Pos             5                                                      /*!< USIC_CH DX0CR: DFEN Position            */
    #define USIC_CH_DX0CR_DFEN_Msk             ( 0x01UL << USIC_CH_DX0CR_DFEN_Pos )                   /*!< USIC_CH DX0CR: DFEN Mask                */
    #define USIC_CH_DX0CR_DSEN_Pos             6                                                      /*!< USIC_CH DX0CR: DSEN Position            */
    #define USIC_CH_DX0CR_DSEN_Msk             ( 0x01UL << USIC_CH_DX0CR_DSEN_Pos )                   /*!< USIC_CH DX0CR: DSEN Mask                */
    #define USIC_CH_DX0CR_DPOL_Pos             8                                                      /*!< USIC_CH DX0CR: DPOL Position            */
    #define USIC_CH_DX0CR_DPOL_Msk             ( 0x01UL << USIC_CH_DX0CR_DPOL_Pos )                   /*!< USIC_CH DX0CR: DPOL Mask                */
    #define USIC_CH_DX0CR_SFSEL_Pos            9                                                      /*!< USIC_CH DX0CR: SFSEL Position           */
    #define USIC_CH_DX0CR_SFSEL_Msk            ( 0x01UL << USIC_CH_DX0CR_SFSEL_Pos )                  /*!< USIC_CH DX0CR: SFSEL Mask               */
    #define USIC_CH_DX0CR_CM_Pos               10                                                     /*!< USIC_CH DX0CR: CM Position              */
    #define USIC_CH_DX0CR_CM_Msk               ( 0x03UL << USIC_CH_DX0CR_CM_Pos )                     /*!< USIC_CH DX0CR: CM Mask                  */
    #define USIC_CH_DX0CR_DXS_Pos              15                                                     /*!< USIC_CH DX0CR: DXS Position             */
    #define USIC_CH_DX0CR_DXS_Msk              ( 0x01UL << USIC_CH_DX0CR_DXS_Pos )                    /*!< USIC_CH DX0CR: DXS Mask                 */

/* --------------------------------  USIC_CH_DX1CR  ------------------------------- */
    #define USIC_CH_DX1CR_DSEL_Pos             0                                                      /*!< USIC_CH DX1CR: DSEL Position            */
    #define USIC_CH_DX1CR_DSEL_Msk             ( 0x07UL << USIC_CH_DX1CR_DSEL_Pos )                   /*!< USIC_CH DX1CR: DSEL Mask                */
    #define USIC_CH_DX1CR_DCEN_Pos             3                                                      /*!< USIC_CH DX1CR: DCEN Position            */
    #define USIC_CH_DX1CR_DCEN_Msk             ( 0x01UL << USIC_CH_DX1CR_DCEN_Pos )                   /*!< USIC_CH DX1CR: DCEN Mask                */
    #define USIC_CH_DX1CR_INSW_Pos             4                                                      /*!< USIC_CH DX1CR: INSW Position            */
    #define USIC_CH_DX1CR_INSW_Msk             ( 0x01UL << USIC_CH_DX1CR_INSW_Pos )                   /*!< USIC_CH DX1CR: INSW Mask                */
    #define USIC_CH_DX1CR_DFEN_Pos             5                                                      /*!< USIC_CH DX1CR: DFEN Position            */
    #define USIC_CH_DX1CR_DFEN_Msk             ( 0x01UL << USIC_CH_DX1CR_DFEN_Pos )                   /*!< USIC_CH DX1CR: DFEN Mask                */
    #define USIC_CH_DX1CR_DSEN_Pos             6                                                      /*!< USIC_CH DX1CR: DSEN Position            */
    #define USIC_CH_DX1CR_DSEN_Msk             ( 0x01UL << USIC_CH_DX1CR_DSEN_Pos )                   /*!< USIC_CH DX1CR: DSEN Mask                */
    #define USIC_CH_DX1CR_DPOL_Pos             8                                                      /*!< USIC_CH DX1CR: DPOL Position            */
    #define USIC_CH_DX1CR_DPOL_Msk             ( 0x01UL << USIC_CH_DX1CR_DPOL_Pos )                   /*!< USIC_CH DX1CR: DPOL Mask                */
    #define USIC_CH_DX1CR_SFSEL_Pos            9                                                      /*!< USIC_CH DX1CR: SFSEL Position           */
    #define USIC_CH_DX1CR_SFSEL_Msk            ( 0x01UL << USIC_CH_DX1CR_SFSEL_Pos )                  /*!< USIC_CH DX1CR: SFSEL Mask               */
    #define USIC_CH_DX1CR_CM_Pos               10                                                     /*!< USIC_CH DX1CR: CM Position              */
    #define USIC_CH_DX1CR_CM_Msk               ( 0x03UL << USIC_CH_DX1CR_CM_Pos )                     /*!< USIC_CH DX1CR: CM Mask                  */
    #define USIC_CH_DX1CR_DXS_Pos              15                                                     /*!< USIC_CH DX1CR: DXS Position             */
    #define USIC_CH_DX1CR_DXS_Msk              ( 0x01UL << USIC_CH_DX1CR_DXS_Pos )                    /*!< USIC_CH DX1CR: DXS Mask                 */

/* --------------------------------  USIC_CH_DX2CR  ------------------------------- */
    #define USIC_CH_DX2CR_DSEL_Pos             0                                                      /*!< USIC_CH DX2CR: DSEL Position            */
    #define USIC_CH_DX2CR_DSEL_Msk             ( 0x07UL << USIC_CH_DX2CR_DSEL_Pos )                   /*!< USIC_CH DX2CR: DSEL Mask                */
    #define USIC_CH_DX2CR_INSW_Pos             4                                                      /*!< USIC_CH DX2CR: INSW Position            */
    #define USIC_CH_DX2CR_INSW_Msk             ( 0x01UL << USIC_CH_DX2CR_INSW_Pos )                   /*!< USIC_CH DX2CR: INSW Mask                */
    #define USIC_CH_DX2CR_DFEN_Pos             5                                                      /*!< USIC_CH DX2CR: DFEN Position            */
    #define USIC_CH_DX2CR_DFEN_Msk             ( 0x01UL << USIC_CH_DX2CR_DFEN_Pos )                   /*!< USIC_CH DX2CR: DFEN Mask                */
    #define USIC_CH_DX2CR_DSEN_Pos             6                                                      /*!< USIC_CH DX2CR: DSEN Position            */
    #define USIC_CH_DX2CR_DSEN_Msk             ( 0x01UL << USIC_CH_DX2CR_DSEN_Pos )                   /*!< USIC_CH DX2CR: DSEN Mask                */
    #define USIC_CH_DX2CR_DPOL_Pos             8                                                      /*!< USIC_CH DX2CR: DPOL Position            */
    #define USIC_CH_DX2CR_DPOL_Msk             ( 0x01UL << USIC_CH_DX2CR_DPOL_Pos )                   /*!< USIC_CH DX2CR: DPOL Mask                */
    #define USIC_CH_DX2CR_SFSEL_Pos            9                                                      /*!< USIC_CH DX2CR: SFSEL Position           */
    #define USIC_CH_DX2CR_SFSEL_Msk            ( 0x01UL << USIC_CH_DX2CR_SFSEL_Pos )                  /*!< USIC_CH DX2CR: SFSEL Mask               */
    #define USIC_CH_DX2CR_CM_Pos               10                                                     /*!< USIC_CH DX2CR: CM Position              */
    #define USIC_CH_DX2CR_CM_Msk               ( 0x03UL << USIC_CH_DX2CR_CM_Pos )                     /*!< USIC_CH DX2CR: CM Mask                  */
    #define USIC_CH_DX2CR_DXS_Pos              15                                                     /*!< USIC_CH DX2CR: DXS Position             */
    #define USIC_CH_DX2CR_DXS_Msk              ( 0x01UL << USIC_CH_DX2CR_DXS_Pos )                    /*!< USIC_CH DX2CR: DXS Mask                 */

