FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  USIC_CH_DX3CR  ------------------------------- */
    #define USIC_CH_DX3CR_DSEL_Pos             0                                                      /*!< USIC_CH DX3CR: DSEL Position            */
    #define USIC_CH_DX3CR_DSEL_Msk             ( 0x07UL << USIC_CH_DX3CR_DSEL_Pos )                   /*!< USIC_CH DX3CR: DSEL Mask                */
    #define USIC_CH_DX3CR_INSW_Pos             4                                                      /*!< USIC_CH DX3CR: INSW Position            */
    #define USIC_CH_DX3CR_INSW_Msk             ( 0x01UL << USIC_CH_DX3CR_INSW_Pos )                   /*!< USIC_CH DX3CR: INSW Mask                */
    #define USIC_CH_DX3CR_DFEN_Pos             5                                                      /*!< USIC_CH DX3CR: DFEN Position            */
    #define USIC_CH_DX3CR_DFEN_Msk             ( 0x01UL << USIC_CH_DX3CR_DFEN_Pos )                   /*!< USIC_CH DX3CR: DFEN Mask                */
    #define USIC_CH_DX3CR_DSEN_Pos             6                                                      /*!< USIC_CH DX3CR: DSEN Position            */
    #define USIC_CH_DX3CR_DSEN_Msk             ( 0x01UL << USIC_CH_DX3CR_DSEN_Pos )                   /*!< USIC_CH DX3CR: DSEN Mask                */
    #define USIC_CH_DX3CR_DPOL_Pos             8                                                      /*!< USIC_CH DX3CR: DPOL Position            */
    #define USIC_CH_DX3CR_DPOL_Msk             ( 0x01UL << USIC_CH_DX3CR_DPOL_Pos )                   /*!< USIC_CH DX3CR: DPOL Mask                */
    #define USIC_CH_DX3CR_SFSEL_Pos            9                                                      /*!< USIC_CH DX3CR: SFSEL Position           */
    #define USIC_CH_DX3CR_SFSEL_Msk            ( 0x01UL << USIC_CH_DX3CR_SFSEL_Pos )                  /*!< USIC_CH DX3CR: SFSEL Mask               */
    #define USIC_CH_DX3CR_CM_Pos               10                                                     /*!< USIC_CH DX3CR: CM Position              */
    #define USIC_CH_DX3CR_CM_Msk               ( 0x03UL << USIC_CH_DX3CR_CM_Pos )                     /*!< USIC_CH DX3CR: CM Mask                  */
    #define USIC_CH_DX3CR_DXS_Pos              15                                                     /*!< USIC_CH DX3CR: DXS Position             */
    #define USIC_CH_DX3CR_DXS_Msk              ( 0x01UL << USIC_CH_DX3CR_DXS_Pos )                    /*!< USIC_CH DX3CR: DXS Mask                 */

/* --------------------------------  USIC_CH_DX4CR  ------------------------------- */
    #define USIC_CH_DX4CR_DSEL_Pos             0                                                      /*!< USIC_CH DX4CR: DSEL Position            */
    #define USIC_CH_DX4CR_DSEL_Msk             ( 0x07UL << USIC_CH_DX4CR_DSEL_Pos )                   /*!< USIC_CH DX4CR: DSEL Mask                */
    #define USIC_CH_DX4CR_INSW_Pos             4                                                      /*!< USIC_CH DX4CR: INSW Position            */
    #define USIC_CH_DX4CR_INSW_Msk             ( 0x01UL << USIC_CH_DX4CR_INSW_Pos )                   /*!< USIC_CH DX4CR: INSW Mask                */
    #define USIC_CH_DX4CR_DFEN_Pos             5                                                      /*!< USIC_CH DX4CR: DFEN Position            */
    #define USIC_CH_DX4CR_DFEN_Msk             ( 0x01UL << USIC_CH_DX4CR_DFEN_Pos )                   /*!< USIC_CH DX4CR: DFEN Mask                */
    #define USIC_CH_DX4CR_DSEN_Pos             6                                                      /*!< USIC_CH DX4CR: DSEN Position            */
    #define USIC_CH_DX4CR_DSEN_Msk             ( 0x01UL << USIC_CH_DX4CR_DSEN_Pos )                   /*!< USIC_CH DX4CR: DSEN Mask                */
    #define USIC_CH_DX4CR_DPOL_Pos             8                                                      /*!< USIC_CH DX4CR: DPOL Position            */
    #define USIC_CH_DX4CR_DPOL_Msk             ( 0x01UL << USIC_CH_DX4CR_DPOL_Pos )                   /*!< USIC_CH DX4CR: DPOL Mask                */
    #define USIC_CH_DX4CR_SFSEL_Pos            9                                                      /*!< USIC_CH DX4CR: SFSEL Position           */
    #define USIC_CH_DX4CR_SFSEL_Msk            ( 0x01UL << USIC_CH_DX4CR_SFSEL_Pos )                  /*!< USIC_CH DX4CR: SFSEL Mask               */
    #define USIC_CH_DX4CR_CM_Pos               10                                                     /*!< USIC_CH DX4CR: CM Position              */
    #define USIC_CH_DX4CR_CM_Msk               ( 0x03UL << USIC_CH_DX4CR_CM_Pos )                     /*!< USIC_CH DX4CR: CM Mask                  */
    #define USIC_CH_DX4CR_DXS_Pos              15                                                     /*!< USIC_CH DX4CR: DXS Position             */
    #define USIC_CH_DX4CR_DXS_Msk              ( 0x01UL << USIC_CH_DX4CR_DXS_Pos )                    /*!< USIC_CH DX4CR: DXS Mask                 */

/* --------------------------------  USIC_CH_DX5CR  ------------------------------- */
    #define USIC_CH_DX5CR_DSEL_Pos             0                                                      /*!< USIC_CH DX5CR: DSEL Position            */
    #define USIC_CH_DX5CR_DSEL_Msk             ( 0x07UL << USIC_CH_DX5CR_DSEL_Pos )                   /*!< USIC_CH DX5CR: DSEL Mask                */
    #define USIC_CH_DX5CR_INSW_Pos             4                                                      /*!< USIC_CH DX5CR: INSW Position            */
    #define USIC_CH_DX5CR_INSW_Msk             ( 0x01UL << USIC_CH_DX5CR_INSW_Pos )                   /*!< USIC_CH DX5CR: INSW Mask                */
    #define USIC_CH_DX5CR_DFEN_Pos             5                                                      /*!< USIC_CH DX5CR: DFEN Position            */
    #define USIC_CH_DX5CR_DFEN_Msk             ( 0x01UL << USIC_CH_DX5CR_DFEN_Pos )                   /*!< USIC_CH DX5CR: DFEN Mask                */
    #define USIC_CH_DX5CR_DSEN_Pos             6                                                      /*!< USIC_CH DX5CR: DSEN Position            */
    #define USIC_CH_DX5CR_DSEN_Msk             ( 0x01UL << USIC_CH_DX5CR_DSEN_Pos )                   /*!< USIC_CH DX5CR: DSEN Mask                */
    #define USIC_CH_DX5CR_DPOL_Pos             8                                                      /*!< USIC_CH DX5CR: DPOL Position            */
    #define USIC_CH_DX5CR_DPOL_Msk             ( 0x01UL << USIC_CH_DX5CR_DPOL_Pos )                   /*!< USIC_CH DX5CR: DPOL Mask                */
    #define USIC_CH_DX5CR_SFSEL_Pos            9                                                      /*!< USIC_CH DX5CR: SFSEL Position           */
    #define USIC_CH_DX5CR_SFSEL_Msk            ( 0x01UL << USIC_CH_DX5CR_SFSEL_Pos )                  /*!< USIC_CH DX5CR: SFSEL Mask               */
    #define USIC_CH_DX5CR_CM_Pos               10                                                     /*!< USIC_CH DX5CR: CM Position              */
    #define USIC_CH_DX5CR_CM_Msk               ( 0x03UL << USIC_CH_DX5CR_CM_Pos )                     /*!< USIC_CH DX5CR: CM Mask                  */
    #define USIC_CH_DX5CR_DXS_Pos              15                                                     /*!< USIC_CH DX5CR: DXS Position             */
    #define USIC_CH_DX5CR_DXS_Msk              ( 0x01UL << USIC_CH_DX5CR_DXS_Pos )                    /*!< USIC_CH DX5CR: DXS Mask                 */

/* --------------------------------  USIC_CH_SCTR  -------------------------------- */
    #define USIC_CH_SCTR_SDIR_Pos              0                                                      /*!< USIC_CH SCTR: SDIR Position             */
    #define USIC_CH_SCTR_SDIR_Msk              ( 0x01UL << USIC_CH_SCTR_SDIR_Pos )                    /*!< USIC_CH SCTR: SDIR Mask                 */
    #define USIC_CH_SCTR_PDL_Pos               1                                                      /*!< USIC_CH SCTR: PDL Position              */
    #define USIC_CH_SCTR_PDL_Msk               ( 0x01UL << USIC_CH_SCTR_PDL_Pos )                     /*!< USIC_CH SCTR: PDL Mask                  */
    #define USIC_CH_SCTR_DSM_Pos               2                                                      /*!< USIC_CH SCTR: DSM Position              */
    #define USIC_CH_SCTR_DSM_Msk               ( 0x03UL << USIC_CH_SCTR_DSM_Pos )                     /*!< USIC_CH SCTR: DSM Mask                  */
    #define USIC_CH_SCTR_HPCDIR_Pos            4                                                      /*!< USIC_CH SCTR: HPCDIR Position           */
    #define USIC_CH_SCTR_HPCDIR_Msk            ( 0x01UL << USIC_CH_SCTR_HPCDIR_Pos )                  /*!< USIC_CH SCTR: HPCDIR Mask               */
    #define USIC_CH_SCTR_DOCFG_Pos             6                                                      /*!< USIC_CH SCTR: DOCFG Position            */
    #define USIC_CH_SCTR_DOCFG_Msk             ( 0x03UL << USIC_CH_SCTR_DOCFG_Pos )                   /*!< USIC_CH SCTR: DOCFG Mask                */
    #define USIC_CH_SCTR_TRM_Pos               8                                                      /*!< USIC_CH SCTR: TRM Position              */
    #define USIC_CH_SCTR_TRM_Msk               ( 0x03UL << USIC_CH_SCTR_TRM_Pos )                     /*!< USIC_CH SCTR: TRM Mask                  */
    #define USIC_CH_SCTR_FLE_Pos               16                                                     /*!< USIC_CH SCTR: FLE Position              */
    #define USIC_CH_SCTR_FLE_Msk               ( 0x3fUL << USIC_CH_SCTR_FLE_Pos )                     /*!< USIC_CH SCTR: FLE Mask                  */
    #define USIC_CH_SCTR_WLE_Pos               24                                                     /*!< USIC_CH SCTR: WLE Position              */
    #define USIC_CH_SCTR_WLE_Msk               ( 0x0fUL << USIC_CH_SCTR_WLE_Pos )                     /*!< USIC_CH SCTR: WLE Mask                  */

