FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  USIC_CH_TCSR  -------------------------------- */
    #define USIC_CH_TCSR_WLEMD_Pos             0                                                      /*!< USIC_CH TCSR: WLEMD Position            */
    #define USIC_CH_TCSR_WLEMD_Msk             ( 0x01UL << USIC_CH_TCSR_WLEMD_Pos )                   /*!< USIC_CH TCSR: WLEMD Mask                */
    #define USIC_CH_TCSR_SELMD_Pos             1                                                      /*!< USIC_CH TCSR: SELMD Position            */
    #define USIC_CH_TCSR_SELMD_Msk             ( 0x01UL << USIC_CH_TCSR_SELMD_Pos )                   /*!< USIC_CH TCSR: SELMD Mask                */
    #define USIC_CH_TCSR_FLEMD_Pos             2                                                      /*!< USIC_CH TCSR: FLEMD Position            */
    #define USIC_CH_TCSR_FLEMD_Msk             ( 0x01UL << USIC_CH_TCSR_FLEMD_Pos )                   /*!< USIC_CH TCSR: FLEMD Mask                */
    #define USIC_CH_TCSR_WAMD_Pos              3                                                      /*!< USIC_CH TCSR: WAMD Position             */
    #define USIC_CH_TCSR_WAMD_Msk              ( 0x01UL << USIC_CH_TCSR_WAMD_Pos )                    /*!< USIC_CH TCSR: WAMD Mask                 */
    #define USIC_CH_TCSR_HPCMD_Pos             4                                                      /*!< USIC_CH TCSR: HPCMD Position            */
    #define USIC_CH_TCSR_HPCMD_Msk             ( 0x01UL << USIC_CH_TCSR_HPCMD_Pos )                   /*!< USIC_CH TCSR: HPCMD Mask                */
    #define USIC_CH_TCSR_SOF_Pos               5                                                      /*!< USIC_CH TCSR: SOF Position              */
    #define USIC_CH_TCSR_SOF_Msk               ( 0x01UL << USIC_CH_TCSR_SOF_Pos )                     /*!< USIC_CH TCSR: SOF Mask                  */
    #define USIC_CH_TCSR_EOF_Pos               6                                                      /*!< USIC_CH TCSR: EOF Position              */
    #define USIC_CH_TCSR_EOF_Msk               ( 0x01UL << USIC_CH_TCSR_EOF_Pos )                     /*!< USIC_CH TCSR: EOF Mask                  */
    #define USIC_CH_TCSR_TDV_Pos               7                                                      /*!< USIC_CH TCSR: TDV Position              */
    #define USIC_CH_TCSR_TDV_Msk               ( 0x01UL << USIC_CH_TCSR_TDV_Pos )                     /*!< USIC_CH TCSR: TDV Mask                  */
    #define USIC_CH_TCSR_TDSSM_Pos             8                                                      /*!< USIC_CH TCSR: TDSSM Position            */
    #define USIC_CH_TCSR_TDSSM_Msk             ( 0x01UL << USIC_CH_TCSR_TDSSM_Pos )                   /*!< USIC_CH TCSR: TDSSM Mask                */
    #define USIC_CH_TCSR_TDEN_Pos              10                                                     /*!< USIC_CH TCSR: TDEN Position             */
    #define USIC_CH_TCSR_TDEN_Msk              ( 0x03UL << USIC_CH_TCSR_TDEN_Pos )                    /*!< USIC_CH TCSR: TDEN Mask                 */
    #define USIC_CH_TCSR_TDVTR_Pos             12                                                     /*!< USIC_CH TCSR: TDVTR Position            */
    #define USIC_CH_TCSR_TDVTR_Msk             ( 0x01UL << USIC_CH_TCSR_TDVTR_Pos )                   /*!< USIC_CH TCSR: TDVTR Mask                */
    #define USIC_CH_TCSR_WA_Pos                13                                                     /*!< USIC_CH TCSR: WA Position               */
    #define USIC_CH_TCSR_WA_Msk                ( 0x01UL << USIC_CH_TCSR_WA_Pos )                      /*!< USIC_CH TCSR: WA Mask                   */
    #define USIC_CH_TCSR_TSOF_Pos              24                                                     /*!< USIC_CH TCSR: TSOF Position             */
    #define USIC_CH_TCSR_TSOF_Msk              ( 0x01UL << USIC_CH_TCSR_TSOF_Pos )                    /*!< USIC_CH TCSR: TSOF Mask                 */
    #define USIC_CH_TCSR_TV_Pos                26                                                     /*!< USIC_CH TCSR: TV Position               */
    #define USIC_CH_TCSR_TV_Msk                ( 0x01UL << USIC_CH_TCSR_TV_Pos )                      /*!< USIC_CH TCSR: TV Mask                   */
    #define USIC_CH_TCSR_TVC_Pos               27                                                     /*!< USIC_CH TCSR: TVC Position              */
    #define USIC_CH_TCSR_TVC_Msk               ( 0x01UL << USIC_CH_TCSR_TVC_Pos )                     /*!< USIC_CH TCSR: TVC Mask                  */
    #define USIC_CH_TCSR_TE_Pos                28                                                     /*!< USIC_CH TCSR: TE Position               */
    #define USIC_CH_TCSR_TE_Msk                ( 0x01UL << USIC_CH_TCSR_TE_Pos )                      /*!< USIC_CH TCSR: TE Mask                   */

/* ---------------------------------  USIC_CH_PCR  -------------------------------- */
    #define USIC_CH_PCR_CTR0_Pos               0                                                      /*!< USIC_CH PCR: CTR0 Position              */
    #define USIC_CH_PCR_CTR0_Msk               ( 0x01UL << USIC_CH_PCR_CTR0_Pos )                     /*!< USIC_CH PCR: CTR0 Mask                  */
    #define USIC_CH_PCR_CTR1_Pos               1                                                      /*!< USIC_CH PCR: CTR1 Position              */
    #define USIC_CH_PCR_CTR1_Msk               ( 0x01UL << USIC_CH_PCR_CTR1_Pos )                     /*!< USIC_CH PCR: CTR1 Mask                  */
    #define USIC_CH_PCR_CTR2_Pos               2                                                      /*!< USIC_CH PCR: CTR2 Position              */
    #define USIC_CH_PCR_CTR2_Msk               ( 0x01UL << USIC_CH_PCR_CTR2_Pos )                     /*!< USIC_CH PCR: CTR2 Mask                  */
    #define USIC_CH_PCR_CTR3_Pos               3                                                      /*!< USIC_CH PCR: CTR3 Position              */
    #define USIC_CH_PCR_CTR3_Msk               ( 0x01UL << USIC_CH_PCR_CTR3_Pos )                     /*!< USIC_CH PCR: CTR3 Mask                  */
    #define USIC_CH_PCR_CTR4_Pos               4                                                      /*!< USIC_CH PCR: CTR4 Position              */
    #define USIC_CH_PCR_CTR4_Msk               ( 0x01UL << USIC_CH_PCR_CTR4_Pos )                     /*!< USIC_CH PCR: CTR4 Mask                  */
    #define USIC_CH_PCR_CTR5_Pos               5                                                      /*!< USIC_CH PCR: CTR5 Position              */
    #define USIC_CH_PCR_CTR5_Msk               ( 0x01UL << USIC_CH_PCR_CTR5_Pos )                     /*!< USIC_CH PCR: CTR5 Mask                  */
    #define USIC_CH_PCR_CTR6_Pos               6                                                      /*!< USIC_CH PCR: CTR6 Position              */
    #define USIC_CH_PCR_CTR6_Msk               ( 0x01UL << USIC_CH_PCR_CTR6_Pos )                     /*!< USIC_CH PCR: CTR6 Mask                  */
    #define USIC_CH_PCR_CTR7_Pos               7                                                      /*!< USIC_CH PCR: CTR7 Position              */
    #define USIC_CH_PCR_CTR7_Msk               ( 0x01UL << USIC_CH_PCR_CTR7_Pos )                     /*!< USIC_CH PCR: CTR7 Mask                  */
    #define USIC_CH_PCR_CTR8_Pos               8                                                      /*!< USIC_CH PCR: CTR8 Position              */
    #define USIC_CH_PCR_CTR8_Msk               ( 0x01UL << USIC_CH_PCR_CTR8_Pos )                     /*!< USIC_CH PCR: CTR8 Mask                  */
    #define USIC_CH_PCR_CTR9_Pos               9                                                      /*!< USIC_CH PCR: CTR9 Position              */
    #define USIC_CH_PCR_CTR9_Msk               ( 0x01UL << USIC_CH_PCR_CTR9_Pos )                     /*!< USIC_CH PCR: CTR9 Mask                  */
    #define USIC_CH_PCR_CTR10_Pos              10                                                     /*!< USIC_CH PCR: CTR10 Position             */
    #define USIC_CH_PCR_CTR10_Msk              ( 0x01UL << USIC_CH_PCR_CTR10_Pos )                    /*!< USIC_CH PCR: CTR10 Mask                 */
    #define USIC_CH_PCR_CTR11_Pos              11                                                     /*!< USIC_CH PCR: CTR11 Position             */
    #define USIC_CH_PCR_CTR11_Msk              ( 0x01UL << USIC_CH_PCR_CTR11_Pos )                    /*!< USIC_CH PCR: CTR11 Mask                 */
    #define USIC_CH_PCR_CTR12_Pos              12                                                     /*!< USIC_CH PCR: CTR12 Position             */
    #define USIC_CH_PCR_CTR12_Msk              ( 0x01UL << USIC_CH_PCR_CTR12_Pos )                    /*!< USIC_CH PCR: CTR12 Mask                 */
    #define USIC_CH_PCR_CTR13_Pos              13                                                     /*!< USIC_CH PCR: CTR13 Position             */
    #define USIC_CH_PCR_CTR13_Msk              ( 0x01UL << USIC_CH_PCR_CTR13_Pos )                    /*!< USIC_CH PCR: CTR13 Mask                 */
    #define USIC_CH_PCR_CTR14_Pos              14                                                     /*!< USIC_CH PCR: CTR14 Position             */
    #define USIC_CH_PCR_CTR14_Msk              ( 0x01UL << USIC_CH_PCR_CTR14_Pos )                    /*!< USIC_CH PCR: CTR14 Mask                 */
    #define USIC_CH_PCR_CTR15_Pos              15                                                     /*!< USIC_CH PCR: CTR15 Position             */
    #define USIC_CH_PCR_CTR15_Msk              ( 0x01UL << USIC_CH_PCR_CTR15_Pos )                    /*!< USIC_CH PCR: CTR15 Mask                 */
    #define USIC_CH_PCR_CTR16_Pos              16                                                     /*!< USIC_CH PCR: CTR16 Position             */
    #define USIC_CH_PCR_CTR16_Msk              ( 0x01UL << USIC_CH_PCR_CTR16_Pos )                    /*!< USIC_CH PCR: CTR16 Mask                 */
    #define USIC_CH_PCR_CTR17_Pos              17                                                     /*!< USIC_CH PCR: CTR17 Position             */
    #define USIC_CH_PCR_CTR17_Msk              ( 0x01UL << USIC_CH_PCR_CTR17_Pos )                    /*!< USIC_CH PCR: CTR17 Mask                 */
    #define USIC_CH_PCR_CTR18_Pos              18                                                     /*!< USIC_CH PCR: CTR18 Position             */
    #define USIC_CH_PCR_CTR18_Msk              ( 0x01UL << USIC_CH_PCR_CTR18_Pos )                    /*!< USIC_CH PCR: CTR18 Mask                 */
    #define USIC_CH_PCR_CTR19_Pos              19                                                     /*!< USIC_CH PCR: CTR19 Position             */
    #define USIC_CH_PCR_CTR19_Msk              ( 0x01UL << USIC_CH_PCR_CTR19_Pos )                    /*!< USIC_CH PCR: CTR19 Mask                 */
    #define USIC_CH_PCR_CTR20_Pos              20                                                     /*!< USIC_CH PCR: CTR20 Position             */
    #define USIC_CH_PCR_CTR20_Msk              ( 0x01UL << USIC_CH_PCR_CTR20_Pos )                    /*!< USIC_CH PCR: CTR20 Mask                 */
    #define USIC_CH_PCR_CTR21_Pos              21                                                     /*!< USIC_CH PCR: CTR21 Position             */
    #define USIC_CH_PCR_CTR21_Msk              ( 0x01UL << USIC_CH_PCR_CTR21_Pos )                    /*!< USIC_CH PCR: CTR21 Mask                 */
    #define USIC_CH_PCR_CTR22_Pos              22                                                     /*!< USIC_CH PCR: CTR22 Position             */
    #define USIC_CH_PCR_CTR22_Msk              ( 0x01UL << USIC_CH_PCR_CTR22_Pos )                    /*!< USIC_CH PCR: CTR22 Mask                 */
    #define USIC_CH_PCR_CTR23_Pos              23                                                     /*!< USIC_CH PCR: CTR23 Position             */
    #define USIC_CH_PCR_CTR23_Msk              ( 0x01UL << USIC_CH_PCR_CTR23_Pos )                    /*!< USIC_CH PCR: CTR23 Mask                 */
    #define USIC_CH_PCR_CTR24_Pos              24                                                     /*!< USIC_CH PCR: CTR24 Position             */
    #define USIC_CH_PCR_CTR24_Msk              ( 0x01UL << USIC_CH_PCR_CTR24_Pos )                    /*!< USIC_CH PCR: CTR24 Mask                 */
    #define USIC_CH_PCR_CTR25_Pos              25                                                     /*!< USIC_CH PCR: CTR25 Position             */
    #define USIC_CH_PCR_CTR25_Msk              ( 0x01UL << USIC_CH_PCR_CTR25_Pos )                    /*!< USIC_CH PCR: CTR25 Mask                 */
    #define USIC_CH_PCR_CTR26_Pos              26                                                     /*!< USIC_CH PCR: CTR26 Position             */
    #define USIC_CH_PCR_CTR26_Msk              ( 0x01UL << USIC_CH_PCR_CTR26_Pos )                    /*!< USIC_CH PCR: CTR26 Mask                 */
    #define USIC_CH_PCR_CTR27_Pos              27                                                     /*!< USIC_CH PCR: CTR27 Position             */
    #define USIC_CH_PCR_CTR27_Msk              ( 0x01UL << USIC_CH_PCR_CTR27_Pos )                    /*!< USIC_CH PCR: CTR27 Mask                 */
    #define USIC_CH_PCR_CTR28_Pos              28                                                     /*!< USIC_CH PCR: CTR28 Position             */
    #define USIC_CH_PCR_CTR28_Msk              ( 0x01UL << USIC_CH_PCR_CTR28_Pos )                    /*!< USIC_CH PCR: CTR28 Mask                 */
    #define USIC_CH_PCR_CTR29_Pos              29                                                     /*!< USIC_CH PCR: CTR29 Position             */
    #define USIC_CH_PCR_CTR29_Msk              ( 0x01UL << USIC_CH_PCR_CTR29_Pos )                    /*!< USIC_CH PCR: CTR29 Mask                 */
    #define USIC_CH_PCR_CTR30_Pos              30                                                     /*!< USIC_CH PCR: CTR30 Position             */
    #define USIC_CH_PCR_CTR30_Msk              ( 0x01UL << USIC_CH_PCR_CTR30_Pos )                    /*!< USIC_CH PCR: CTR30 Mask                 */
    #define USIC_CH_PCR_CTR31_Pos              31                                                     /*!< USIC_CH PCR: CTR31 Position             */
    #define USIC_CH_PCR_CTR31_Msk              ( 0x01UL << USIC_CH_PCR_CTR31_Pos )                    /*!< USIC_CH PCR: CTR31 Mask                 */

/* -----------------------------  USIC_CH_PCR_ASCMode  ---------------------------- */
    #define USIC_CH_PCR_ASCMode_SMD_Pos        0                                                      /*!< USIC_CH PCR_ASCMode: SMD Position       */
    #define USIC_CH_PCR_ASCMode_SMD_Msk        ( 0x01UL << USIC_CH_PCR_ASCMode_SMD_Pos )              /*!< USIC_CH PCR_ASCMode: SMD Mask           */
    #define USIC_CH_PCR_ASCMode_STPB_Pos       1                                                      /*!< USIC_CH PCR_ASCMode: STPB Position      */
    #define USIC_CH_PCR_ASCMode_STPB_Msk       ( 0x01UL << USIC_CH_PCR_ASCMode_STPB_Pos )             /*!< USIC_CH PCR_ASCMode: STPB Mask          */
    #define USIC_CH_PCR_ASCMode_IDM_Pos        2                                                      /*!< USIC_CH PCR_ASCMode: IDM Position       */
    #define USIC_CH_PCR_ASCMode_IDM_Msk        ( 0x01UL << USIC_CH_PCR_ASCMode_IDM_Pos )              /*!< USIC_CH PCR_ASCMode: IDM Mask           */
    #define USIC_CH_PCR_ASCMode_SBIEN_Pos      3                                                      /*!< USIC_CH PCR_ASCMode: SBIEN Position     */
    #define USIC_CH_PCR_ASCMode_SBIEN_Msk      ( 0x01UL << USIC_CH_PCR_ASCMode_SBIEN_Pos )            /*!< USIC_CH PCR_ASCMode: SBIEN Mask         */
    #define USIC_CH_PCR_ASCMode_CDEN_Pos       4                                                      /*!< USIC_CH PCR_ASCMode: CDEN Position      */
    #define USIC_CH_PCR_ASCMode_CDEN_Msk       ( 0x01UL << USIC_CH_PCR_ASCMode_CDEN_Pos )             /*!< USIC_CH PCR_ASCMode: CDEN Mask          */
    #define USIC_CH_PCR_ASCMode_RNIEN_Pos      5                                                      /*!< USIC_CH PCR_ASCMode: RNIEN Position     */
    #define USIC_CH_PCR_ASCMode_RNIEN_Msk      ( 0x01UL << USIC_CH_PCR_ASCMode_RNIEN_Pos )            /*!< USIC_CH PCR_ASCMode: RNIEN Mask         */
    #define USIC_CH_PCR_ASCMode_FEIEN_Pos      6                                                      /*!< USIC_CH PCR_ASCMode: FEIEN Position     */
    #define USIC_CH_PCR_ASCMode_FEIEN_Msk      ( 0x01UL << USIC_CH_PCR_ASCMode_FEIEN_Pos )            /*!< USIC_CH PCR_ASCMode: FEIEN Mask         */
    #define USIC_CH_PCR_ASCMode_FFIEN_Pos      7                                                      /*!< USIC_CH PCR_ASCMode: FFIEN Position     */
    #define USIC_CH_PCR_ASCMode_FFIEN_Msk      ( 0x01UL << USIC_CH_PCR_ASCMode_FFIEN_Pos )            /*!< USIC_CH PCR_ASCMode: FFIEN Mask         */
    #define USIC_CH_PCR_ASCMode_SP_Pos         8                                                      /*!< USIC_CH PCR_ASCMode: SP Position        */
    #define USIC_CH_PCR_ASCMode_SP_Msk         ( 0x1fUL << USIC_CH_PCR_ASCMode_SP_Pos )               /*!< USIC_CH PCR_ASCMode: SP Mask            */
    #define USIC_CH_PCR_ASCMode_PL_Pos         13                                                     /*!< USIC_CH PCR_ASCMode: PL Position        */
    #define USIC_CH_PCR_ASCMode_PL_Msk         ( 0x07UL << USIC_CH_PCR_ASCMode_PL_Pos )               /*!< USIC_CH PCR_ASCMode: PL Mask            */
    #define USIC_CH_PCR_ASCMode_RSTEN_Pos      16                                                     /*!< USIC_CH PCR_ASCMode: RSTEN Position     */
    #define USIC_CH_PCR_ASCMode_RSTEN_Msk      ( 0x01UL << USIC_CH_PCR_ASCMode_RSTEN_Pos )            /*!< USIC_CH PCR_ASCMode: RSTEN Mask         */
    #define USIC_CH_PCR_ASCMode_TSTEN_Pos      17                                                     /*!< USIC_CH PCR_ASCMode: TSTEN Position     */
    #define USIC_CH_PCR_ASCMode_TSTEN_Msk      ( 0x01UL << USIC_CH_PCR_ASCMode_TSTEN_Pos )            /*!< USIC_CH PCR_ASCMode: TSTEN Mask         */
    #define USIC_CH_PCR_ASCMode_MCLK_Pos       31                                                     /*!< USIC_CH PCR_ASCMode: MCLK Position      */
    #define USIC_CH_PCR_ASCMode_MCLK_Msk       ( 0x01UL << USIC_CH_PCR_ASCMode_MCLK_Pos )             /*!< USIC_CH PCR_ASCMode: MCLK Mask          */

/* -----------------------------  USIC_CH_PCR_SSCMode  ---------------------------- */
    #define USIC_CH_PCR_SSCMode_MSLSEN_Pos     0                                                      /*!< USIC_CH PCR_SSCMode: MSLSEN Position    */
    #define USIC_CH_PCR_SSCMode_MSLSEN_Msk     ( 0x01UL << USIC_CH_PCR_SSCMode_MSLSEN_Pos )           /*!< USIC_CH PCR_SSCMode: MSLSEN Mask        */
    #define USIC_CH_PCR_SSCMode_SELCTR_Pos     1                                                      /*!< USIC_CH PCR_SSCMode: SELCTR Position    */
    #define USIC_CH_PCR_SSCMode_SELCTR_Msk     ( 0x01UL << USIC_CH_PCR_SSCMode_SELCTR_Pos )           /*!< USIC_CH PCR_SSCMode: SELCTR Mask        */
    #define USIC_CH_PCR_SSCMode_SELINV_Pos     2                                                      /*!< USIC_CH PCR_SSCMode: SELINV Position    */
    #define USIC_CH_PCR_SSCMode_SELINV_Msk     ( 0x01UL << USIC_CH_PCR_SSCMode_SELINV_Pos )           /*!< USIC_CH PCR_SSCMode: SELINV Mask        */
    #define USIC_CH_PCR_SSCMode_FEM_Pos        3                                                      /*!< USIC_CH PCR_SSCMode: FEM Position       */
    #define USIC_CH_PCR_SSCMode_FEM_Msk        ( 0x01UL << USIC_CH_PCR_SSCMode_FEM_Pos )              /*!< USIC_CH PCR_SSCMode: FEM Mask           */
    #define USIC_CH_PCR_SSCMode_CTQSEL1_Pos    4                                                      /*!< USIC_CH PCR_SSCMode: CTQSEL1 Position   */
    #define USIC_CH_PCR_SSCMode_CTQSEL1_Msk    ( 0x03UL << USIC_CH_PCR_SSCMode_CTQSEL1_Pos )          /*!< USIC_CH PCR_SSCMode: CTQSEL1 Mask       */
    #define USIC_CH_PCR_SSCMode_PCTQ1_Pos      6                                                      /*!< USIC_CH PCR_SSCMode: PCTQ1 Position     */
    #define USIC_CH_PCR_SSCMode_PCTQ1_Msk      ( 0x03UL << USIC_CH_PCR_SSCMode_PCTQ1_Pos )            /*!< USIC_CH PCR_SSCMode: PCTQ1 Mask         */
    #define USIC_CH_PCR_SSCMode_DCTQ1_Pos      8                                                      /*!< USIC_CH PCR_SSCMode: DCTQ1 Position     */
    #define USIC_CH_PCR_SSCMode_DCTQ1_Msk      ( 0x1fUL << USIC_CH_PCR_SSCMode_DCTQ1_Pos )            /*!< USIC_CH PCR_SSCMode: DCTQ1 Mask         */
    #define USIC_CH_PCR_SSCMode_PARIEN_Pos     13                                                     /*!< USIC_CH PCR_SSCMode: PARIEN Position    */
    #define USIC_CH_PCR_SSCMode_PARIEN_Msk     ( 0x01UL << USIC_CH_PCR_SSCMode_PARIEN_Pos )           /*!< USIC_CH PCR_SSCMode: PARIEN Mask        */
    #define USIC_CH_PCR_SSCMode_MSLSIEN_Pos    14                                                     /*!< USIC_CH PCR_SSCMode: MSLSIEN Position   */
    #define USIC_CH_PCR_SSCMode_MSLSIEN_Msk    ( 0x01UL << USIC_CH_PCR_SSCMode_MSLSIEN_Pos )          /*!< USIC_CH PCR_SSCMode: MSLSIEN Mask       */
    #define USIC_CH_PCR_SSCMode_DX2TIEN_Pos    15                                                     /*!< USIC_CH PCR_SSCMode: DX2TIEN Position   */
    #define USIC_CH_PCR_SSCMode_DX2TIEN_Msk    ( 0x01UL << USIC_CH_PCR_SSCMode_DX2TIEN_Pos )          /*!< USIC_CH PCR_SSCMode: DX2TIEN Mask       */
    #define USIC_CH_PCR_SSCMode_SELO_Pos       16                                                     /*!< USIC_CH PCR_SSCMode: SELO Position      */
    #define USIC_CH_PCR_SSCMode_SELO_Msk       ( 0x000000ffUL << USIC_CH_PCR_SSCMode_SELO_Pos )       /*!< USIC_CH PCR_SSCMode: SELO Mask          */
    #define USIC_CH_PCR_SSCMode_TIWEN_Pos      24                                                     /*!< USIC_CH PCR_SSCMode: TIWEN Position     */
    #define USIC_CH_PCR_SSCMode_TIWEN_Msk      ( 0x01UL << USIC_CH_PCR_SSCMode_TIWEN_Pos )            /*!< USIC_CH PCR_SSCMode: TIWEN Mask         */
    #define USIC_CH_PCR_SSCMode_MCLK_Pos       31                                                     /*!< USIC_CH PCR_SSCMode: MCLK Position      */
    #define USIC_CH_PCR_SSCMode_MCLK_Msk       ( 0x01UL << USIC_CH_PCR_SSCMode_MCLK_Pos )             /*!< USIC_CH PCR_SSCMode: MCLK Mask          */

