FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* -----------------------------  USIC_CH_PCR_IICMode  ---------------------------- */
    #define USIC_CH_PCR_IICMode_SLAD_Pos       0                                                      /*!< USIC_CH PCR_IICMode: SLAD Position      */
    #define USIC_CH_PCR_IICMode_SLAD_Msk       ( 0x0000ffffUL << USIC_CH_PCR_IICMode_SLAD_Pos )       /*!< USIC_CH PCR_IICMode: SLAD Mask          */
    #define USIC_CH_PCR_IICMode_ACK00_Pos      16                                                     /*!< USIC_CH PCR_IICMode: ACK00 Position     */
    #define USIC_CH_PCR_IICMode_ACK00_Msk      ( 0x01UL << USIC_CH_PCR_IICMode_ACK00_Pos )            /*!< USIC_CH PCR_IICMode: ACK00 Mask         */
    #define USIC_CH_PCR_IICMode_STIM_Pos       17                                                     /*!< USIC_CH PCR_IICMode: STIM Position      */
    #define USIC_CH_PCR_IICMode_STIM_Msk       ( 0x01UL << USIC_CH_PCR_IICMode_STIM_Pos )             /*!< USIC_CH PCR_IICMode: STIM Mask          */
    #define USIC_CH_PCR_IICMode_SCRIEN_Pos     18                                                     /*!< USIC_CH PCR_IICMode: SCRIEN Position    */
    #define USIC_CH_PCR_IICMode_SCRIEN_Msk     ( 0x01UL << USIC_CH_PCR_IICMode_SCRIEN_Pos )           /*!< USIC_CH PCR_IICMode: SCRIEN Mask        */
    #define USIC_CH_PCR_IICMode_RSCRIEN_Pos    19                                                     /*!< USIC_CH PCR_IICMode: RSCRIEN Position   */
    #define USIC_CH_PCR_IICMode_RSCRIEN_Msk    ( 0x01UL << USIC_CH_PCR_IICMode_RSCRIEN_Pos )          /*!< USIC_CH PCR_IICMode: RSCRIEN Mask       */
    #define USIC_CH_PCR_IICMode_PCRIEN_Pos     20                                                     /*!< USIC_CH PCR_IICMode: PCRIEN Position    */
    #define USIC_CH_PCR_IICMode_PCRIEN_Msk     ( 0x01UL << USIC_CH_PCR_IICMode_PCRIEN_Pos )           /*!< USIC_CH PCR_IICMode: PCRIEN Mask        */
    #define USIC_CH_PCR_IICMode_NACKIEN_Pos    21                                                     /*!< USIC_CH PCR_IICMode: NACKIEN Position   */
    #define USIC_CH_PCR_IICMode_NACKIEN_Msk    ( 0x01UL << USIC_CH_PCR_IICMode_NACKIEN_Pos )          /*!< USIC_CH PCR_IICMode: NACKIEN Mask       */
    #define USIC_CH_PCR_IICMode_ARLIEN_Pos     22                                                     /*!< USIC_CH PCR_IICMode: ARLIEN Position    */
    #define USIC_CH_PCR_IICMode_ARLIEN_Msk     ( 0x01UL << USIC_CH_PCR_IICMode_ARLIEN_Pos )           /*!< USIC_CH PCR_IICMode: ARLIEN Mask        */
    #define USIC_CH_PCR_IICMode_SRRIEN_Pos     23                                                     /*!< USIC_CH PCR_IICMode: SRRIEN Position    */
    #define USIC_CH_PCR_IICMode_SRRIEN_Msk     ( 0x01UL << USIC_CH_PCR_IICMode_SRRIEN_Pos )           /*!< USIC_CH PCR_IICMode: SRRIEN Mask        */
    #define USIC_CH_PCR_IICMode_ERRIEN_Pos     24                                                     /*!< USIC_CH PCR_IICMode: ERRIEN Position    */
    #define USIC_CH_PCR_IICMode_ERRIEN_Msk     ( 0x01UL << USIC_CH_PCR_IICMode_ERRIEN_Pos )           /*!< USIC_CH PCR_IICMode: ERRIEN Mask        */
    #define USIC_CH_PCR_IICMode_SACKDIS_Pos    25                                                     /*!< USIC_CH PCR_IICMode: SACKDIS Position   */
    #define USIC_CH_PCR_IICMode_SACKDIS_Msk    ( 0x01UL << USIC_CH_PCR_IICMode_SACKDIS_Pos )          /*!< USIC_CH PCR_IICMode: SACKDIS Mask       */
    #define USIC_CH_PCR_IICMode_HDEL_Pos       26                                                     /*!< USIC_CH PCR_IICMode: HDEL Position      */
    #define USIC_CH_PCR_IICMode_HDEL_Msk       ( 0x0fUL << USIC_CH_PCR_IICMode_HDEL_Pos )             /*!< USIC_CH PCR_IICMode: HDEL Mask          */
    #define USIC_CH_PCR_IICMode_ACKIEN_Pos     30                                                     /*!< USIC_CH PCR_IICMode: ACKIEN Position    */
    #define USIC_CH_PCR_IICMode_ACKIEN_Msk     ( 0x01UL << USIC_CH_PCR_IICMode_ACKIEN_Pos )           /*!< USIC_CH PCR_IICMode: ACKIEN Mask        */
    #define USIC_CH_PCR_IICMode_MCLK_Pos       31                                                     /*!< USIC_CH PCR_IICMode: MCLK Position      */
    #define USIC_CH_PCR_IICMode_MCLK_Msk       ( 0x01UL << USIC_CH_PCR_IICMode_MCLK_Pos )             /*!< USIC_CH PCR_IICMode: MCLK Mask          */

/* -----------------------------  USIC_CH_PCR_IISMode  ---------------------------- */
    #define USIC_CH_PCR_IISMode_WAGEN_Pos      0                                                      /*!< USIC_CH PCR_IISMode: WAGEN Position     */
    #define USIC_CH_PCR_IISMode_WAGEN_Msk      ( 0x01UL << USIC_CH_PCR_IISMode_WAGEN_Pos )            /*!< USIC_CH PCR_IISMode: WAGEN Mask         */
    #define USIC_CH_PCR_IISMode_DTEN_Pos       1                                                      /*!< USIC_CH PCR_IISMode: DTEN Position      */
    #define USIC_CH_PCR_IISMode_DTEN_Msk       ( 0x01UL << USIC_CH_PCR_IISMode_DTEN_Pos )             /*!< USIC_CH PCR_IISMode: DTEN Mask          */
    #define USIC_CH_PCR_IISMode_SELINV_Pos     2                                                      /*!< USIC_CH PCR_IISMode: SELINV Position    */
    #define USIC_CH_PCR_IISMode_SELINV_Msk     ( 0x01UL << USIC_CH_PCR_IISMode_SELINV_Pos )           /*!< USIC_CH PCR_IISMode: SELINV Mask        */
    #define USIC_CH_PCR_IISMode_WAFEIEN_Pos    4                                                      /*!< USIC_CH PCR_IISMode: WAFEIEN Position   */
    #define USIC_CH_PCR_IISMode_WAFEIEN_Msk    ( 0x01UL << USIC_CH_PCR_IISMode_WAFEIEN_Pos )          /*!< USIC_CH PCR_IISMode: WAFEIEN Mask       */
    #define USIC_CH_PCR_IISMode_WAREIEN_Pos    5                                                      /*!< USIC_CH PCR_IISMode: WAREIEN Position   */
    #define USIC_CH_PCR_IISMode_WAREIEN_Msk    ( 0x01UL << USIC_CH_PCR_IISMode_WAREIEN_Pos )          /*!< USIC_CH PCR_IISMode: WAREIEN Mask       */
    #define USIC_CH_PCR_IISMode_ENDIEN_Pos     6                                                      /*!< USIC_CH PCR_IISMode: ENDIEN Position    */
    #define USIC_CH_PCR_IISMode_ENDIEN_Msk     ( 0x01UL << USIC_CH_PCR_IISMode_ENDIEN_Pos )           /*!< USIC_CH PCR_IISMode: ENDIEN Mask        */
    #define USIC_CH_PCR_IISMode_DX2TIEN_Pos    15                                                     /*!< USIC_CH PCR_IISMode: DX2TIEN Position   */
    #define USIC_CH_PCR_IISMode_DX2TIEN_Msk    ( 0x01UL << USIC_CH_PCR_IISMode_DX2TIEN_Pos )          /*!< USIC_CH PCR_IISMode: DX2TIEN Mask       */
    #define USIC_CH_PCR_IISMode_TDEL_Pos       16                                                     /*!< USIC_CH PCR_IISMode: TDEL Position      */
    #define USIC_CH_PCR_IISMode_TDEL_Msk       ( 0x3fUL << USIC_CH_PCR_IISMode_TDEL_Pos )             /*!< USIC_CH PCR_IISMode: TDEL Mask          */
    #define USIC_CH_PCR_IISMode_MCLK_Pos       31                                                     /*!< USIC_CH PCR_IISMode: MCLK Position      */
    #define USIC_CH_PCR_IISMode_MCLK_Msk       ( 0x01UL << USIC_CH_PCR_IISMode_MCLK_Pos )             /*!< USIC_CH PCR_IISMode: MCLK Mask          */

