FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  USIC_CH_CCR  -------------------------------- */
    #define USIC_CH_CCR_MODE_Pos               0                                                      /*!< USIC_CH CCR: MODE Position              */
    #define USIC_CH_CCR_MODE_Msk               ( 0x0fUL << USIC_CH_CCR_MODE_Pos )                     /*!< USIC_CH CCR: MODE Mask                  */
    #define USIC_CH_CCR_HPCEN_Pos              6                                                      /*!< USIC_CH CCR: HPCEN Position             */
    #define USIC_CH_CCR_HPCEN_Msk              ( 0x03UL << USIC_CH_CCR_HPCEN_Pos )                    /*!< USIC_CH CCR: HPCEN Mask                 */
    #define USIC_CH_CCR_PM_Pos                 8                                                      /*!< USIC_CH CCR: PM Position                */
    #define USIC_CH_CCR_PM_Msk                 ( 0x03UL << USIC_CH_CCR_PM_Pos )                       /*!< USIC_CH CCR: PM Mask                    */
    #define USIC_CH_CCR_RSIEN_Pos              10                                                     /*!< USIC_CH CCR: RSIEN Position             */
    #define USIC_CH_CCR_RSIEN_Msk              ( 0x01UL << USIC_CH_CCR_RSIEN_Pos )                    /*!< USIC_CH CCR: RSIEN Mask                 */
    #define USIC_CH_CCR_DLIEN_Pos              11                                                     /*!< USIC_CH CCR: DLIEN Position             */
    #define USIC_CH_CCR_DLIEN_Msk              ( 0x01UL << USIC_CH_CCR_DLIEN_Pos )                    /*!< USIC_CH CCR: DLIEN Mask                 */
    #define USIC_CH_CCR_TSIEN_Pos              12                                                     /*!< USIC_CH CCR: TSIEN Position             */
    #define USIC_CH_CCR_TSIEN_Msk              ( 0x01UL << USIC_CH_CCR_TSIEN_Pos )                    /*!< USIC_CH CCR: TSIEN Mask                 */
    #define USIC_CH_CCR_TBIEN_Pos              13                                                     /*!< USIC_CH CCR: TBIEN Position             */
    #define USIC_CH_CCR_TBIEN_Msk              ( 0x01UL << USIC_CH_CCR_TBIEN_Pos )                    /*!< USIC_CH CCR: TBIEN Mask                 */
    #define USIC_CH_CCR_RIEN_Pos               14                                                     /*!< USIC_CH CCR: RIEN Position              */
    #define USIC_CH_CCR_RIEN_Msk               ( 0x01UL << USIC_CH_CCR_RIEN_Pos )                     /*!< USIC_CH CCR: RIEN Mask                  */
    #define USIC_CH_CCR_AIEN_Pos               15                                                     /*!< USIC_CH CCR: AIEN Position              */
    #define USIC_CH_CCR_AIEN_Msk               ( 0x01UL << USIC_CH_CCR_AIEN_Pos )                     /*!< USIC_CH CCR: AIEN Mask                  */
    #define USIC_CH_CCR_BRGIEN_Pos             16                                                     /*!< USIC_CH CCR: BRGIEN Position            */
    #define USIC_CH_CCR_BRGIEN_Msk             ( 0x01UL << USIC_CH_CCR_BRGIEN_Pos )                   /*!< USIC_CH CCR: BRGIEN Mask                */

/* --------------------------------  USIC_CH_CMTR  -------------------------------- */
    #define USIC_CH_CMTR_CTV_Pos               0                                                      /*!< USIC_CH CMTR: CTV Position              */
    #define USIC_CH_CMTR_CTV_Msk               ( 0x000003ffUL << USIC_CH_CMTR_CTV_Pos )               /*!< USIC_CH CMTR: CTV Mask                  */

/* ---------------------------------  USIC_CH_PSR  -------------------------------- */
    #define USIC_CH_PSR_ST0_Pos                0                                                      /*!< USIC_CH PSR: ST0 Position               */
    #define USIC_CH_PSR_ST0_Msk                ( 0x01UL << USIC_CH_PSR_ST0_Pos )                      /*!< USIC_CH PSR: ST0 Mask                   */
    #define USIC_CH_PSR_ST1_Pos                1                                                      /*!< USIC_CH PSR: ST1 Position               */
    #define USIC_CH_PSR_ST1_Msk                ( 0x01UL << USIC_CH_PSR_ST1_Pos )                      /*!< USIC_CH PSR: ST1 Mask                   */
    #define USIC_CH_PSR_ST2_Pos                2                                                      /*!< USIC_CH PSR: ST2 Position               */
    #define USIC_CH_PSR_ST2_Msk                ( 0x01UL << USIC_CH_PSR_ST2_Pos )                      /*!< USIC_CH PSR: ST2 Mask                   */
    #define USIC_CH_PSR_ST3_Pos                3                                                      /*!< USIC_CH PSR: ST3 Position               */
    #define USIC_CH_PSR_ST3_Msk                ( 0x01UL << USIC_CH_PSR_ST3_Pos )                      /*!< USIC_CH PSR: ST3 Mask                   */
    #define USIC_CH_PSR_ST4_Pos                4                                                      /*!< USIC_CH PSR: ST4 Position               */
    #define USIC_CH_PSR_ST4_Msk                ( 0x01UL << USIC_CH_PSR_ST4_Pos )                      /*!< USIC_CH PSR: ST4 Mask                   */
    #define USIC_CH_PSR_ST5_Pos                5                                                      /*!< USIC_CH PSR: ST5 Position               */
    #define USIC_CH_PSR_ST5_Msk                ( 0x01UL << USIC_CH_PSR_ST5_Pos )                      /*!< USIC_CH PSR: ST5 Mask                   */
    #define USIC_CH_PSR_ST6_Pos                6                                                      /*!< USIC_CH PSR: ST6 Position               */
    #define USIC_CH_PSR_ST6_Msk                ( 0x01UL << USIC_CH_PSR_ST6_Pos )                      /*!< USIC_CH PSR: ST6 Mask                   */
    #define USIC_CH_PSR_ST7_Pos                7                                                      /*!< USIC_CH PSR: ST7 Position               */
    #define USIC_CH_PSR_ST7_Msk                ( 0x01UL << USIC_CH_PSR_ST7_Pos )                      /*!< USIC_CH PSR: ST7 Mask                   */
    #define USIC_CH_PSR_ST8_Pos                8                                                      /*!< USIC_CH PSR: ST8 Position               */
    #define USIC_CH_PSR_ST8_Msk                ( 0x01UL << USIC_CH_PSR_ST8_Pos )                      /*!< USIC_CH PSR: ST8 Mask                   */
    #define USIC_CH_PSR_ST9_Pos                9                                                      /*!< USIC_CH PSR: ST9 Position               */
    #define USIC_CH_PSR_ST9_Msk                ( 0x01UL << USIC_CH_PSR_ST9_Pos )                      /*!< USIC_CH PSR: ST9 Mask                   */
    #define USIC_CH_PSR_RSIF_Pos               10                                                     /*!< USIC_CH PSR: RSIF Position              */
    #define USIC_CH_PSR_RSIF_Msk               ( 0x01UL << USIC_CH_PSR_RSIF_Pos )                     /*!< USIC_CH PSR: RSIF Mask                  */
    #define USIC_CH_PSR_DLIF_Pos               11                                                     /*!< USIC_CH PSR: DLIF Position              */
    #define USIC_CH_PSR_DLIF_Msk               ( 0x01UL << USIC_CH_PSR_DLIF_Pos )                     /*!< USIC_CH PSR: DLIF Mask                  */
    #define USIC_CH_PSR_TSIF_Pos               12                                                     /*!< USIC_CH PSR: TSIF Position              */
    #define USIC_CH_PSR_TSIF_Msk               ( 0x01UL << USIC_CH_PSR_TSIF_Pos )                     /*!< USIC_CH PSR: TSIF Mask                  */
    #define USIC_CH_PSR_TBIF_Pos               13                                                     /*!< USIC_CH PSR: TBIF Position              */
    #define USIC_CH_PSR_TBIF_Msk               ( 0x01UL << USIC_CH_PSR_TBIF_Pos )                     /*!< USIC_CH PSR: TBIF Mask                  */
    #define USIC_CH_PSR_RIF_Pos                14                                                     /*!< USIC_CH PSR: RIF Position               */
    #define USIC_CH_PSR_RIF_Msk                ( 0x01UL << USIC_CH_PSR_RIF_Pos )                      /*!< USIC_CH PSR: RIF Mask                   */
    #define USIC_CH_PSR_AIF_Pos                15                                                     /*!< USIC_CH PSR: AIF Position               */
    #define USIC_CH_PSR_AIF_Msk                ( 0x01UL << USIC_CH_PSR_AIF_Pos )                      /*!< USIC_CH PSR: AIF Mask                   */
    #define USIC_CH_PSR_BRGIF_Pos              16                                                     /*!< USIC_CH PSR: BRGIF Position             */
    #define USIC_CH_PSR_BRGIF_Msk              ( 0x01UL << USIC_CH_PSR_BRGIF_Pos )                    /*!< USIC_CH PSR: BRGIF Mask                 */

