FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* -----------------------------  USIC_CH_PSR_ASCMode  ---------------------------- */
    #define USIC_CH_PSR_ASCMode_TXIDLE_Pos     0                                                      /*!< USIC_CH PSR_ASCMode: TXIDLE Position    */
    #define USIC_CH_PSR_ASCMode_TXIDLE_Msk     ( 0x01UL << USIC_CH_PSR_ASCMode_TXIDLE_Pos )           /*!< USIC_CH PSR_ASCMode: TXIDLE Mask        */
    #define USIC_CH_PSR_ASCMode_RXIDLE_Pos     1                                                      /*!< USIC_CH PSR_ASCMode: RXIDLE Position    */
    #define USIC_CH_PSR_ASCMode_RXIDLE_Msk     ( 0x01UL << USIC_CH_PSR_ASCMode_RXIDLE_Pos )           /*!< USIC_CH PSR_ASCMode: RXIDLE Mask        */
    #define USIC_CH_PSR_ASCMode_SBD_Pos        2                                                      /*!< USIC_CH PSR_ASCMode: SBD Position       */
    #define USIC_CH_PSR_ASCMode_SBD_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_SBD_Pos )              /*!< USIC_CH PSR_ASCMode: SBD Mask           */
    #define USIC_CH_PSR_ASCMode_COL_Pos        3                                                      /*!< USIC_CH PSR_ASCMode: COL Position       */
    #define USIC_CH_PSR_ASCMode_COL_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_COL_Pos )              /*!< USIC_CH PSR_ASCMode: COL Mask           */
    #define USIC_CH_PSR_ASCMode_RNS_Pos        4                                                      /*!< USIC_CH PSR_ASCMode: RNS Position       */
    #define USIC_CH_PSR_ASCMode_RNS_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_RNS_Pos )              /*!< USIC_CH PSR_ASCMode: RNS Mask           */
    #define USIC_CH_PSR_ASCMode_FER0_Pos       5                                                      /*!< USIC_CH PSR_ASCMode: FER0 Position      */
    #define USIC_CH_PSR_ASCMode_FER0_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_FER0_Pos )             /*!< USIC_CH PSR_ASCMode: FER0 Mask          */
    #define USIC_CH_PSR_ASCMode_FER1_Pos       6                                                      /*!< USIC_CH PSR_ASCMode: FER1 Position      */
    #define USIC_CH_PSR_ASCMode_FER1_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_FER1_Pos )             /*!< USIC_CH PSR_ASCMode: FER1 Mask          */
    #define USIC_CH_PSR_ASCMode_RFF_Pos        7                                                      /*!< USIC_CH PSR_ASCMode: RFF Position       */
    #define USIC_CH_PSR_ASCMode_RFF_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_RFF_Pos )              /*!< USIC_CH PSR_ASCMode: RFF Mask           */
    #define USIC_CH_PSR_ASCMode_TFF_Pos        8                                                      /*!< USIC_CH PSR_ASCMode: TFF Position       */
    #define USIC_CH_PSR_ASCMode_TFF_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_TFF_Pos )              /*!< USIC_CH PSR_ASCMode: TFF Mask           */
    #define USIC_CH_PSR_ASCMode_BUSY_Pos       9                                                      /*!< USIC_CH PSR_ASCMode: BUSY Position      */
    #define USIC_CH_PSR_ASCMode_BUSY_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_BUSY_Pos )             /*!< USIC_CH PSR_ASCMode: BUSY Mask          */
    #define USIC_CH_PSR_ASCMode_RSIF_Pos       10                                                     /*!< USIC_CH PSR_ASCMode: RSIF Position      */
    #define USIC_CH_PSR_ASCMode_RSIF_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_RSIF_Pos )             /*!< USIC_CH PSR_ASCMode: RSIF Mask          */
    #define USIC_CH_PSR_ASCMode_DLIF_Pos       11                                                     /*!< USIC_CH PSR_ASCMode: DLIF Position      */
    #define USIC_CH_PSR_ASCMode_DLIF_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_DLIF_Pos )             /*!< USIC_CH PSR_ASCMode: DLIF Mask          */
    #define USIC_CH_PSR_ASCMode_TSIF_Pos       12                                                     /*!< USIC_CH PSR_ASCMode: TSIF Position      */
    #define USIC_CH_PSR_ASCMode_TSIF_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_TSIF_Pos )             /*!< USIC_CH PSR_ASCMode: TSIF Mask          */
    #define USIC_CH_PSR_ASCMode_TBIF_Pos       13                                                     /*!< USIC_CH PSR_ASCMode: TBIF Position      */
    #define USIC_CH_PSR_ASCMode_TBIF_Msk       ( 0x01UL << USIC_CH_PSR_ASCMode_TBIF_Pos )             /*!< USIC_CH PSR_ASCMode: TBIF Mask          */
    #define USIC_CH_PSR_ASCMode_RIF_Pos        14                                                     /*!< USIC_CH PSR_ASCMode: RIF Position       */
    #define USIC_CH_PSR_ASCMode_RIF_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_RIF_Pos )              /*!< USIC_CH PSR_ASCMode: RIF Mask           */
    #define USIC_CH_PSR_ASCMode_AIF_Pos        15                                                     /*!< USIC_CH PSR_ASCMode: AIF Position       */
    #define USIC_CH_PSR_ASCMode_AIF_Msk        ( 0x01UL << USIC_CH_PSR_ASCMode_AIF_Pos )              /*!< USIC_CH PSR_ASCMode: AIF Mask           */
    #define USIC_CH_PSR_ASCMode_BRGIF_Pos      16                                                     /*!< USIC_CH PSR_ASCMode: BRGIF Position     */
    #define USIC_CH_PSR_ASCMode_BRGIF_Msk      ( 0x01UL << USIC_CH_PSR_ASCMode_BRGIF_Pos )            /*!< USIC_CH PSR_ASCMode: BRGIF Mask         */

/* -----------------------------  USIC_CH_PSR_SSCMode  ---------------------------- */
    #define USIC_CH_PSR_SSCMode_MSLS_Pos       0                                                      /*!< USIC_CH PSR_SSCMode: MSLS Position      */
    #define USIC_CH_PSR_SSCMode_MSLS_Msk       ( 0x01UL << USIC_CH_PSR_SSCMode_MSLS_Pos )             /*!< USIC_CH PSR_SSCMode: MSLS Mask          */
    #define USIC_CH_PSR_SSCMode_DX2S_Pos       1                                                      /*!< USIC_CH PSR_SSCMode: DX2S Position      */
    #define USIC_CH_PSR_SSCMode_DX2S_Msk       ( 0x01UL << USIC_CH_PSR_SSCMode_DX2S_Pos )             /*!< USIC_CH PSR_SSCMode: DX2S Mask          */
    #define USIC_CH_PSR_SSCMode_MSLSEV_Pos     2                                                      /*!< USIC_CH PSR_SSCMode: MSLSEV Position    */
    #define USIC_CH_PSR_SSCMode_MSLSEV_Msk     ( 0x01UL << USIC_CH_PSR_SSCMode_MSLSEV_Pos )           /*!< USIC_CH PSR_SSCMode: MSLSEV Mask        */
    #define USIC_CH_PSR_SSCMode_DX2TEV_Pos     3                                                      /*!< USIC_CH PSR_SSCMode: DX2TEV Position    */
    #define USIC_CH_PSR_SSCMode_DX2TEV_Msk     ( 0x01UL << USIC_CH_PSR_SSCMode_DX2TEV_Pos )           /*!< USIC_CH PSR_SSCMode: DX2TEV Mask        */
    #define USIC_CH_PSR_SSCMode_PARERR_Pos     4                                                      /*!< USIC_CH PSR_SSCMode: PARERR Position    */
    #define USIC_CH_PSR_SSCMode_PARERR_Msk     ( 0x01UL << USIC_CH_PSR_SSCMode_PARERR_Pos )           /*!< USIC_CH PSR_SSCMode: PARERR Mask        */
    #define USIC_CH_PSR_SSCMode_RSIF_Pos       10                                                     /*!< USIC_CH PSR_SSCMode: RSIF Position      */
    #define USIC_CH_PSR_SSCMode_RSIF_Msk       ( 0x01UL << USIC_CH_PSR_SSCMode_RSIF_Pos )             /*!< USIC_CH PSR_SSCMode: RSIF Mask          */
    #define USIC_CH_PSR_SSCMode_DLIF_Pos       11                                                     /*!< USIC_CH PSR_SSCMode: DLIF Position      */
    #define USIC_CH_PSR_SSCMode_DLIF_Msk       ( 0x01UL << USIC_CH_PSR_SSCMode_DLIF_Pos )             /*!< USIC_CH PSR_SSCMode: DLIF Mask          */
    #define USIC_CH_PSR_SSCMode_TSIF_Pos       12                                                     /*!< USIC_CH PSR_SSCMode: TSIF Position      */
    #define USIC_CH_PSR_SSCMode_TSIF_Msk       ( 0x01UL << USIC_CH_PSR_SSCMode_TSIF_Pos )             /*!< USIC_CH PSR_SSCMode: TSIF Mask          */
    #define USIC_CH_PSR_SSCMode_TBIF_Pos       13                                                     /*!< USIC_CH PSR_SSCMode: TBIF Position      */
    #define USIC_CH_PSR_SSCMode_TBIF_Msk       ( 0x01UL << USIC_CH_PSR_SSCMode_TBIF_Pos )             /*!< USIC_CH PSR_SSCMode: TBIF Mask          */
    #define USIC_CH_PSR_SSCMode_RIF_Pos        14                                                     /*!< USIC_CH PSR_SSCMode: RIF Position       */
    #define USIC_CH_PSR_SSCMode_RIF_Msk        ( 0x01UL << USIC_CH_PSR_SSCMode_RIF_Pos )              /*!< USIC_CH PSR_SSCMode: RIF Mask           */
    #define USIC_CH_PSR_SSCMode_AIF_Pos        15                                                     /*!< USIC_CH PSR_SSCMode: AIF Position       */
    #define USIC_CH_PSR_SSCMode_AIF_Msk        ( 0x01UL << USIC_CH_PSR_SSCMode_AIF_Pos )              /*!< USIC_CH PSR_SSCMode: AIF Mask           */
    #define USIC_CH_PSR_SSCMode_BRGIF_Pos      16                                                     /*!< USIC_CH PSR_SSCMode: BRGIF Position     */
    #define USIC_CH_PSR_SSCMode_BRGIF_Msk      ( 0x01UL << USIC_CH_PSR_SSCMode_BRGIF_Pos )            /*!< USIC_CH PSR_SSCMode: BRGIF Mask         */

