FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* -----------------------------  USIC_CH_PSR_IICMode  ---------------------------- */
    #define USIC_CH_PSR_IICMode_SLSEL_Pos      0                                                      /*!< USIC_CH PSR_IICMode: SLSEL Position     */
    #define USIC_CH_PSR_IICMode_SLSEL_Msk      ( 0x01UL << USIC_CH_PSR_IICMode_SLSEL_Pos )            /*!< USIC_CH PSR_IICMode: SLSEL Mask         */
    #define USIC_CH_PSR_IICMode_WTDF_Pos       1                                                      /*!< USIC_CH PSR_IICMode: WTDF Position      */
    #define USIC_CH_PSR_IICMode_WTDF_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_WTDF_Pos )             /*!< USIC_CH PSR_IICMode: WTDF Mask          */
    #define USIC_CH_PSR_IICMode_SCR_Pos        2                                                      /*!< USIC_CH PSR_IICMode: SCR Position       */
    #define USIC_CH_PSR_IICMode_SCR_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_SCR_Pos )              /*!< USIC_CH PSR_IICMode: SCR Mask           */
    #define USIC_CH_PSR_IICMode_RSCR_Pos       3                                                      /*!< USIC_CH PSR_IICMode: RSCR Position      */
    #define USIC_CH_PSR_IICMode_RSCR_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_RSCR_Pos )             /*!< USIC_CH PSR_IICMode: RSCR Mask          */
    #define USIC_CH_PSR_IICMode_PCR_Pos        4                                                      /*!< USIC_CH PSR_IICMode: PCR Position       */
    #define USIC_CH_PSR_IICMode_PCR_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_PCR_Pos )              /*!< USIC_CH PSR_IICMode: PCR Mask           */
    #define USIC_CH_PSR_IICMode_NACK_Pos       5                                                      /*!< USIC_CH PSR_IICMode: NACK Position      */
    #define USIC_CH_PSR_IICMode_NACK_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_NACK_Pos )             /*!< USIC_CH PSR_IICMode: NACK Mask          */
    #define USIC_CH_PSR_IICMode_ARL_Pos        6                                                      /*!< USIC_CH PSR_IICMode: ARL Position       */
    #define USIC_CH_PSR_IICMode_ARL_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_ARL_Pos )              /*!< USIC_CH PSR_IICMode: ARL Mask           */
    #define USIC_CH_PSR_IICMode_SRR_Pos        7                                                      /*!< USIC_CH PSR_IICMode: SRR Position       */
    #define USIC_CH_PSR_IICMode_SRR_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_SRR_Pos )              /*!< USIC_CH PSR_IICMode: SRR Mask           */
    #define USIC_CH_PSR_IICMode_ERR_Pos        8                                                      /*!< USIC_CH PSR_IICMode: ERR Position       */
    #define USIC_CH_PSR_IICMode_ERR_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_ERR_Pos )              /*!< USIC_CH PSR_IICMode: ERR Mask           */
    #define USIC_CH_PSR_IICMode_ACK_Pos        9                                                      /*!< USIC_CH PSR_IICMode: ACK Position       */
    #define USIC_CH_PSR_IICMode_ACK_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_ACK_Pos )              /*!< USIC_CH PSR_IICMode: ACK Mask           */
    #define USIC_CH_PSR_IICMode_RSIF_Pos       10                                                     /*!< USIC_CH PSR_IICMode: RSIF Position      */
    #define USIC_CH_PSR_IICMode_RSIF_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_RSIF_Pos )             /*!< USIC_CH PSR_IICMode: RSIF Mask          */
    #define USIC_CH_PSR_IICMode_DLIF_Pos       11                                                     /*!< USIC_CH PSR_IICMode: DLIF Position      */
    #define USIC_CH_PSR_IICMode_DLIF_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_DLIF_Pos )             /*!< USIC_CH PSR_IICMode: DLIF Mask          */
    #define USIC_CH_PSR_IICMode_TSIF_Pos       12                                                     /*!< USIC_CH PSR_IICMode: TSIF Position      */
    #define USIC_CH_PSR_IICMode_TSIF_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_TSIF_Pos )             /*!< USIC_CH PSR_IICMode: TSIF Mask          */
    #define USIC_CH_PSR_IICMode_TBIF_Pos       13                                                     /*!< USIC_CH PSR_IICMode: TBIF Position      */
    #define USIC_CH_PSR_IICMode_TBIF_Msk       ( 0x01UL << USIC_CH_PSR_IICMode_TBIF_Pos )             /*!< USIC_CH PSR_IICMode: TBIF Mask          */
    #define USIC_CH_PSR_IICMode_RIF_Pos        14                                                     /*!< USIC_CH PSR_IICMode: RIF Position       */
    #define USIC_CH_PSR_IICMode_RIF_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_RIF_Pos )              /*!< USIC_CH PSR_IICMode: RIF Mask           */
    #define USIC_CH_PSR_IICMode_AIF_Pos        15                                                     /*!< USIC_CH PSR_IICMode: AIF Position       */
    #define USIC_CH_PSR_IICMode_AIF_Msk        ( 0x01UL << USIC_CH_PSR_IICMode_AIF_Pos )              /*!< USIC_CH PSR_IICMode: AIF Mask           */
    #define USIC_CH_PSR_IICMode_BRGIF_Pos      16                                                     /*!< USIC_CH PSR_IICMode: BRGIF Position     */
    #define USIC_CH_PSR_IICMode_BRGIF_Msk      ( 0x01UL << USIC_CH_PSR_IICMode_BRGIF_Pos )            /*!< USIC_CH PSR_IICMode: BRGIF Mask         */

/* -----------------------------  USIC_CH_PSR_IISMode  ---------------------------- */
    #define USIC_CH_PSR_IISMode_WA_Pos         0                                                      /*!< USIC_CH PSR_IISMode: WA Position        */
    #define USIC_CH_PSR_IISMode_WA_Msk         ( 0x01UL << USIC_CH_PSR_IISMode_WA_Pos )               /*!< USIC_CH PSR_IISMode: WA Mask            */
    #define USIC_CH_PSR_IISMode_DX2S_Pos       1                                                      /*!< USIC_CH PSR_IISMode: DX2S Position      */
    #define USIC_CH_PSR_IISMode_DX2S_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_DX2S_Pos )             /*!< USIC_CH PSR_IISMode: DX2S Mask          */
    #define USIC_CH_PSR_IISMode_DX2TEV_Pos     3                                                      /*!< USIC_CH PSR_IISMode: DX2TEV Position    */
    #define USIC_CH_PSR_IISMode_DX2TEV_Msk     ( 0x01UL << USIC_CH_PSR_IISMode_DX2TEV_Pos )           /*!< USIC_CH PSR_IISMode: DX2TEV Mask        */
    #define USIC_CH_PSR_IISMode_WAFE_Pos       4                                                      /*!< USIC_CH PSR_IISMode: WAFE Position      */
    #define USIC_CH_PSR_IISMode_WAFE_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_WAFE_Pos )             /*!< USIC_CH PSR_IISMode: WAFE Mask          */
    #define USIC_CH_PSR_IISMode_WARE_Pos       5                                                      /*!< USIC_CH PSR_IISMode: WARE Position      */
    #define USIC_CH_PSR_IISMode_WARE_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_WARE_Pos )             /*!< USIC_CH PSR_IISMode: WARE Mask          */
    #define USIC_CH_PSR_IISMode_END_Pos        6                                                      /*!< USIC_CH PSR_IISMode: END Position       */
    #define USIC_CH_PSR_IISMode_END_Msk        ( 0x01UL << USIC_CH_PSR_IISMode_END_Pos )              /*!< USIC_CH PSR_IISMode: END Mask           */
    #define USIC_CH_PSR_IISMode_RSIF_Pos       10                                                     /*!< USIC_CH PSR_IISMode: RSIF Position      */
    #define USIC_CH_PSR_IISMode_RSIF_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_RSIF_Pos )             /*!< USIC_CH PSR_IISMode: RSIF Mask          */
    #define USIC_CH_PSR_IISMode_DLIF_Pos       11                                                     /*!< USIC_CH PSR_IISMode: DLIF Position      */
    #define USIC_CH_PSR_IISMode_DLIF_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_DLIF_Pos )             /*!< USIC_CH PSR_IISMode: DLIF Mask          */
    #define USIC_CH_PSR_IISMode_TSIF_Pos       12                                                     /*!< USIC_CH PSR_IISMode: TSIF Position      */
    #define USIC_CH_PSR_IISMode_TSIF_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_TSIF_Pos )             /*!< USIC_CH PSR_IISMode: TSIF Mask          */
    #define USIC_CH_PSR_IISMode_TBIF_Pos       13                                                     /*!< USIC_CH PSR_IISMode: TBIF Position      */
    #define USIC_CH_PSR_IISMode_TBIF_Msk       ( 0x01UL << USIC_CH_PSR_IISMode_TBIF_Pos )             /*!< USIC_CH PSR_IISMode: TBIF Mask          */
    #define USIC_CH_PSR_IISMode_RIF_Pos        14                                                     /*!< USIC_CH PSR_IISMode: RIF Position       */
    #define USIC_CH_PSR_IISMode_RIF_Msk        ( 0x01UL << USIC_CH_PSR_IISMode_RIF_Pos )              /*!< USIC_CH PSR_IISMode: RIF Mask           */
    #define USIC_CH_PSR_IISMode_AIF_Pos        15                                                     /*!< USIC_CH PSR_IISMode: AIF Position       */
    #define USIC_CH_PSR_IISMode_AIF_Msk        ( 0x01UL << USIC_CH_PSR_IISMode_AIF_Pos )              /*!< USIC_CH PSR_IISMode: AIF Mask           */
    #define USIC_CH_PSR_IISMode_BRGIF_Pos      16                                                     /*!< USIC_CH PSR_IISMode: BRGIF Position     */
    #define USIC_CH_PSR_IISMode_BRGIF_Msk      ( 0x01UL << USIC_CH_PSR_IISMode_BRGIF_Pos )            /*!< USIC_CH PSR_IISMode: BRGIF Mask         */

/* --------------------------------  USIC_CH_PSCR  -------------------------------- */
    #define USIC_CH_PSCR_CST0_Pos              0                                                      /*!< USIC_CH PSCR: CST0 Position             */
    #define USIC_CH_PSCR_CST0_Msk              ( 0x01UL << USIC_CH_PSCR_CST0_Pos )                    /*!< USIC_CH PSCR: CST0 Mask                 */
    #define USIC_CH_PSCR_CST1_Pos              1                                                      /*!< USIC_CH PSCR: CST1 Position             */
    #define USIC_CH_PSCR_CST1_Msk              ( 0x01UL << USIC_CH_PSCR_CST1_Pos )                    /*!< USIC_CH PSCR: CST1 Mask                 */
    #define USIC_CH_PSCR_CST2_Pos              2                                                      /*!< USIC_CH PSCR: CST2 Position             */
    #define USIC_CH_PSCR_CST2_Msk              ( 0x01UL << USIC_CH_PSCR_CST2_Pos )                    /*!< USIC_CH PSCR: CST2 Mask                 */
    #define USIC_CH_PSCR_CST3_Pos              3                                                      /*!< USIC_CH PSCR: CST3 Position             */
    #define USIC_CH_PSCR_CST3_Msk              ( 0x01UL << USIC_CH_PSCR_CST3_Pos )                    /*!< USIC_CH PSCR: CST3 Mask                 */
    #define USIC_CH_PSCR_CST4_Pos              4                                                      /*!< USIC_CH PSCR: CST4 Position             */
    #define USIC_CH_PSCR_CST4_Msk              ( 0x01UL << USIC_CH_PSCR_CST4_Pos )                    /*!< USIC_CH PSCR: CST4 Mask                 */
    #define USIC_CH_PSCR_CST5_Pos              5                                                      /*!< USIC_CH PSCR: CST5 Position             */
    #define USIC_CH_PSCR_CST5_Msk              ( 0x01UL << USIC_CH_PSCR_CST5_Pos )                    /*!< USIC_CH PSCR: CST5 Mask                 */
    #define USIC_CH_PSCR_CST6_Pos              6                                                      /*!< USIC_CH PSCR: CST6 Position             */
    #define USIC_CH_PSCR_CST6_Msk              ( 0x01UL << USIC_CH_PSCR_CST6_Pos )                    /*!< USIC_CH PSCR: CST6 Mask                 */
    #define USIC_CH_PSCR_CST7_Pos              7                                                      /*!< USIC_CH PSCR: CST7 Position             */
    #define USIC_CH_PSCR_CST7_Msk              ( 0x01UL << USIC_CH_PSCR_CST7_Pos )                    /*!< USIC_CH PSCR: CST7 Mask                 */
    #define USIC_CH_PSCR_CST8_Pos              8                                                      /*!< USIC_CH PSCR: CST8 Position             */
    #define USIC_CH_PSCR_CST8_Msk              ( 0x01UL << USIC_CH_PSCR_CST8_Pos )                    /*!< USIC_CH PSCR: CST8 Mask                 */
    #define USIC_CH_PSCR_CST9_Pos              9                                                      /*!< USIC_CH PSCR: CST9 Position             */
    #define USIC_CH_PSCR_CST9_Msk              ( 0x01UL << USIC_CH_PSCR_CST9_Pos )                    /*!< USIC_CH PSCR: CST9 Mask                 */
    #define USIC_CH_PSCR_CRSIF_Pos             10                                                     /*!< USIC_CH PSCR: CRSIF Position            */
    #define USIC_CH_PSCR_CRSIF_Msk             ( 0x01UL << USIC_CH_PSCR_CRSIF_Pos )                   /*!< USIC_CH PSCR: CRSIF Mask                */
    #define USIC_CH_PSCR_CDLIF_Pos             11                                                     /*!< USIC_CH PSCR: CDLIF Position            */
    #define USIC_CH_PSCR_CDLIF_Msk             ( 0x01UL << USIC_CH_PSCR_CDLIF_Pos )                   /*!< USIC_CH PSCR: CDLIF Mask                */
    #define USIC_CH_PSCR_CTSIF_Pos             12                                                     /*!< USIC_CH PSCR: CTSIF Position            */
    #define USIC_CH_PSCR_CTSIF_Msk             ( 0x01UL << USIC_CH_PSCR_CTSIF_Pos )                   /*!< USIC_CH PSCR: CTSIF Mask                */
    #define USIC_CH_PSCR_CTBIF_Pos             13                                                     /*!< USIC_CH PSCR: CTBIF Position            */
    #define USIC_CH_PSCR_CTBIF_Msk             ( 0x01UL << USIC_CH_PSCR_CTBIF_Pos )                   /*!< USIC_CH PSCR: CTBIF Mask                */
    #define USIC_CH_PSCR_CRIF_Pos              14                                                     /*!< USIC_CH PSCR: CRIF Position             */
    #define USIC_CH_PSCR_CRIF_Msk              ( 0x01UL << USIC_CH_PSCR_CRIF_Pos )                    /*!< USIC_CH PSCR: CRIF Mask                 */
    #define USIC_CH_PSCR_CAIF_Pos              15                                                     /*!< USIC_CH PSCR: CAIF Position             */
    #define USIC_CH_PSCR_CAIF_Msk              ( 0x01UL << USIC_CH_PSCR_CAIF_Pos )                    /*!< USIC_CH PSCR: CAIF Mask                 */
    #define USIC_CH_PSCR_CBRGIF_Pos            16                                                     /*!< USIC_CH PSCR: CBRGIF Position           */
    #define USIC_CH_PSCR_CBRGIF_Msk            ( 0x01UL << USIC_CH_PSCR_CBRGIF_Pos )                  /*!< USIC_CH PSCR: CBRGIF Mask               */

/* -------------------------------  USIC_CH_RBUFSR  ------------------------------- */
    #define USIC_CH_RBUFSR_WLEN_Pos            0                                                      /*!< USIC_CH RBUFSR: WLEN Position           */
    #define USIC_CH_RBUFSR_WLEN_Msk            ( 0x0fUL << USIC_CH_RBUFSR_WLEN_Pos )                  /*!< USIC_CH RBUFSR: WLEN Mask               */
    #define USIC_CH_RBUFSR_SOF_Pos             6                                                      /*!< USIC_CH RBUFSR: SOF Position            */
    #define USIC_CH_RBUFSR_SOF_Msk             ( 0x01UL << USIC_CH_RBUFSR_SOF_Pos )                   /*!< USIC_CH RBUFSR: SOF Mask                */
    #define USIC_CH_RBUFSR_PAR_Pos             8                                                      /*!< USIC_CH RBUFSR: PAR Position            */
    #define USIC_CH_RBUFSR_PAR_Msk             ( 0x01UL << USIC_CH_RBUFSR_PAR_Pos )                   /*!< USIC_CH RBUFSR: PAR Mask                */
    #define USIC_CH_RBUFSR_PERR_Pos            9                                                      /*!< USIC_CH RBUFSR: PERR Position           */
    #define USIC_CH_RBUFSR_PERR_Msk            ( 0x01UL << USIC_CH_RBUFSR_PERR_Pos )                  /*!< USIC_CH RBUFSR: PERR Mask               */
    #define USIC_CH_RBUFSR_RDV0_Pos            13                                                     /*!< USIC_CH RBUFSR: RDV0 Position           */
    #define USIC_CH_RBUFSR_RDV0_Msk            ( 0x01UL << USIC_CH_RBUFSR_RDV0_Pos )                  /*!< USIC_CH RBUFSR: RDV0 Mask               */
    #define USIC_CH_RBUFSR_RDV1_Pos            14                                                     /*!< USIC_CH RBUFSR: RDV1 Position           */
    #define USIC_CH_RBUFSR_RDV1_Msk            ( 0x01UL << USIC_CH_RBUFSR_RDV1_Pos )                  /*!< USIC_CH RBUFSR: RDV1 Mask               */
    #define USIC_CH_RBUFSR_DS_Pos              15                                                     /*!< USIC_CH RBUFSR: DS Position             */
    #define USIC_CH_RBUFSR_DS_Msk              ( 0x01UL << USIC_CH_RBUFSR_DS_Pos )                    /*!< USIC_CH RBUFSR: DS Mask                 */

/* --------------------------------  USIC_CH_RBUF  -------------------------------- */
    #define USIC_CH_RBUF_DSR_Pos               0                                                      /*!< USIC_CH RBUF: DSR Position              */
    #define USIC_CH_RBUF_DSR_Msk               ( 0x0000ffffUL << USIC_CH_RBUF_DSR_Pos )               /*!< USIC_CH RBUF: DSR Mask                  */

