FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  USIC_CH_RBUFD  ------------------------------- */
    #define USIC_CH_RBUFD_DSR_Pos              0                                                      /*!< USIC_CH RBUFD: DSR Position             */
    #define USIC_CH_RBUFD_DSR_Msk              ( 0x0000ffffUL << USIC_CH_RBUFD_DSR_Pos )              /*!< USIC_CH RBUFD: DSR Mask                 */

/* --------------------------------  USIC_CH_RBUF0  ------------------------------- */
    #define USIC_CH_RBUF0_DSR0_Pos             0                                                      /*!< USIC_CH RBUF0: DSR0 Position            */
    #define USIC_CH_RBUF0_DSR0_Msk             ( 0x0000ffffUL << USIC_CH_RBUF0_DSR0_Pos )             /*!< USIC_CH RBUF0: DSR0 Mask                */

/* --------------------------------  USIC_CH_RBUF1  ------------------------------- */
    #define USIC_CH_RBUF1_DSR1_Pos             0                                                      /*!< USIC_CH RBUF1: DSR1 Position            */
    #define USIC_CH_RBUF1_DSR1_Msk             ( 0x0000ffffUL << USIC_CH_RBUF1_DSR1_Pos )             /*!< USIC_CH RBUF1: DSR1 Mask                */

/* ------------------------------  USIC_CH_RBUF01SR  ------------------------------ */
    #define USIC_CH_RBUF01SR_WLEN0_Pos         0                                                      /*!< USIC_CH RBUF01SR: WLEN0 Position        */
    #define USIC_CH_RBUF01SR_WLEN0_Msk         ( 0x0fUL << USIC_CH_RBUF01SR_WLEN0_Pos )               /*!< USIC_CH RBUF01SR: WLEN0 Mask            */
    #define USIC_CH_RBUF01SR_SOF0_Pos          6                                                      /*!< USIC_CH RBUF01SR: SOF0 Position         */
    #define USIC_CH_RBUF01SR_SOF0_Msk          ( 0x01UL << USIC_CH_RBUF01SR_SOF0_Pos )                /*!< USIC_CH RBUF01SR: SOF0 Mask             */
    #define USIC_CH_RBUF01SR_PAR0_Pos          8                                                      /*!< USIC_CH RBUF01SR: PAR0 Position         */
    #define USIC_CH_RBUF01SR_PAR0_Msk          ( 0x01UL << USIC_CH_RBUF01SR_PAR0_Pos )                /*!< USIC_CH RBUF01SR: PAR0 Mask             */
    #define USIC_CH_RBUF01SR_PERR0_Pos         9                                                      /*!< USIC_CH RBUF01SR: PERR0 Position        */
    #define USIC_CH_RBUF01SR_PERR0_Msk         ( 0x01UL << USIC_CH_RBUF01SR_PERR0_Pos )               /*!< USIC_CH RBUF01SR: PERR0 Mask            */
    #define USIC_CH_RBUF01SR_RDV00_Pos         13                                                     /*!< USIC_CH RBUF01SR: RDV00 Position        */
    #define USIC_CH_RBUF01SR_RDV00_Msk         ( 0x01UL << USIC_CH_RBUF01SR_RDV00_Pos )               /*!< USIC_CH RBUF01SR: RDV00 Mask            */
    #define USIC_CH_RBUF01SR_RDV01_Pos         14                                                     /*!< USIC_CH RBUF01SR: RDV01 Position        */
    #define USIC_CH_RBUF01SR_RDV01_Msk         ( 0x01UL << USIC_CH_RBUF01SR_RDV01_Pos )               /*!< USIC_CH RBUF01SR: RDV01 Mask            */
    #define USIC_CH_RBUF01SR_DS0_Pos           15                                                     /*!< USIC_CH RBUF01SR: DS0 Position          */
    #define USIC_CH_RBUF01SR_DS0_Msk           ( 0x01UL << USIC_CH_RBUF01SR_DS0_Pos )                 /*!< USIC_CH RBUF01SR: DS0 Mask              */
    #define USIC_CH_RBUF01SR_WLEN1_Pos         16                                                     /*!< USIC_CH RBUF01SR: WLEN1 Position        */
    #define USIC_CH_RBUF01SR_WLEN1_Msk         ( 0x0fUL << USIC_CH_RBUF01SR_WLEN1_Pos )               /*!< USIC_CH RBUF01SR: WLEN1 Mask            */
    #define USIC_CH_RBUF01SR_SOF1_Pos          22                                                     /*!< USIC_CH RBUF01SR: SOF1 Position         */
    #define USIC_CH_RBUF01SR_SOF1_Msk          ( 0x01UL << USIC_CH_RBUF01SR_SOF1_Pos )                /*!< USIC_CH RBUF01SR: SOF1 Mask             */
    #define USIC_CH_RBUF01SR_PAR1_Pos          24                                                     /*!< USIC_CH RBUF01SR: PAR1 Position         */
    #define USIC_CH_RBUF01SR_PAR1_Msk          ( 0x01UL << USIC_CH_RBUF01SR_PAR1_Pos )                /*!< USIC_CH RBUF01SR: PAR1 Mask             */
    #define USIC_CH_RBUF01SR_PERR1_Pos         25                                                     /*!< USIC_CH RBUF01SR: PERR1 Position        */
    #define USIC_CH_RBUF01SR_PERR1_Msk         ( 0x01UL << USIC_CH_RBUF01SR_PERR1_Pos )               /*!< USIC_CH RBUF01SR: PERR1 Mask            */
    #define USIC_CH_RBUF01SR_RDV10_Pos         29                                                     /*!< USIC_CH RBUF01SR: RDV10 Position        */
    #define USIC_CH_RBUF01SR_RDV10_Msk         ( 0x01UL << USIC_CH_RBUF01SR_RDV10_Pos )               /*!< USIC_CH RBUF01SR: RDV10 Mask            */
    #define USIC_CH_RBUF01SR_RDV11_Pos         30                                                     /*!< USIC_CH RBUF01SR: RDV11 Position        */
    #define USIC_CH_RBUF01SR_RDV11_Msk         ( 0x01UL << USIC_CH_RBUF01SR_RDV11_Pos )               /*!< USIC_CH RBUF01SR: RDV11 Mask            */
    #define USIC_CH_RBUF01SR_DS1_Pos           31                                                     /*!< USIC_CH RBUF01SR: DS1 Position          */
    #define USIC_CH_RBUF01SR_DS1_Msk           ( 0x01UL << USIC_CH_RBUF01SR_DS1_Pos )                 /*!< USIC_CH RBUF01SR: DS1 Mask              */

/* ---------------------------------  USIC_CH_FMR  -------------------------------- */
    #define USIC_CH_FMR_MTDV_Pos               0                                                      /*!< USIC_CH FMR: MTDV Position              */
    #define USIC_CH_FMR_MTDV_Msk               ( 0x03UL << USIC_CH_FMR_MTDV_Pos )                     /*!< USIC_CH FMR: MTDV Mask                  */
    #define USIC_CH_FMR_ATVC_Pos               4                                                      /*!< USIC_CH FMR: ATVC Position              */
    #define USIC_CH_FMR_ATVC_Msk               ( 0x01UL << USIC_CH_FMR_ATVC_Pos )                     /*!< USIC_CH FMR: ATVC Mask                  */
    #define USIC_CH_FMR_CRDV0_Pos              14                                                     /*!< USIC_CH FMR: CRDV0 Position             */
    #define USIC_CH_FMR_CRDV0_Msk              ( 0x01UL << USIC_CH_FMR_CRDV0_Pos )                    /*!< USIC_CH FMR: CRDV0 Mask                 */
    #define USIC_CH_FMR_CRDV1_Pos              15                                                     /*!< USIC_CH FMR: CRDV1 Position             */
    #define USIC_CH_FMR_CRDV1_Msk              ( 0x01UL << USIC_CH_FMR_CRDV1_Pos )                    /*!< USIC_CH FMR: CRDV1 Mask                 */
    #define USIC_CH_FMR_SIO0_Pos               16                                                     /*!< USIC_CH FMR: SIO0 Position              */
    #define USIC_CH_FMR_SIO0_Msk               ( 0x01UL << USIC_CH_FMR_SIO0_Pos )                     /*!< USIC_CH FMR: SIO0 Mask                  */
    #define USIC_CH_FMR_SIO1_Pos               17                                                     /*!< USIC_CH FMR: SIO1 Position              */
    #define USIC_CH_FMR_SIO1_Msk               ( 0x01UL << USIC_CH_FMR_SIO1_Pos )                     /*!< USIC_CH FMR: SIO1 Mask                  */
    #define USIC_CH_FMR_SIO2_Pos               18                                                     /*!< USIC_CH FMR: SIO2 Position              */
    #define USIC_CH_FMR_SIO2_Msk               ( 0x01UL << USIC_CH_FMR_SIO2_Pos )                     /*!< USIC_CH FMR: SIO2 Mask                  */
    #define USIC_CH_FMR_SIO3_Pos               19                                                     /*!< USIC_CH FMR: SIO3 Position              */
    #define USIC_CH_FMR_SIO3_Msk               ( 0x01UL << USIC_CH_FMR_SIO3_Pos )                     /*!< USIC_CH FMR: SIO3 Mask                  */
    #define USIC_CH_FMR_SIO4_Pos               20                                                     /*!< USIC_CH FMR: SIO4 Position              */
    #define USIC_CH_FMR_SIO4_Msk               ( 0x01UL << USIC_CH_FMR_SIO4_Pos )                     /*!< USIC_CH FMR: SIO4 Mask                  */
    #define USIC_CH_FMR_SIO5_Pos               21                                                     /*!< USIC_CH FMR: SIO5 Position              */
    #define USIC_CH_FMR_SIO5_Msk               ( 0x01UL << USIC_CH_FMR_SIO5_Pos )                     /*!< USIC_CH FMR: SIO5 Mask                  */

/* --------------------------------  USIC_CH_TBUF  -------------------------------- */
    #define USIC_CH_TBUF_TDATA_Pos             0                                                      /*!< USIC_CH TBUF: TDATA Position            */
    #define USIC_CH_TBUF_TDATA_Msk             ( 0x0000ffffUL << USIC_CH_TBUF_TDATA_Pos )             /*!< USIC_CH TBUF: TDATA Mask                */

/* ---------------------------------  USIC_CH_BYP  -------------------------------- */
    #define USIC_CH_BYP_BDATA_Pos              0                                                      /*!< USIC_CH BYP: BDATA Position             */
    #define USIC_CH_BYP_BDATA_Msk              ( 0x0000ffffUL << USIC_CH_BYP_BDATA_Pos )              /*!< USIC_CH BYP: BDATA Mask                 */

/* --------------------------------  USIC_CH_BYPCR  ------------------------------- */
    #define USIC_CH_BYPCR_BWLE_Pos             0                                                      /*!< USIC_CH BYPCR: BWLE Position            */
    #define USIC_CH_BYPCR_BWLE_Msk             ( 0x0fUL << USIC_CH_BYPCR_BWLE_Pos )                   /*!< USIC_CH BYPCR: BWLE Mask                */
    #define USIC_CH_BYPCR_BDSSM_Pos            8                                                      /*!< USIC_CH BYPCR: BDSSM Position           */
    #define USIC_CH_BYPCR_BDSSM_Msk            ( 0x01UL << USIC_CH_BYPCR_BDSSM_Pos )                  /*!< USIC_CH BYPCR: BDSSM Mask               */
    #define USIC_CH_BYPCR_BDEN_Pos             10                                                     /*!< USIC_CH BYPCR: BDEN Position            */
    #define USIC_CH_BYPCR_BDEN_Msk             ( 0x03UL << USIC_CH_BYPCR_BDEN_Pos )                   /*!< USIC_CH BYPCR: BDEN Mask                */
    #define USIC_CH_BYPCR_BDVTR_Pos            12                                                     /*!< USIC_CH BYPCR: BDVTR Position           */
    #define USIC_CH_BYPCR_BDVTR_Msk            ( 0x01UL << USIC_CH_BYPCR_BDVTR_Pos )                  /*!< USIC_CH BYPCR: BDVTR Mask               */
    #define USIC_CH_BYPCR_BPRIO_Pos            13                                                     /*!< USIC_CH BYPCR: BPRIO Position           */
    #define USIC_CH_BYPCR_BPRIO_Msk            ( 0x01UL << USIC_CH_BYPCR_BPRIO_Pos )                  /*!< USIC_CH BYPCR: BPRIO Mask               */
    #define USIC_CH_BYPCR_BDV_Pos              15                                                     /*!< USIC_CH BYPCR: BDV Position             */
    #define USIC_CH_BYPCR_BDV_Msk              ( 0x01UL << USIC_CH_BYPCR_BDV_Pos )                    /*!< USIC_CH BYPCR: BDV Mask                 */
    #define USIC_CH_BYPCR_BSELO_Pos            16                                                     /*!< USIC_CH BYPCR: BSELO Position           */
    #define USIC_CH_BYPCR_BSELO_Msk            ( 0x1fUL << USIC_CH_BYPCR_BSELO_Pos )                  /*!< USIC_CH BYPCR: BSELO Mask               */
    #define USIC_CH_BYPCR_BHPC_Pos             21                                                     /*!< USIC_CH BYPCR: BHPC Position            */
    #define USIC_CH_BYPCR_BHPC_Msk             ( 0x07UL << USIC_CH_BYPCR_BHPC_Pos )                   /*!< USIC_CH BYPCR: BHPC Mask                */

/* --------------------------------  USIC_CH_TBCTR  ------------------------------- */
    #define USIC_CH_TBCTR_DPTR_Pos             0                                                      /*!< USIC_CH TBCTR: DPTR Position            */
    #define USIC_CH_TBCTR_DPTR_Msk             ( 0x3fUL << USIC_CH_TBCTR_DPTR_Pos )                   /*!< USIC_CH TBCTR: DPTR Mask                */
    #define USIC_CH_TBCTR_LIMIT_Pos            8                                                      /*!< USIC_CH TBCTR: LIMIT Position           */
    #define USIC_CH_TBCTR_LIMIT_Msk            ( 0x3fUL << USIC_CH_TBCTR_LIMIT_Pos )                  /*!< USIC_CH TBCTR: LIMIT Mask               */
    #define USIC_CH_TBCTR_STBTM_Pos            14                                                     /*!< USIC_CH TBCTR: STBTM Position           */
    #define USIC_CH_TBCTR_STBTM_Msk            ( 0x01UL << USIC_CH_TBCTR_STBTM_Pos )                  /*!< USIC_CH TBCTR: STBTM Mask               */
    #define USIC_CH_TBCTR_STBTEN_Pos           15                                                     /*!< USIC_CH TBCTR: STBTEN Position          */
    #define USIC_CH_TBCTR_STBTEN_Msk           ( 0x01UL << USIC_CH_TBCTR_STBTEN_Pos )                 /*!< USIC_CH TBCTR: STBTEN Mask              */
    #define USIC_CH_TBCTR_STBINP_Pos           16                                                     /*!< USIC_CH TBCTR: STBINP Position          */
    #define USIC_CH_TBCTR_STBINP_Msk           ( 0x07UL << USIC_CH_TBCTR_STBINP_Pos )                 /*!< USIC_CH TBCTR: STBINP Mask              */
    #define USIC_CH_TBCTR_ATBINP_Pos           19                                                     /*!< USIC_CH TBCTR: ATBINP Position          */
    #define USIC_CH_TBCTR_ATBINP_Msk           ( 0x07UL << USIC_CH_TBCTR_ATBINP_Pos )                 /*!< USIC_CH TBCTR: ATBINP Mask              */
    #define USIC_CH_TBCTR_SIZE_Pos             24                                                     /*!< USIC_CH TBCTR: SIZE Position            */
    #define USIC_CH_TBCTR_SIZE_Msk             ( 0x07UL << USIC_CH_TBCTR_SIZE_Pos )                   /*!< USIC_CH TBCTR: SIZE Mask                */
    #define USIC_CH_TBCTR_LOF_Pos              28                                                     /*!< USIC_CH TBCTR: LOF Position             */
    #define USIC_CH_TBCTR_LOF_Msk              ( 0x01UL << USIC_CH_TBCTR_LOF_Pos )                    /*!< USIC_CH TBCTR: LOF Mask                 */
    #define USIC_CH_TBCTR_STBIEN_Pos           30                                                     /*!< USIC_CH TBCTR: STBIEN Position          */
    #define USIC_CH_TBCTR_STBIEN_Msk           ( 0x01UL << USIC_CH_TBCTR_STBIEN_Pos )                 /*!< USIC_CH TBCTR: STBIEN Mask              */
    #define USIC_CH_TBCTR_TBERIEN_Pos          31                                                     /*!< USIC_CH TBCTR: TBERIEN Position         */
    #define USIC_CH_TBCTR_TBERIEN_Msk          ( 0x01UL << USIC_CH_TBCTR_TBERIEN_Pos )                /*!< USIC_CH TBCTR: TBERIEN Mask             */

