FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  USIC_CH_RBCTR  ------------------------------- */
    #define USIC_CH_RBCTR_DPTR_Pos             0                                                      /*!< USIC_CH RBCTR: DPTR Position            */
    #define USIC_CH_RBCTR_DPTR_Msk             ( 0x3fUL << USIC_CH_RBCTR_DPTR_Pos )                   /*!< USIC_CH RBCTR: DPTR Mask                */
    #define USIC_CH_RBCTR_LIMIT_Pos            8                                                      /*!< USIC_CH RBCTR: LIMIT Position           */
    #define USIC_CH_RBCTR_LIMIT_Msk            ( 0x3fUL << USIC_CH_RBCTR_LIMIT_Pos )                  /*!< USIC_CH RBCTR: LIMIT Mask               */
    #define USIC_CH_RBCTR_SRBTM_Pos            14                                                     /*!< USIC_CH RBCTR: SRBTM Position           */
    #define USIC_CH_RBCTR_SRBTM_Msk            ( 0x01UL << USIC_CH_RBCTR_SRBTM_Pos )                  /*!< USIC_CH RBCTR: SRBTM Mask               */
    #define USIC_CH_RBCTR_SRBTEN_Pos           15                                                     /*!< USIC_CH RBCTR: SRBTEN Position          */
    #define USIC_CH_RBCTR_SRBTEN_Msk           ( 0x01UL << USIC_CH_RBCTR_SRBTEN_Pos )                 /*!< USIC_CH RBCTR: SRBTEN Mask              */
    #define USIC_CH_RBCTR_SRBINP_Pos           16                                                     /*!< USIC_CH RBCTR: SRBINP Position          */
    #define USIC_CH_RBCTR_SRBINP_Msk           ( 0x07UL << USIC_CH_RBCTR_SRBINP_Pos )                 /*!< USIC_CH RBCTR: SRBINP Mask              */
    #define USIC_CH_RBCTR_ARBINP_Pos           19                                                     /*!< USIC_CH RBCTR: ARBINP Position          */
    #define USIC_CH_RBCTR_ARBINP_Msk           ( 0x07UL << USIC_CH_RBCTR_ARBINP_Pos )                 /*!< USIC_CH RBCTR: ARBINP Mask              */
    #define USIC_CH_RBCTR_RCIM_Pos             22                                                     /*!< USIC_CH RBCTR: RCIM Position            */
    #define USIC_CH_RBCTR_RCIM_Msk             ( 0x03UL << USIC_CH_RBCTR_RCIM_Pos )                   /*!< USIC_CH RBCTR: RCIM Mask                */
    #define USIC_CH_RBCTR_SIZE_Pos             24                                                     /*!< USIC_CH RBCTR: SIZE Position            */
    #define USIC_CH_RBCTR_SIZE_Msk             ( 0x07UL << USIC_CH_RBCTR_SIZE_Pos )                   /*!< USIC_CH RBCTR: SIZE Mask                */
    #define USIC_CH_RBCTR_RNM_Pos              27                                                     /*!< USIC_CH RBCTR: RNM Position             */
    #define USIC_CH_RBCTR_RNM_Msk              ( 0x01UL << USIC_CH_RBCTR_RNM_Pos )                    /*!< USIC_CH RBCTR: RNM Mask                 */
    #define USIC_CH_RBCTR_LOF_Pos              28                                                     /*!< USIC_CH RBCTR: LOF Position             */
    #define USIC_CH_RBCTR_LOF_Msk              ( 0x01UL << USIC_CH_RBCTR_LOF_Pos )                    /*!< USIC_CH RBCTR: LOF Mask                 */
    #define USIC_CH_RBCTR_ARBIEN_Pos           29                                                     /*!< USIC_CH RBCTR: ARBIEN Position          */
    #define USIC_CH_RBCTR_ARBIEN_Msk           ( 0x01UL << USIC_CH_RBCTR_ARBIEN_Pos )                 /*!< USIC_CH RBCTR: ARBIEN Mask              */
    #define USIC_CH_RBCTR_SRBIEN_Pos           30                                                     /*!< USIC_CH RBCTR: SRBIEN Position          */
    #define USIC_CH_RBCTR_SRBIEN_Msk           ( 0x01UL << USIC_CH_RBCTR_SRBIEN_Pos )                 /*!< USIC_CH RBCTR: SRBIEN Mask              */
    #define USIC_CH_RBCTR_RBERIEN_Pos          31                                                     /*!< USIC_CH RBCTR: RBERIEN Position         */
    #define USIC_CH_RBCTR_RBERIEN_Msk          ( 0x01UL << USIC_CH_RBCTR_RBERIEN_Pos )                /*!< USIC_CH RBCTR: RBERIEN Mask             */

/* -------------------------------  USIC_CH_TRBPTR  ------------------------------- */
    #define USIC_CH_TRBPTR_TDIPTR_Pos          0                                                      /*!< USIC_CH TRBPTR: TDIPTR Position         */
    #define USIC_CH_TRBPTR_TDIPTR_Msk          ( 0x3fUL << USIC_CH_TRBPTR_TDIPTR_Pos )                /*!< USIC_CH TRBPTR: TDIPTR Mask             */
    #define USIC_CH_TRBPTR_TDOPTR_Pos          8                                                      /*!< USIC_CH TRBPTR: TDOPTR Position         */
    #define USIC_CH_TRBPTR_TDOPTR_Msk          ( 0x3fUL << USIC_CH_TRBPTR_TDOPTR_Pos )                /*!< USIC_CH TRBPTR: TDOPTR Mask             */
    #define USIC_CH_TRBPTR_RDIPTR_Pos          16                                                     /*!< USIC_CH TRBPTR: RDIPTR Position         */
    #define USIC_CH_TRBPTR_RDIPTR_Msk          ( 0x3fUL << USIC_CH_TRBPTR_RDIPTR_Pos )                /*!< USIC_CH TRBPTR: RDIPTR Mask             */
    #define USIC_CH_TRBPTR_RDOPTR_Pos          24                                                     /*!< USIC_CH TRBPTR: RDOPTR Position         */
    #define USIC_CH_TRBPTR_RDOPTR_Msk          ( 0x3fUL << USIC_CH_TRBPTR_RDOPTR_Pos )                /*!< USIC_CH TRBPTR: RDOPTR Mask             */

/* --------------------------------  USIC_CH_TRBSR  ------------------------------- */
    #define USIC_CH_TRBSR_SRBI_Pos             0                                                      /*!< USIC_CH TRBSR: SRBI Position            */
    #define USIC_CH_TRBSR_SRBI_Msk             ( 0x01UL << USIC_CH_TRBSR_SRBI_Pos )                   /*!< USIC_CH TRBSR: SRBI Mask                */
    #define USIC_CH_TRBSR_RBERI_Pos            1                                                      /*!< USIC_CH TRBSR: RBERI Position           */
    #define USIC_CH_TRBSR_RBERI_Msk            ( 0x01UL << USIC_CH_TRBSR_RBERI_Pos )                  /*!< USIC_CH TRBSR: RBERI Mask               */
    #define USIC_CH_TRBSR_ARBI_Pos             2                                                      /*!< USIC_CH TRBSR: ARBI Position            */
    #define USIC_CH_TRBSR_ARBI_Msk             ( 0x01UL << USIC_CH_TRBSR_ARBI_Pos )                   /*!< USIC_CH TRBSR: ARBI Mask                */
    #define USIC_CH_TRBSR_REMPTY_Pos           3                                                      /*!< USIC_CH TRBSR: REMPTY Position          */
    #define USIC_CH_TRBSR_REMPTY_Msk           ( 0x01UL << USIC_CH_TRBSR_REMPTY_Pos )                 /*!< USIC_CH TRBSR: REMPTY Mask              */
    #define USIC_CH_TRBSR_RFULL_Pos            4                                                      /*!< USIC_CH TRBSR: RFULL Position           */
    #define USIC_CH_TRBSR_RFULL_Msk            ( 0x01UL << USIC_CH_TRBSR_RFULL_Pos )                  /*!< USIC_CH TRBSR: RFULL Mask               */
    #define USIC_CH_TRBSR_RBUS_Pos             5                                                      /*!< USIC_CH TRBSR: RBUS Position            */
    #define USIC_CH_TRBSR_RBUS_Msk             ( 0x01UL << USIC_CH_TRBSR_RBUS_Pos )                   /*!< USIC_CH TRBSR: RBUS Mask                */
    #define USIC_CH_TRBSR_SRBT_Pos             6                                                      /*!< USIC_CH TRBSR: SRBT Position            */
    #define USIC_CH_TRBSR_SRBT_Msk             ( 0x01UL << USIC_CH_TRBSR_SRBT_Pos )                   /*!< USIC_CH TRBSR: SRBT Mask                */
    #define USIC_CH_TRBSR_STBI_Pos             8                                                      /*!< USIC_CH TRBSR: STBI Position            */
    #define USIC_CH_TRBSR_STBI_Msk             ( 0x01UL << USIC_CH_TRBSR_STBI_Pos )                   /*!< USIC_CH TRBSR: STBI Mask                */
    #define USIC_CH_TRBSR_TBERI_Pos            9                                                      /*!< USIC_CH TRBSR: TBERI Position           */
    #define USIC_CH_TRBSR_TBERI_Msk            ( 0x01UL << USIC_CH_TRBSR_TBERI_Pos )                  /*!< USIC_CH TRBSR: TBERI Mask               */
    #define USIC_CH_TRBSR_TEMPTY_Pos           11                                                     /*!< USIC_CH TRBSR: TEMPTY Position          */
    #define USIC_CH_TRBSR_TEMPTY_Msk           ( 0x01UL << USIC_CH_TRBSR_TEMPTY_Pos )                 /*!< USIC_CH TRBSR: TEMPTY Mask              */
    #define USIC_CH_TRBSR_TFULL_Pos            12                                                     /*!< USIC_CH TRBSR: TFULL Position           */
    #define USIC_CH_TRBSR_TFULL_Msk            ( 0x01UL << USIC_CH_TRBSR_TFULL_Pos )                  /*!< USIC_CH TRBSR: TFULL Mask               */
    #define USIC_CH_TRBSR_TBUS_Pos             13                                                     /*!< USIC_CH TRBSR: TBUS Position            */
    #define USIC_CH_TRBSR_TBUS_Msk             ( 0x01UL << USIC_CH_TRBSR_TBUS_Pos )                   /*!< USIC_CH TRBSR: TBUS Mask                */
    #define USIC_CH_TRBSR_STBT_Pos             14                                                     /*!< USIC_CH TRBSR: STBT Position            */
    #define USIC_CH_TRBSR_STBT_Msk             ( 0x01UL << USIC_CH_TRBSR_STBT_Pos )                   /*!< USIC_CH TRBSR: STBT Mask                */
    #define USIC_CH_TRBSR_RBFLVL_Pos           16                                                     /*!< USIC_CH TRBSR: RBFLVL Position          */
    #define USIC_CH_TRBSR_RBFLVL_Msk           ( 0x7fUL << USIC_CH_TRBSR_RBFLVL_Pos )                 /*!< USIC_CH TRBSR: RBFLVL Mask              */
    #define USIC_CH_TRBSR_TBFLVL_Pos           24                                                     /*!< USIC_CH TRBSR: TBFLVL Position          */
    #define USIC_CH_TRBSR_TBFLVL_Msk           ( 0x7fUL << USIC_CH_TRBSR_TBFLVL_Pos )                 /*!< USIC_CH TRBSR: TBFLVL Mask              */

/* -------------------------------  USIC_CH_TRBSCR  ------------------------------- */
    #define USIC_CH_TRBSCR_CSRBI_Pos           0                                                      /*!< USIC_CH TRBSCR: CSRBI Position          */
    #define USIC_CH_TRBSCR_CSRBI_Msk           ( 0x01UL << USIC_CH_TRBSCR_CSRBI_Pos )                 /*!< USIC_CH TRBSCR: CSRBI Mask              */
    #define USIC_CH_TRBSCR_CRBERI_Pos          1                                                      /*!< USIC_CH TRBSCR: CRBERI Position         */
    #define USIC_CH_TRBSCR_CRBERI_Msk          ( 0x01UL << USIC_CH_TRBSCR_CRBERI_Pos )                /*!< USIC_CH TRBSCR: CRBERI Mask             */
    #define USIC_CH_TRBSCR_CARBI_Pos           2                                                      /*!< USIC_CH TRBSCR: CARBI Position          */
    #define USIC_CH_TRBSCR_CARBI_Msk           ( 0x01UL << USIC_CH_TRBSCR_CARBI_Pos )                 /*!< USIC_CH TRBSCR: CARBI Mask              */
    #define USIC_CH_TRBSCR_CSTBI_Pos           8                                                      /*!< USIC_CH TRBSCR: CSTBI Position          */
    #define USIC_CH_TRBSCR_CSTBI_Msk           ( 0x01UL << USIC_CH_TRBSCR_CSTBI_Pos )                 /*!< USIC_CH TRBSCR: CSTBI Mask              */
    #define USIC_CH_TRBSCR_CTBERI_Pos          9                                                      /*!< USIC_CH TRBSCR: CTBERI Position         */
    #define USIC_CH_TRBSCR_CTBERI_Msk          ( 0x01UL << USIC_CH_TRBSCR_CTBERI_Pos )                /*!< USIC_CH TRBSCR: CTBERI Mask             */
    #define USIC_CH_TRBSCR_CBDV_Pos            10                                                     /*!< USIC_CH TRBSCR: CBDV Position           */
    #define USIC_CH_TRBSCR_CBDV_Msk            ( 0x01UL << USIC_CH_TRBSCR_CBDV_Pos )                  /*!< USIC_CH TRBSCR: CBDV Mask               */
    #define USIC_CH_TRBSCR_FLUSHRB_Pos         14                                                     /*!< USIC_CH TRBSCR: FLUSHRB Position        */
    #define USIC_CH_TRBSCR_FLUSHRB_Msk         ( 0x01UL << USIC_CH_TRBSCR_FLUSHRB_Pos )               /*!< USIC_CH TRBSCR: FLUSHRB Mask            */
    #define USIC_CH_TRBSCR_FLUSHTB_Pos         15                                                     /*!< USIC_CH TRBSCR: FLUSHTB Position        */
    #define USIC_CH_TRBSCR_FLUSHTB_Msk         ( 0x01UL << USIC_CH_TRBSCR_FLUSHTB_Pos )               /*!< USIC_CH TRBSCR: FLUSHTB Mask            */

/* --------------------------------  USIC_CH_OUTR  -------------------------------- */
    #define USIC_CH_OUTR_DSR_Pos               0                                                      /*!< USIC_CH OUTR: DSR Position              */
    #define USIC_CH_OUTR_DSR_Msk               ( 0x0000ffffUL << USIC_CH_OUTR_DSR_Pos )               /*!< USIC_CH OUTR: DSR Mask                  */
    #define USIC_CH_OUTR_RCI_Pos               16                                                     /*!< USIC_CH OUTR: RCI Position              */
    #define USIC_CH_OUTR_RCI_Msk               ( 0x1fUL << USIC_CH_OUTR_RCI_Pos )                     /*!< USIC_CH OUTR: RCI Mask                  */

/* --------------------------------  USIC_CH_OUTDR  ------------------------------- */
    #define USIC_CH_OUTDR_DSR_Pos              0                                                      /*!< USIC_CH OUTDR: DSR Position             */
    #define USIC_CH_OUTDR_DSR_Msk              ( 0x0000ffffUL << USIC_CH_OUTDR_DSR_Pos )              /*!< USIC_CH OUTDR: DSR Mask                 */
    #define USIC_CH_OUTDR_RCI_Pos              16                                                     /*!< USIC_CH OUTDR: RCI Position             */
    #define USIC_CH_OUTDR_RCI_Msk              ( 0x1fUL << USIC_CH_OUTDR_RCI_Pos )                    /*!< USIC_CH OUTDR: RCI Mask                 */

/* ---------------------------------  USIC_CH_IN  --------------------------------- */
    #define USIC_CH_IN_TDATA_Pos               0                                                      /*!< USIC_CH IN: TDATA Position              */
    #define USIC_CH_IN_TDATA_Msk               ( 0x0000ffffUL << USIC_CH_IN_TDATA_Pos )               /*!< USIC_CH IN: TDATA Mask                  */


/* ================================================================================ */
/* ================      struct 'SCU_GENERAL' Position & Mask      ================ */
/* ================================================================================ */


