FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* -----------------------------  SCU_INTERRUPT_SRMSK  ---------------------------- */
    #define SCU_INTERRUPT_SRMSK_PRWARN_Pos       0                                                    /*!< SCU_INTERRUPT SRMSK: PRWARN Position    */
    #define SCU_INTERRUPT_SRMSK_PRWARN_Msk       ( 0x01UL << SCU_INTERRUPT_SRMSK_PRWARN_Pos )         /*!< SCU_INTERRUPT SRMSK: PRWARN Mask        */
    #define SCU_INTERRUPT_SRMSK_VDDPI_Pos        3                                                    /*!< SCU_INTERRUPT SRMSK: VDDPI Position     */
    #define SCU_INTERRUPT_SRMSK_VDDPI_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_VDDPI_Pos )          /*!< SCU_INTERRUPT SRMSK: VDDPI Mask         */
    #define SCU_INTERRUPT_SRMSK_ACMP0I_Pos       4                                                    /*!< SCU_INTERRUPT SRMSK: ACMP0I Position    */
    #define SCU_INTERRUPT_SRMSK_ACMP0I_Msk       ( 0x01UL << SCU_INTERRUPT_SRMSK_ACMP0I_Pos )         /*!< SCU_INTERRUPT SRMSK: ACMP0I Mask        */
    #define SCU_INTERRUPT_SRMSK_ACMP1I_Pos       5                                                    /*!< SCU_INTERRUPT SRMSK: ACMP1I Position    */
    #define SCU_INTERRUPT_SRMSK_ACMP1I_Msk       ( 0x01UL << SCU_INTERRUPT_SRMSK_ACMP1I_Pos )         /*!< SCU_INTERRUPT SRMSK: ACMP1I Mask        */
    #define SCU_INTERRUPT_SRMSK_ACMP2I_Pos       6                                                    /*!< SCU_INTERRUPT SRMSK: ACMP2I Position    */
    #define SCU_INTERRUPT_SRMSK_ACMP2I_Msk       ( 0x01UL << SCU_INTERRUPT_SRMSK_ACMP2I_Pos )         /*!< SCU_INTERRUPT SRMSK: ACMP2I Mask        */
    #define SCU_INTERRUPT_SRMSK_VDROPI_Pos       7                                                    /*!< SCU_INTERRUPT SRMSK: VDROPI Position    */
    #define SCU_INTERRUPT_SRMSK_VDROPI_Msk       ( 0x01UL << SCU_INTERRUPT_SRMSK_VDROPI_Pos )         /*!< SCU_INTERRUPT SRMSK: VDROPI Mask        */
    #define SCU_INTERRUPT_SRMSK_ORC0I_Pos        8                                                    /*!< SCU_INTERRUPT SRMSK: ORC0I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC0I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC0I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC0I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC1I_Pos        9                                                    /*!< SCU_INTERRUPT SRMSK: ORC1I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC1I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC1I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC1I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC2I_Pos        10                                                   /*!< SCU_INTERRUPT SRMSK: ORC2I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC2I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC2I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC2I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC3I_Pos        11                                                   /*!< SCU_INTERRUPT SRMSK: ORC3I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC3I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC3I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC3I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC4I_Pos        12                                                   /*!< SCU_INTERRUPT SRMSK: ORC4I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC4I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC4I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC4I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC5I_Pos        13                                                   /*!< SCU_INTERRUPT SRMSK: ORC5I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC5I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC5I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC5I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC6I_Pos        14                                                   /*!< SCU_INTERRUPT SRMSK: ORC6I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC6I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC6I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC6I Mask         */
    #define SCU_INTERRUPT_SRMSK_ORC7I_Pos        15                                                   /*!< SCU_INTERRUPT SRMSK: ORC7I Position     */
    #define SCU_INTERRUPT_SRMSK_ORC7I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_ORC7I_Pos )          /*!< SCU_INTERRUPT SRMSK: ORC7I Mask         */
    #define SCU_INTERRUPT_SRMSK_LOCI_Pos         16                                                   /*!< SCU_INTERRUPT SRMSK: LOCI Position      */
    #define SCU_INTERRUPT_SRMSK_LOCI_Msk         ( 0x01UL << SCU_INTERRUPT_SRMSK_LOCI_Pos )           /*!< SCU_INTERRUPT SRMSK: LOCI Mask          */
    #define SCU_INTERRUPT_SRMSK_PESRAMI_Pos      17                                                   /*!< SCU_INTERRUPT SRMSK: PESRAMI Position   */
    #define SCU_INTERRUPT_SRMSK_PESRAMI_Msk      ( 0x01UL << SCU_INTERRUPT_SRMSK_PESRAMI_Pos )        /*!< SCU_INTERRUPT SRMSK: PESRAMI Mask       */
    #define SCU_INTERRUPT_SRMSK_PEU0I_Pos        18                                                   /*!< SCU_INTERRUPT SRMSK: PEU0I Position     */
    #define SCU_INTERRUPT_SRMSK_PEU0I_Msk        ( 0x01UL << SCU_INTERRUPT_SRMSK_PEU0I_Pos )          /*!< SCU_INTERRUPT SRMSK: PEU0I Mask         */
    #define SCU_INTERRUPT_SRMSK_FLECC2I_Pos      19                                                   /*!< SCU_INTERRUPT SRMSK: FLECC2I Position   */
    #define SCU_INTERRUPT_SRMSK_FLECC2I_Msk      ( 0x01UL << SCU_INTERRUPT_SRMSK_FLECC2I_Pos )        /*!< SCU_INTERRUPT SRMSK: FLECC2I Mask       */
    #define SCU_INTERRUPT_SRMSK_VCLIPI_Pos       21                                                   /*!< SCU_INTERRUPT SRMSK: VCLIPI Position    */
    #define SCU_INTERRUPT_SRMSK_VCLIPI_Msk       ( 0x01UL << SCU_INTERRUPT_SRMSK_VCLIPI_Pos )         /*!< SCU_INTERRUPT SRMSK: VCLIPI Mask        */
    #define SCU_INTERRUPT_SRMSK_SBYCLKFI_Pos     22                                                   /*!< SCU_INTERRUPT SRMSK: SBYCLKFI Position  */
    #define SCU_INTERRUPT_SRMSK_SBYCLKFI_Msk     ( 0x01UL << SCU_INTERRUPT_SRMSK_SBYCLKFI_Pos )       /*!< SCU_INTERRUPT SRMSK: SBYCLKFI Mask      */
    #define SCU_INTERRUPT_SRMSK_RTC_CTR_Pos      24                                                   /*!< SCU_INTERRUPT SRMSK: RTC_CTR Position   */
    #define SCU_INTERRUPT_SRMSK_RTC_CTR_Msk      ( 0x01UL << SCU_INTERRUPT_SRMSK_RTC_CTR_Pos )        /*!< SCU_INTERRUPT SRMSK: RTC_CTR Mask       */
    #define SCU_INTERRUPT_SRMSK_RTC_ATIM0_Pos    25                                                   /*!< SCU_INTERRUPT SRMSK: RTC_ATIM0 Position */
    #define SCU_INTERRUPT_SRMSK_RTC_ATIM0_Msk    ( 0x01UL << SCU_INTERRUPT_SRMSK_RTC_ATIM0_Pos )      /*!< SCU_INTERRUPT SRMSK: RTC_ATIM0 Mask     */
    #define SCU_INTERRUPT_SRMSK_RTC_ATIM1_Pos    26                                                   /*!< SCU_INTERRUPT SRMSK: RTC_ATIM1 Position */
    #define SCU_INTERRUPT_SRMSK_RTC_ATIM1_Msk    ( 0x01UL << SCU_INTERRUPT_SRMSK_RTC_ATIM1_Pos )      /*!< SCU_INTERRUPT SRMSK: RTC_ATIM1 Mask     */
    #define SCU_INTERRUPT_SRMSK_RTC_TIM0_Pos     27                                                   /*!< SCU_INTERRUPT SRMSK: RTC_TIM0 Position  */
    #define SCU_INTERRUPT_SRMSK_RTC_TIM0_Msk     ( 0x01UL << SCU_INTERRUPT_SRMSK_RTC_TIM0_Pos )       /*!< SCU_INTERRUPT SRMSK: RTC_TIM0 Mask      */
    #define SCU_INTERRUPT_SRMSK_RTC_TIM1_Pos     28                                                   /*!< SCU_INTERRUPT SRMSK: RTC_TIM1 Position  */
    #define SCU_INTERRUPT_SRMSK_RTC_TIM1_Msk     ( 0x01UL << SCU_INTERRUPT_SRMSK_RTC_TIM1_Pos )       /*!< SCU_INTERRUPT SRMSK: RTC_TIM1 Mask      */
    #define SCU_INTERRUPT_SRMSK_TSE_DONE_Pos     29                                                   /*!< SCU_INTERRUPT SRMSK: TSE_DONE Position  */
    #define SCU_INTERRUPT_SRMSK_TSE_DONE_Msk     ( 0x01UL << SCU_INTERRUPT_SRMSK_TSE_DONE_Pos )       /*!< SCU_INTERRUPT SRMSK: TSE_DONE Mask      */
    #define SCU_INTERRUPT_SRMSK_TSE_HIGH_Pos     30                                                   /*!< SCU_INTERRUPT SRMSK: TSE_HIGH Position  */
    #define SCU_INTERRUPT_SRMSK_TSE_HIGH_Msk     ( 0x01UL << SCU_INTERRUPT_SRMSK_TSE_HIGH_Pos )       /*!< SCU_INTERRUPT SRMSK: TSE_HIGH Mask      */
    #define SCU_INTERRUPT_SRMSK_TSE_LOW_Pos      31                                                   /*!< SCU_INTERRUPT SRMSK: TSE_LOW Position   */
    #define SCU_INTERRUPT_SRMSK_TSE_LOW_Msk      ( 0x01UL << SCU_INTERRUPT_SRMSK_TSE_LOW_Pos )        /*!< SCU_INTERRUPT SRMSK: TSE_LOW Mask       */

/* -----------------------------  SCU_INTERRUPT_SRCLR  ---------------------------- */
    #define SCU_INTERRUPT_SRCLR_PRWARN_Pos       0                                                    /*!< SCU_INTERRUPT SRCLR: PRWARN Position    */
    #define SCU_INTERRUPT_SRCLR_PRWARN_Msk       ( 0x01UL << SCU_INTERRUPT_SRCLR_PRWARN_Pos )         /*!< SCU_INTERRUPT SRCLR: PRWARN Mask        */
    #define SCU_INTERRUPT_SRCLR_PI_Pos           1                                                    /*!< SCU_INTERRUPT SRCLR: PI Position        */
    #define SCU_INTERRUPT_SRCLR_PI_Msk           ( 0x01UL << SCU_INTERRUPT_SRCLR_PI_Pos )             /*!< SCU_INTERRUPT SRCLR: PI Mask            */
    #define SCU_INTERRUPT_SRCLR_AI_Pos           2                                                    /*!< SCU_INTERRUPT SRCLR: AI Position        */
    #define SCU_INTERRUPT_SRCLR_AI_Msk           ( 0x01UL << SCU_INTERRUPT_SRCLR_AI_Pos )             /*!< SCU_INTERRUPT SRCLR: AI Mask            */
    #define SCU_INTERRUPT_SRCLR_VDDPI_Pos        3                                                    /*!< SCU_INTERRUPT SRCLR: VDDPI Position     */
    #define SCU_INTERRUPT_SRCLR_VDDPI_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_VDDPI_Pos )          /*!< SCU_INTERRUPT SRCLR: VDDPI Mask         */
    #define SCU_INTERRUPT_SRCLR_ACMP0I_Pos       4                                                    /*!< SCU_INTERRUPT SRCLR: ACMP0I Position    */
    #define SCU_INTERRUPT_SRCLR_ACMP0I_Msk       ( 0x01UL << SCU_INTERRUPT_SRCLR_ACMP0I_Pos )         /*!< SCU_INTERRUPT SRCLR: ACMP0I Mask        */
    #define SCU_INTERRUPT_SRCLR_ACMP1I_Pos       5                                                    /*!< SCU_INTERRUPT SRCLR: ACMP1I Position    */
    #define SCU_INTERRUPT_SRCLR_ACMP1I_Msk       ( 0x01UL << SCU_INTERRUPT_SRCLR_ACMP1I_Pos )         /*!< SCU_INTERRUPT SRCLR: ACMP1I Mask        */
    #define SCU_INTERRUPT_SRCLR_ACMP2I_Pos       6                                                    /*!< SCU_INTERRUPT SRCLR: ACMP2I Position    */
    #define SCU_INTERRUPT_SRCLR_ACMP2I_Msk       ( 0x01UL << SCU_INTERRUPT_SRCLR_ACMP2I_Pos )         /*!< SCU_INTERRUPT SRCLR: ACMP2I Mask        */
    #define SCU_INTERRUPT_SRCLR_VDROPI_Pos       7                                                    /*!< SCU_INTERRUPT SRCLR: VDROPI Position    */
    #define SCU_INTERRUPT_SRCLR_VDROPI_Msk       ( 0x01UL << SCU_INTERRUPT_SRCLR_VDROPI_Pos )         /*!< SCU_INTERRUPT SRCLR: VDROPI Mask        */
    #define SCU_INTERRUPT_SRCLR_ORC0I_Pos        8                                                    /*!< SCU_INTERRUPT SRCLR: ORC0I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC0I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC0I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC0I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC1I_Pos        9                                                    /*!< SCU_INTERRUPT SRCLR: ORC1I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC1I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC1I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC1I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC2I_Pos        10                                                   /*!< SCU_INTERRUPT SRCLR: ORC2I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC2I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC2I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC2I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC3I_Pos        11                                                   /*!< SCU_INTERRUPT SRCLR: ORC3I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC3I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC3I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC3I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC4I_Pos        12                                                   /*!< SCU_INTERRUPT SRCLR: ORC4I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC4I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC4I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC4I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC5I_Pos        13                                                   /*!< SCU_INTERRUPT SRCLR: ORC5I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC5I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC5I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC5I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC6I_Pos        14                                                   /*!< SCU_INTERRUPT SRCLR: ORC6I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC6I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC6I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC6I Mask         */
    #define SCU_INTERRUPT_SRCLR_ORC7I_Pos        15                                                   /*!< SCU_INTERRUPT SRCLR: ORC7I Position     */
    #define SCU_INTERRUPT_SRCLR_ORC7I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_ORC7I_Pos )          /*!< SCU_INTERRUPT SRCLR: ORC7I Mask         */
    #define SCU_INTERRUPT_SRCLR_LOCI_Pos         16                                                   /*!< SCU_INTERRUPT SRCLR: LOCI Position      */
    #define SCU_INTERRUPT_SRCLR_LOCI_Msk         ( 0x01UL << SCU_INTERRUPT_SRCLR_LOCI_Pos )           /*!< SCU_INTERRUPT SRCLR: LOCI Mask          */
    #define SCU_INTERRUPT_SRCLR_PESRAMI_Pos      17                                                   /*!< SCU_INTERRUPT SRCLR: PESRAMI Position   */
    #define SCU_INTERRUPT_SRCLR_PESRAMI_Msk      ( 0x01UL << SCU_INTERRUPT_SRCLR_PESRAMI_Pos )        /*!< SCU_INTERRUPT SRCLR: PESRAMI Mask       */
    #define SCU_INTERRUPT_SRCLR_PEU0I_Pos        18                                                   /*!< SCU_INTERRUPT SRCLR: PEU0I Position     */
    #define SCU_INTERRUPT_SRCLR_PEU0I_Msk        ( 0x01UL << SCU_INTERRUPT_SRCLR_PEU0I_Pos )          /*!< SCU_INTERRUPT SRCLR: PEU0I Mask         */
    #define SCU_INTERRUPT_SRCLR_FLECC2I_Pos      19                                                   /*!< SCU_INTERRUPT SRCLR: FLECC2I Position   */
    #define SCU_INTERRUPT_SRCLR_FLECC2I_Msk      ( 0x01UL << SCU_INTERRUPT_SRCLR_FLECC2I_Pos )        /*!< SCU_INTERRUPT SRCLR: FLECC2I Mask       */
    #define SCU_INTERRUPT_SRCLR_FLCMPLTI_Pos     20                                                   /*!< SCU_INTERRUPT SRCLR: FLCMPLTI Position  */
    #define SCU_INTERRUPT_SRCLR_FLCMPLTI_Msk     ( 0x01UL << SCU_INTERRUPT_SRCLR_FLCMPLTI_Pos )       /*!< SCU_INTERRUPT SRCLR: FLCMPLTI Mask      */
    #define SCU_INTERRUPT_SRCLR_VCLIPI_Pos       21                                                   /*!< SCU_INTERRUPT SRCLR: VCLIPI Position    */
    #define SCU_INTERRUPT_SRCLR_VCLIPI_Msk       ( 0x01UL << SCU_INTERRUPT_SRCLR_VCLIPI_Pos )         /*!< SCU_INTERRUPT SRCLR: VCLIPI Mask        */
    #define SCU_INTERRUPT_SRCLR_SBYCLKFI_Pos     22                                                   /*!< SCU_INTERRUPT SRCLR: SBYCLKFI Position  */
    #define SCU_INTERRUPT_SRCLR_SBYCLKFI_Msk     ( 0x01UL << SCU_INTERRUPT_SRCLR_SBYCLKFI_Pos )       /*!< SCU_INTERRUPT SRCLR: SBYCLKFI Mask      */
    #define SCU_INTERRUPT_SRCLR_RTC_CTR_Pos      24                                                   /*!< SCU_INTERRUPT SRCLR: RTC_CTR Position   */
    #define SCU_INTERRUPT_SRCLR_RTC_CTR_Msk      ( 0x01UL << SCU_INTERRUPT_SRCLR_RTC_CTR_Pos )        /*!< SCU_INTERRUPT SRCLR: RTC_CTR Mask       */
    #define SCU_INTERRUPT_SRCLR_RTC_ATIM0_Pos    25                                                   /*!< SCU_INTERRUPT SRCLR: RTC_ATIM0 Position */
    #define SCU_INTERRUPT_SRCLR_RTC_ATIM0_Msk    ( 0x01UL << SCU_INTERRUPT_SRCLR_RTC_ATIM0_Pos )      /*!< SCU_INTERRUPT SRCLR: RTC_ATIM0 Mask     */
    #define SCU_INTERRUPT_SRCLR_RTC_ATIM1_Pos    26                                                   /*!< SCU_INTERRUPT SRCLR: RTC_ATIM1 Position */
    #define SCU_INTERRUPT_SRCLR_RTC_ATIM1_Msk    ( 0x01UL << SCU_INTERRUPT_SRCLR_RTC_ATIM1_Pos )      /*!< SCU_INTERRUPT SRCLR: RTC_ATIM1 Mask     */
    #define SCU_INTERRUPT_SRCLR_RTC_TIM0_Pos     27                                                   /*!< SCU_INTERRUPT SRCLR: RTC_TIM0 Position  */
    #define SCU_INTERRUPT_SRCLR_RTC_TIM0_Msk     ( 0x01UL << SCU_INTERRUPT_SRCLR_RTC_TIM0_Pos )       /*!< SCU_INTERRUPT SRCLR: RTC_TIM0 Mask      */
    #define SCU_INTERRUPT_SRCLR_RTC_TIM1_Pos     28                                                   /*!< SCU_INTERRUPT SRCLR: RTC_TIM1 Position  */
    #define SCU_INTERRUPT_SRCLR_RTC_TIM1_Msk     ( 0x01UL << SCU_INTERRUPT_SRCLR_RTC_TIM1_Pos )       /*!< SCU_INTERRUPT SRCLR: RTC_TIM1 Mask      */
    #define SCU_INTERRUPT_SRCLR_TSE_DONE_Pos     29                                                   /*!< SCU_INTERRUPT SRCLR: TSE_DONE Position  */
    #define SCU_INTERRUPT_SRCLR_TSE_DONE_Msk     ( 0x01UL << SCU_INTERRUPT_SRCLR_TSE_DONE_Pos )       /*!< SCU_INTERRUPT SRCLR: TSE_DONE Mask      */
    #define SCU_INTERRUPT_SRCLR_TSE_HIGH_Pos     30                                                   /*!< SCU_INTERRUPT SRCLR: TSE_HIGH Position  */
    #define SCU_INTERRUPT_SRCLR_TSE_HIGH_Msk     ( 0x01UL << SCU_INTERRUPT_SRCLR_TSE_HIGH_Pos )       /*!< SCU_INTERRUPT SRCLR: TSE_HIGH Mask      */
    #define SCU_INTERRUPT_SRCLR_TSE_LOW_Pos      31                                                   /*!< SCU_INTERRUPT SRCLR: TSE_LOW Position   */
    #define SCU_INTERRUPT_SRCLR_TSE_LOW_Msk      ( 0x01UL << SCU_INTERRUPT_SRCLR_TSE_LOW_Pos )        /*!< SCU_INTERRUPT SRCLR: TSE_LOW Mask       */

