FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  CCU4_GCSC  --------------------------------- */
    #define CCU4_GCSC_S0SC_Pos       0                                                                /*!< CCU4 GCSC: S0SC Position                */
    #define CCU4_GCSC_S0SC_Msk       ( 0x01UL << CCU4_GCSC_S0SC_Pos )                                 /*!< CCU4 GCSC: S0SC Mask                    */
    #define CCU4_GCSC_S0DSC_Pos      1                                                                /*!< CCU4 GCSC: S0DSC Position               */
    #define CCU4_GCSC_S0DSC_Msk      ( 0x01UL << CCU4_GCSC_S0DSC_Pos )                                /*!< CCU4 GCSC: S0DSC Mask                   */
    #define CCU4_GCSC_S0PSC_Pos      2                                                                /*!< CCU4 GCSC: S0PSC Position               */
    #define CCU4_GCSC_S0PSC_Msk      ( 0x01UL << CCU4_GCSC_S0PSC_Pos )                                /*!< CCU4 GCSC: S0PSC Mask                   */
    #define CCU4_GCSC_S1SC_Pos       4                                                                /*!< CCU4 GCSC: S1SC Position                */
    #define CCU4_GCSC_S1SC_Msk       ( 0x01UL << CCU4_GCSC_S1SC_Pos )                                 /*!< CCU4 GCSC: S1SC Mask                    */
    #define CCU4_GCSC_S1DSC_Pos      5                                                                /*!< CCU4 GCSC: S1DSC Position               */
    #define CCU4_GCSC_S1DSC_Msk      ( 0x01UL << CCU4_GCSC_S1DSC_Pos )                                /*!< CCU4 GCSC: S1DSC Mask                   */
    #define CCU4_GCSC_S1PSC_Pos      6                                                                /*!< CCU4 GCSC: S1PSC Position               */
    #define CCU4_GCSC_S1PSC_Msk      ( 0x01UL << CCU4_GCSC_S1PSC_Pos )                                /*!< CCU4 GCSC: S1PSC Mask                   */
    #define CCU4_GCSC_S2SC_Pos       8                                                                /*!< CCU4 GCSC: S2SC Position                */
    #define CCU4_GCSC_S2SC_Msk       ( 0x01UL << CCU4_GCSC_S2SC_Pos )                                 /*!< CCU4 GCSC: S2SC Mask                    */
    #define CCU4_GCSC_S2DSC_Pos      9                                                                /*!< CCU4 GCSC: S2DSC Position               */
    #define CCU4_GCSC_S2DSC_Msk      ( 0x01UL << CCU4_GCSC_S2DSC_Pos )                                /*!< CCU4 GCSC: S2DSC Mask                   */
    #define CCU4_GCSC_S2PSC_Pos      10                                                               /*!< CCU4 GCSC: S2PSC Position               */
    #define CCU4_GCSC_S2PSC_Msk      ( 0x01UL << CCU4_GCSC_S2PSC_Pos )                                /*!< CCU4 GCSC: S2PSC Mask                   */
    #define CCU4_GCSC_S3SC_Pos       12                                                               /*!< CCU4 GCSC: S3SC Position                */
    #define CCU4_GCSC_S3SC_Msk       ( 0x01UL << CCU4_GCSC_S3SC_Pos )                                 /*!< CCU4 GCSC: S3SC Mask                    */
    #define CCU4_GCSC_S3DSC_Pos      13                                                               /*!< CCU4 GCSC: S3DSC Position               */
    #define CCU4_GCSC_S3DSC_Msk      ( 0x01UL << CCU4_GCSC_S3DSC_Pos )                                /*!< CCU4 GCSC: S3DSC Mask                   */
    #define CCU4_GCSC_S3PSC_Pos      14                                                               /*!< CCU4 GCSC: S3PSC Position               */
    #define CCU4_GCSC_S3PSC_Msk      ( 0x01UL << CCU4_GCSC_S3PSC_Pos )                                /*!< CCU4 GCSC: S3PSC Mask                   */
    #define CCU4_GCSC_S0STC_Pos      16                                                               /*!< CCU4 GCSC: S0STC Position               */
    #define CCU4_GCSC_S0STC_Msk      ( 0x01UL << CCU4_GCSC_S0STC_Pos )                                /*!< CCU4 GCSC: S0STC Mask                   */
    #define CCU4_GCSC_S1STC_Pos      17                                                               /*!< CCU4 GCSC: S1STC Position               */
    #define CCU4_GCSC_S1STC_Msk      ( 0x01UL << CCU4_GCSC_S1STC_Pos )                                /*!< CCU4 GCSC: S1STC Mask                   */
    #define CCU4_GCSC_S2STC_Pos      18                                                               /*!< CCU4 GCSC: S2STC Position               */
    #define CCU4_GCSC_S2STC_Msk      ( 0x01UL << CCU4_GCSC_S2STC_Pos )                                /*!< CCU4 GCSC: S2STC Mask                   */
    #define CCU4_GCSC_S3STC_Pos      19                                                               /*!< CCU4 GCSC: S3STC Position               */
    #define CCU4_GCSC_S3STC_Msk      ( 0x01UL << CCU4_GCSC_S3STC_Pos )                                /*!< CCU4 GCSC: S3STC Mask                   */

/* ----------------------------------  CCU4_GCST  --------------------------------- */
    #define CCU4_GCST_S0SS_Pos       0                                                                /*!< CCU4 GCST: S0SS Position                */
    #define CCU4_GCST_S0SS_Msk       ( 0x01UL << CCU4_GCST_S0SS_Pos )                                 /*!< CCU4 GCST: S0SS Mask                    */
    #define CCU4_GCST_S0DSS_Pos      1                                                                /*!< CCU4 GCST: S0DSS Position               */
    #define CCU4_GCST_S0DSS_Msk      ( 0x01UL << CCU4_GCST_S0DSS_Pos )                                /*!< CCU4 GCST: S0DSS Mask                   */
    #define CCU4_GCST_S0PSS_Pos      2                                                                /*!< CCU4 GCST: S0PSS Position               */
    #define CCU4_GCST_S0PSS_Msk      ( 0x01UL << CCU4_GCST_S0PSS_Pos )                                /*!< CCU4 GCST: S0PSS Mask                   */
    #define CCU4_GCST_S1SS_Pos       4                                                                /*!< CCU4 GCST: S1SS Position                */
    #define CCU4_GCST_S1SS_Msk       ( 0x01UL << CCU4_GCST_S1SS_Pos )                                 /*!< CCU4 GCST: S1SS Mask                    */
    #define CCU4_GCST_S1DSS_Pos      5                                                                /*!< CCU4 GCST: S1DSS Position               */
    #define CCU4_GCST_S1DSS_Msk      ( 0x01UL << CCU4_GCST_S1DSS_Pos )                                /*!< CCU4 GCST: S1DSS Mask                   */
    #define CCU4_GCST_S1PSS_Pos      6                                                                /*!< CCU4 GCST: S1PSS Position               */
    #define CCU4_GCST_S1PSS_Msk      ( 0x01UL << CCU4_GCST_S1PSS_Pos )                                /*!< CCU4 GCST: S1PSS Mask                   */
    #define CCU4_GCST_S2SS_Pos       8                                                                /*!< CCU4 GCST: S2SS Position                */
    #define CCU4_GCST_S2SS_Msk       ( 0x01UL << CCU4_GCST_S2SS_Pos )                                 /*!< CCU4 GCST: S2SS Mask                    */
    #define CCU4_GCST_S2DSS_Pos      9                                                                /*!< CCU4 GCST: S2DSS Position               */
    #define CCU4_GCST_S2DSS_Msk      ( 0x01UL << CCU4_GCST_S2DSS_Pos )                                /*!< CCU4 GCST: S2DSS Mask                   */
    #define CCU4_GCST_S2PSS_Pos      10                                                               /*!< CCU4 GCST: S2PSS Position               */
    #define CCU4_GCST_S2PSS_Msk      ( 0x01UL << CCU4_GCST_S2PSS_Pos )                                /*!< CCU4 GCST: S2PSS Mask                   */
    #define CCU4_GCST_S3SS_Pos       12                                                               /*!< CCU4 GCST: S3SS Position                */
    #define CCU4_GCST_S3SS_Msk       ( 0x01UL << CCU4_GCST_S3SS_Pos )                                 /*!< CCU4 GCST: S3SS Mask                    */
    #define CCU4_GCST_S3DSS_Pos      13                                                               /*!< CCU4 GCST: S3DSS Position               */
    #define CCU4_GCST_S3DSS_Msk      ( 0x01UL << CCU4_GCST_S3DSS_Pos )                                /*!< CCU4 GCST: S3DSS Mask                   */
    #define CCU4_GCST_S3PSS_Pos      14                                                               /*!< CCU4 GCST: S3PSS Position               */
    #define CCU4_GCST_S3PSS_Msk      ( 0x01UL << CCU4_GCST_S3PSS_Pos )                                /*!< CCU4 GCST: S3PSS Mask                   */
    #define CCU4_GCST_CC40ST_Pos     16                                                               /*!< CCU4 GCST: CC40ST Position              */
    #define CCU4_GCST_CC40ST_Msk     ( 0x01UL << CCU4_GCST_CC40ST_Pos )                               /*!< CCU4 GCST: CC40ST Mask                  */
    #define CCU4_GCST_CC41ST_Pos     17                                                               /*!< CCU4 GCST: CC41ST Position              */
    #define CCU4_GCST_CC41ST_Msk     ( 0x01UL << CCU4_GCST_CC41ST_Pos )                               /*!< CCU4 GCST: CC41ST Mask                  */
    #define CCU4_GCST_CC42ST_Pos     18                                                               /*!< CCU4 GCST: CC42ST Position              */
    #define CCU4_GCST_CC42ST_Msk     ( 0x01UL << CCU4_GCST_CC42ST_Pos )                               /*!< CCU4 GCST: CC42ST Mask                  */
    #define CCU4_GCST_CC43ST_Pos     19                                                               /*!< CCU4 GCST: CC43ST Position              */
    #define CCU4_GCST_CC43ST_Msk     ( 0x01UL << CCU4_GCST_CC43ST_Pos )                               /*!< CCU4 GCST: CC43ST Mask                  */

