FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  CCU4_MIDR  --------------------------------- */
    #define CCU4_MIDR_MODR_Pos       0                                                                /*!< CCU4 MIDR: MODR Position                */
    #define CCU4_MIDR_MODR_Msk       ( 0x000000ffUL << CCU4_MIDR_MODR_Pos )                           /*!< CCU4 MIDR: MODR Mask                    */
    #define CCU4_MIDR_MODT_Pos       8                                                                /*!< CCU4 MIDR: MODT Position                */
    #define CCU4_MIDR_MODT_Msk       ( 0x000000ffUL << CCU4_MIDR_MODT_Pos )                           /*!< CCU4 MIDR: MODT Mask                    */
    #define CCU4_MIDR_MODN_Pos       16                                                               /*!< CCU4 MIDR: MODN Position                */
    #define CCU4_MIDR_MODN_Msk       ( 0x0000ffffUL << CCU4_MIDR_MODN_Pos )                           /*!< CCU4 MIDR: MODN Mask                    */


/* ================================================================================ */
/* ================        Group 'CCU4_CC4' Position & Mask        ================ */
/* ================================================================================ */


/* --------------------------------  CCU4_CC4_INS  -------------------------------- */
    #define CCU4_CC4_INS_EV0IS_Pos     0                                                              /*!< CCU4_CC4 INS: EV0IS Position            */
    #define CCU4_CC4_INS_EV0IS_Msk     ( 0x0fUL << CCU4_CC4_INS_EV0IS_Pos )                           /*!< CCU4_CC4 INS: EV0IS Mask                */
    #define CCU4_CC4_INS_EV1IS_Pos     4                                                              /*!< CCU4_CC4 INS: EV1IS Position            */
    #define CCU4_CC4_INS_EV1IS_Msk     ( 0x0fUL << CCU4_CC4_INS_EV1IS_Pos )                           /*!< CCU4_CC4 INS: EV1IS Mask                */
    #define CCU4_CC4_INS_EV2IS_Pos     8                                                              /*!< CCU4_CC4 INS: EV2IS Position            */
    #define CCU4_CC4_INS_EV2IS_Msk     ( 0x0fUL << CCU4_CC4_INS_EV2IS_Pos )                           /*!< CCU4_CC4 INS: EV2IS Mask                */
    #define CCU4_CC4_INS_EV0EM_Pos     16                                                             /*!< CCU4_CC4 INS: EV0EM Position            */
    #define CCU4_CC4_INS_EV0EM_Msk     ( 0x03UL << CCU4_CC4_INS_EV0EM_Pos )                           /*!< CCU4_CC4 INS: EV0EM Mask                */
    #define CCU4_CC4_INS_EV1EM_Pos     18                                                             /*!< CCU4_CC4 INS: EV1EM Position            */
    #define CCU4_CC4_INS_EV1EM_Msk     ( 0x03UL << CCU4_CC4_INS_EV1EM_Pos )                           /*!< CCU4_CC4 INS: EV1EM Mask                */
    #define CCU4_CC4_INS_EV2EM_Pos     20                                                             /*!< CCU4_CC4 INS: EV2EM Position            */
    #define CCU4_CC4_INS_EV2EM_Msk     ( 0x03UL << CCU4_CC4_INS_EV2EM_Pos )                           /*!< CCU4_CC4 INS: EV2EM Mask                */
    #define CCU4_CC4_INS_EV0LM_Pos     22                                                             /*!< CCU4_CC4 INS: EV0LM Position            */
    #define CCU4_CC4_INS_EV0LM_Msk     ( 0x01UL << CCU4_CC4_INS_EV0LM_Pos )                           /*!< CCU4_CC4 INS: EV0LM Mask                */
    #define CCU4_CC4_INS_EV1LM_Pos     23                                                             /*!< CCU4_CC4 INS: EV1LM Position            */
    #define CCU4_CC4_INS_EV1LM_Msk     ( 0x01UL << CCU4_CC4_INS_EV1LM_Pos )                           /*!< CCU4_CC4 INS: EV1LM Mask                */
    #define CCU4_CC4_INS_EV2LM_Pos     24                                                             /*!< CCU4_CC4 INS: EV2LM Position            */
    #define CCU4_CC4_INS_EV2LM_Msk     ( 0x01UL << CCU4_CC4_INS_EV2LM_Pos )                           /*!< CCU4_CC4 INS: EV2LM Mask                */
    #define CCU4_CC4_INS_LPF0M_Pos     25                                                             /*!< CCU4_CC4 INS: LPF0M Position            */
    #define CCU4_CC4_INS_LPF0M_Msk     ( 0x03UL << CCU4_CC4_INS_LPF0M_Pos )                           /*!< CCU4_CC4 INS: LPF0M Mask                */
    #define CCU4_CC4_INS_LPF1M_Pos     27                                                             /*!< CCU4_CC4 INS: LPF1M Position            */
    #define CCU4_CC4_INS_LPF1M_Msk     ( 0x03UL << CCU4_CC4_INS_LPF1M_Pos )                           /*!< CCU4_CC4 INS: LPF1M Mask                */
    #define CCU4_CC4_INS_LPF2M_Pos     29                                                             /*!< CCU4_CC4 INS: LPF2M Position            */
    #define CCU4_CC4_INS_LPF2M_Msk     ( 0x03UL << CCU4_CC4_INS_LPF2M_Pos )                           /*!< CCU4_CC4 INS: LPF2M Mask                */

/* --------------------------------  CCU4_CC4_CMC  -------------------------------- */
    #define CCU4_CC4_CMC_STRTS_Pos     0                                                              /*!< CCU4_CC4 CMC: STRTS Position            */
    #define CCU4_CC4_CMC_STRTS_Msk     ( 0x03UL << CCU4_CC4_CMC_STRTS_Pos )                           /*!< CCU4_CC4 CMC: STRTS Mask                */
    #define CCU4_CC4_CMC_ENDS_Pos      2                                                              /*!< CCU4_CC4 CMC: ENDS Position             */
    #define CCU4_CC4_CMC_ENDS_Msk      ( 0x03UL << CCU4_CC4_CMC_ENDS_Pos )                            /*!< CCU4_CC4 CMC: ENDS Mask                 */
    #define CCU4_CC4_CMC_CAP0S_Pos     4                                                              /*!< CCU4_CC4 CMC: CAP0S Position            */
    #define CCU4_CC4_CMC_CAP0S_Msk     ( 0x03UL << CCU4_CC4_CMC_CAP0S_Pos )                           /*!< CCU4_CC4 CMC: CAP0S Mask                */
    #define CCU4_CC4_CMC_CAP1S_Pos     6                                                              /*!< CCU4_CC4 CMC: CAP1S Position            */
    #define CCU4_CC4_CMC_CAP1S_Msk     ( 0x03UL << CCU4_CC4_CMC_CAP1S_Pos )                           /*!< CCU4_CC4 CMC: CAP1S Mask                */
    #define CCU4_CC4_CMC_GATES_Pos     8                                                              /*!< CCU4_CC4 CMC: GATES Position            */
    #define CCU4_CC4_CMC_GATES_Msk     ( 0x03UL << CCU4_CC4_CMC_GATES_Pos )                           /*!< CCU4_CC4 CMC: GATES Mask                */
    #define CCU4_CC4_CMC_UDS_Pos       10                                                             /*!< CCU4_CC4 CMC: UDS Position              */
    #define CCU4_CC4_CMC_UDS_Msk       ( 0x03UL << CCU4_CC4_CMC_UDS_Pos )                             /*!< CCU4_CC4 CMC: UDS Mask                  */
    #define CCU4_CC4_CMC_LDS_Pos       12                                                             /*!< CCU4_CC4 CMC: LDS Position              */
    #define CCU4_CC4_CMC_LDS_Msk       ( 0x03UL << CCU4_CC4_CMC_LDS_Pos )                             /*!< CCU4_CC4 CMC: LDS Mask                  */
    #define CCU4_CC4_CMC_CNTS_Pos      14                                                             /*!< CCU4_CC4 CMC: CNTS Position             */
    #define CCU4_CC4_CMC_CNTS_Msk      ( 0x03UL << CCU4_CC4_CMC_CNTS_Pos )                            /*!< CCU4_CC4 CMC: CNTS Mask                 */
    #define CCU4_CC4_CMC_OFS_Pos       16                                                             /*!< CCU4_CC4 CMC: OFS Position              */
    #define CCU4_CC4_CMC_OFS_Msk       ( 0x01UL << CCU4_CC4_CMC_OFS_Pos )                             /*!< CCU4_CC4 CMC: OFS Mask                  */
    #define CCU4_CC4_CMC_TS_Pos        17                                                             /*!< CCU4_CC4 CMC: TS Position               */
    #define CCU4_CC4_CMC_TS_Msk        ( 0x01UL << CCU4_CC4_CMC_TS_Pos )                              /*!< CCU4_CC4 CMC: TS Mask                   */
    #define CCU4_CC4_CMC_MOS_Pos       18                                                             /*!< CCU4_CC4 CMC: MOS Position              */
    #define CCU4_CC4_CMC_MOS_Msk       ( 0x03UL << CCU4_CC4_CMC_MOS_Pos )                             /*!< CCU4_CC4 CMC: MOS Mask                  */
    #define CCU4_CC4_CMC_TCE_Pos       20                                                             /*!< CCU4_CC4 CMC: TCE Position              */
    #define CCU4_CC4_CMC_TCE_Msk       ( 0x01UL << CCU4_CC4_CMC_TCE_Pos )                             /*!< CCU4_CC4 CMC: TCE Mask                  */

