FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  CCU4_CC4_TCST  ------------------------------- */
    #define CCU4_CC4_TCST_TRB_Pos      0                                                              /*!< CCU4_CC4 TCST: TRB Position             */
    #define CCU4_CC4_TCST_TRB_Msk      ( 0x01UL << CCU4_CC4_TCST_TRB_Pos )                            /*!< CCU4_CC4 TCST: TRB Mask                 */
    #define CCU4_CC4_TCST_CDIR_Pos     1                                                              /*!< CCU4_CC4 TCST: CDIR Position            */
    #define CCU4_CC4_TCST_CDIR_Msk     ( 0x01UL << CCU4_CC4_TCST_CDIR_Pos )                           /*!< CCU4_CC4 TCST: CDIR Mask                */

/* -------------------------------  CCU4_CC4_TCSET  ------------------------------- */
    #define CCU4_CC4_TCSET_TRBS_Pos    0                                                              /*!< CCU4_CC4 TCSET: TRBS Position           */
    #define CCU4_CC4_TCSET_TRBS_Msk    ( 0x01UL << CCU4_CC4_TCSET_TRBS_Pos )                          /*!< CCU4_CC4 TCSET: TRBS Mask               */

/* -------------------------------  CCU4_CC4_TCCLR  ------------------------------- */
    #define CCU4_CC4_TCCLR_TRBC_Pos    0                                                              /*!< CCU4_CC4 TCCLR: TRBC Position           */
    #define CCU4_CC4_TCCLR_TRBC_Msk    ( 0x01UL << CCU4_CC4_TCCLR_TRBC_Pos )                          /*!< CCU4_CC4 TCCLR: TRBC Mask               */
    #define CCU4_CC4_TCCLR_TCC_Pos     1                                                              /*!< CCU4_CC4 TCCLR: TCC Position            */
    #define CCU4_CC4_TCCLR_TCC_Msk     ( 0x01UL << CCU4_CC4_TCCLR_TCC_Pos )                           /*!< CCU4_CC4 TCCLR: TCC Mask                */
    #define CCU4_CC4_TCCLR_DITC_Pos    2                                                              /*!< CCU4_CC4 TCCLR: DITC Position           */
    #define CCU4_CC4_TCCLR_DITC_Msk    ( 0x01UL << CCU4_CC4_TCCLR_DITC_Pos )                          /*!< CCU4_CC4 TCCLR: DITC Mask               */

/* ---------------------------------  CCU4_CC4_TC  -------------------------------- */
    #define CCU4_CC4_TC_TCM_Pos        0                                                              /*!< CCU4_CC4 TC: TCM Position               */
    #define CCU4_CC4_TC_TCM_Msk        ( 0x01UL << CCU4_CC4_TC_TCM_Pos )                              /*!< CCU4_CC4 TC: TCM Mask                   */
    #define CCU4_CC4_TC_TSSM_Pos       1                                                              /*!< CCU4_CC4 TC: TSSM Position              */
    #define CCU4_CC4_TC_TSSM_Msk       ( 0x01UL << CCU4_CC4_TC_TSSM_Pos )                             /*!< CCU4_CC4 TC: TSSM Mask                  */
    #define CCU4_CC4_TC_CLST_Pos       2                                                              /*!< CCU4_CC4 TC: CLST Position              */
    #define CCU4_CC4_TC_CLST_Msk       ( 0x01UL << CCU4_CC4_TC_CLST_Pos )                             /*!< CCU4_CC4 TC: CLST Mask                  */
    #define CCU4_CC4_TC_CMOD_Pos       3                                                              /*!< CCU4_CC4 TC: CMOD Position              */
    #define CCU4_CC4_TC_CMOD_Msk       ( 0x01UL << CCU4_CC4_TC_CMOD_Pos )                             /*!< CCU4_CC4 TC: CMOD Mask                  */
    #define CCU4_CC4_TC_ECM_Pos        4                                                              /*!< CCU4_CC4 TC: ECM Position               */
    #define CCU4_CC4_TC_ECM_Msk        ( 0x01UL << CCU4_CC4_TC_ECM_Pos )                              /*!< CCU4_CC4 TC: ECM Mask                   */
    #define CCU4_CC4_TC_CAPC_Pos       5                                                              /*!< CCU4_CC4 TC: CAPC Position              */
    #define CCU4_CC4_TC_CAPC_Msk       ( 0x03UL << CCU4_CC4_TC_CAPC_Pos )                             /*!< CCU4_CC4 TC: CAPC Mask                  */
    #define CCU4_CC4_TC_ENDM_Pos       8                                                              /*!< CCU4_CC4 TC: ENDM Position              */
    #define CCU4_CC4_TC_ENDM_Msk       ( 0x03UL << CCU4_CC4_TC_ENDM_Pos )                             /*!< CCU4_CC4 TC: ENDM Mask                  */
    #define CCU4_CC4_TC_STRM_Pos       10                                                             /*!< CCU4_CC4 TC: STRM Position              */
    #define CCU4_CC4_TC_STRM_Msk       ( 0x01UL << CCU4_CC4_TC_STRM_Pos )                             /*!< CCU4_CC4 TC: STRM Mask                  */
    #define CCU4_CC4_TC_SCE_Pos        11                                                             /*!< CCU4_CC4 TC: SCE Position               */
    #define CCU4_CC4_TC_SCE_Msk        ( 0x01UL << CCU4_CC4_TC_SCE_Pos )                              /*!< CCU4_CC4 TC: SCE Mask                   */
    #define CCU4_CC4_TC_CCS_Pos        12                                                             /*!< CCU4_CC4 TC: CCS Position               */
    #define CCU4_CC4_TC_CCS_Msk        ( 0x01UL << CCU4_CC4_TC_CCS_Pos )                              /*!< CCU4_CC4 TC: CCS Mask                   */
    #define CCU4_CC4_TC_DITHE_Pos      13                                                             /*!< CCU4_CC4 TC: DITHE Position             */
    #define CCU4_CC4_TC_DITHE_Msk      ( 0x03UL << CCU4_CC4_TC_DITHE_Pos )                            /*!< CCU4_CC4 TC: DITHE Mask                 */
    #define CCU4_CC4_TC_DIM_Pos        15                                                             /*!< CCU4_CC4 TC: DIM Position               */
    #define CCU4_CC4_TC_DIM_Msk        ( 0x01UL << CCU4_CC4_TC_DIM_Pos )                              /*!< CCU4_CC4 TC: DIM Mask                   */
    #define CCU4_CC4_TC_FPE_Pos        16                                                             /*!< CCU4_CC4 TC: FPE Position               */
    #define CCU4_CC4_TC_FPE_Msk        ( 0x01UL << CCU4_CC4_TC_FPE_Pos )                              /*!< CCU4_CC4 TC: FPE Mask                   */
    #define CCU4_CC4_TC_TRAPE_Pos      17                                                             /*!< CCU4_CC4 TC: TRAPE Position             */
    #define CCU4_CC4_TC_TRAPE_Msk      ( 0x01UL << CCU4_CC4_TC_TRAPE_Pos )                            /*!< CCU4_CC4 TC: TRAPE Mask                 */
    #define CCU4_CC4_TC_TRPSE_Pos      21                                                             /*!< CCU4_CC4 TC: TRPSE Position             */
    #define CCU4_CC4_TC_TRPSE_Msk      ( 0x01UL << CCU4_CC4_TC_TRPSE_Pos )                            /*!< CCU4_CC4 TC: TRPSE Mask                 */
    #define CCU4_CC4_TC_TRPSW_Pos      22                                                             /*!< CCU4_CC4 TC: TRPSW Position             */
    #define CCU4_CC4_TC_TRPSW_Msk      ( 0x01UL << CCU4_CC4_TC_TRPSW_Pos )                            /*!< CCU4_CC4 TC: TRPSW Mask                 */
    #define CCU4_CC4_TC_EMS_Pos        23                                                             /*!< CCU4_CC4 TC: EMS Position               */
    #define CCU4_CC4_TC_EMS_Msk        ( 0x01UL << CCU4_CC4_TC_EMS_Pos )                              /*!< CCU4_CC4 TC: EMS Mask                   */
    #define CCU4_CC4_TC_EMT_Pos        24                                                             /*!< CCU4_CC4 TC: EMT Position               */
    #define CCU4_CC4_TC_EMT_Msk        ( 0x01UL << CCU4_CC4_TC_EMT_Pos )                              /*!< CCU4_CC4 TC: EMT Mask                   */
    #define CCU4_CC4_TC_MCME_Pos       25                                                             /*!< CCU4_CC4 TC: MCME Position              */
    #define CCU4_CC4_TC_MCME_Msk       ( 0x01UL << CCU4_CC4_TC_MCME_Pos )                             /*!< CCU4_CC4 TC: MCME Mask                  */

