FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  CCU4_CC4_PSL  -------------------------------- */
    #define CCU4_CC4_PSL_PSL_Pos       0                                                              /*!< CCU4_CC4 PSL: PSL Position              */
    #define CCU4_CC4_PSL_PSL_Msk       ( 0x01UL << CCU4_CC4_PSL_PSL_Pos )                             /*!< CCU4_CC4 PSL: PSL Mask                  */

/* --------------------------------  CCU4_CC4_DIT  -------------------------------- */
    #define CCU4_CC4_DIT_DCV_Pos       0                                                              /*!< CCU4_CC4 DIT: DCV Position              */
    #define CCU4_CC4_DIT_DCV_Msk       ( 0x0fUL << CCU4_CC4_DIT_DCV_Pos )                             /*!< CCU4_CC4 DIT: DCV Mask                  */
    #define CCU4_CC4_DIT_DCNT_Pos      8                                                              /*!< CCU4_CC4 DIT: DCNT Position             */
    #define CCU4_CC4_DIT_DCNT_Msk      ( 0x0fUL << CCU4_CC4_DIT_DCNT_Pos )                            /*!< CCU4_CC4 DIT: DCNT Mask                 */

/* --------------------------------  CCU4_CC4_DITS  ------------------------------- */
    #define CCU4_CC4_DITS_DCVS_Pos     0                                                              /*!< CCU4_CC4 DITS: DCVS Position            */
    #define CCU4_CC4_DITS_DCVS_Msk     ( 0x0fUL << CCU4_CC4_DITS_DCVS_Pos )                           /*!< CCU4_CC4 DITS: DCVS Mask                */

/* --------------------------------  CCU4_CC4_PSC  -------------------------------- */
    #define CCU4_CC4_PSC_PSIV_Pos      0                                                              /*!< CCU4_CC4 PSC: PSIV Position             */
    #define CCU4_CC4_PSC_PSIV_Msk      ( 0x0fUL << CCU4_CC4_PSC_PSIV_Pos )                            /*!< CCU4_CC4 PSC: PSIV Mask                 */

/* --------------------------------  CCU4_CC4_FPC  -------------------------------- */
    #define CCU4_CC4_FPC_PCMP_Pos      0                                                              /*!< CCU4_CC4 FPC: PCMP Position             */
    #define CCU4_CC4_FPC_PCMP_Msk      ( 0x0fUL << CCU4_CC4_FPC_PCMP_Pos )                            /*!< CCU4_CC4 FPC: PCMP Mask                 */
    #define CCU4_CC4_FPC_PVAL_Pos      8                                                              /*!< CCU4_CC4 FPC: PVAL Position             */
    #define CCU4_CC4_FPC_PVAL_Msk      ( 0x0fUL << CCU4_CC4_FPC_PVAL_Pos )                            /*!< CCU4_CC4 FPC: PVAL Mask                 */

/* --------------------------------  CCU4_CC4_FPCS  ------------------------------- */
    #define CCU4_CC4_FPCS_PCMP_Pos     0                                                              /*!< CCU4_CC4 FPCS: PCMP Position            */
    #define CCU4_CC4_FPCS_PCMP_Msk     ( 0x0fUL << CCU4_CC4_FPCS_PCMP_Pos )                           /*!< CCU4_CC4 FPCS: PCMP Mask                */

/* ---------------------------------  CCU4_CC4_PR  -------------------------------- */
    #define CCU4_CC4_PR_PR_Pos         0                                                              /*!< CCU4_CC4 PR: PR Position                */
    #define CCU4_CC4_PR_PR_Msk         ( 0x0000ffffUL << CCU4_CC4_PR_PR_Pos )                         /*!< CCU4_CC4 PR: PR Mask                    */

/* --------------------------------  CCU4_CC4_PRS  -------------------------------- */
    #define CCU4_CC4_PRS_PRS_Pos       0                                                              /*!< CCU4_CC4 PRS: PRS Position              */
    #define CCU4_CC4_PRS_PRS_Msk       ( 0x0000ffffUL << CCU4_CC4_PRS_PRS_Pos )                       /*!< CCU4_CC4 PRS: PRS Mask                  */

/* ---------------------------------  CCU4_CC4_CR  -------------------------------- */
    #define CCU4_CC4_CR_CR_Pos         0                                                              /*!< CCU4_CC4 CR: CR Position                */
    #define CCU4_CC4_CR_CR_Msk         ( 0x0000ffffUL << CCU4_CC4_CR_CR_Pos )                         /*!< CCU4_CC4 CR: CR Mask                    */

/* --------------------------------  CCU4_CC4_CRS  -------------------------------- */
    #define CCU4_CC4_CRS_CRS_Pos       0                                                              /*!< CCU4_CC4 CRS: CRS Position              */
    #define CCU4_CC4_CRS_CRS_Msk       ( 0x0000ffffUL << CCU4_CC4_CRS_CRS_Pos )                       /*!< CCU4_CC4 CRS: CRS Mask                  */

/* -------------------------------  CCU4_CC4_TIMER  ------------------------------- */
    #define CCU4_CC4_TIMER_TVAL_Pos    0                                                              /*!< CCU4_CC4 TIMER: TVAL Position           */
    #define CCU4_CC4_TIMER_TVAL_Msk    ( 0x0000ffffUL << CCU4_CC4_TIMER_TVAL_Pos )                    /*!< CCU4_CC4 TIMER: TVAL Mask               */

/* ---------------------------------  CCU4_CC4_CV  -------------------------------- */
    #define CCU4_CC4_CV_CAPTV_Pos      0                                                              /*!< CCU4_CC4 CV: CAPTV Position             */
    #define CCU4_CC4_CV_CAPTV_Msk      ( 0x0000ffffUL << CCU4_CC4_CV_CAPTV_Pos )                      /*!< CCU4_CC4 CV: CAPTV Mask                 */
    #define CCU4_CC4_CV_FPCV_Pos       16                                                             /*!< CCU4_CC4 CV: FPCV Position              */
    #define CCU4_CC4_CV_FPCV_Msk       ( 0x0fUL << CCU4_CC4_CV_FPCV_Pos )                             /*!< CCU4_CC4 CV: FPCV Mask                  */
    #define CCU4_CC4_CV_FFL_Pos        20                                                             /*!< CCU4_CC4 CV: FFL Position               */
    #define CCU4_CC4_CV_FFL_Msk        ( 0x01UL << CCU4_CC4_CV_FFL_Pos )                              /*!< CCU4_CC4 CV: FFL Mask                   */

/* --------------------------------  CCU4_CC4_INTS  ------------------------------- */
    #define CCU4_CC4_INTS_PMUS_Pos     0                                                              /*!< CCU4_CC4 INTS: PMUS Position            */
    #define CCU4_CC4_INTS_PMUS_Msk     ( 0x01UL << CCU4_CC4_INTS_PMUS_Pos )                           /*!< CCU4_CC4 INTS: PMUS Mask                */
    #define CCU4_CC4_INTS_OMDS_Pos     1                                                              /*!< CCU4_CC4 INTS: OMDS Position            */
    #define CCU4_CC4_INTS_OMDS_Msk     ( 0x01UL << CCU4_CC4_INTS_OMDS_Pos )                           /*!< CCU4_CC4 INTS: OMDS Mask                */
    #define CCU4_CC4_INTS_CMUS_Pos     2                                                              /*!< CCU4_CC4 INTS: CMUS Position            */
    #define CCU4_CC4_INTS_CMUS_Msk     ( 0x01UL << CCU4_CC4_INTS_CMUS_Pos )                           /*!< CCU4_CC4 INTS: CMUS Mask                */
    #define CCU4_CC4_INTS_CMDS_Pos     3                                                              /*!< CCU4_CC4 INTS: CMDS Position            */
    #define CCU4_CC4_INTS_CMDS_Msk     ( 0x01UL << CCU4_CC4_INTS_CMDS_Pos )                           /*!< CCU4_CC4 INTS: CMDS Mask                */
    #define CCU4_CC4_INTS_E0AS_Pos     8                                                              /*!< CCU4_CC4 INTS: E0AS Position            */
    #define CCU4_CC4_INTS_E0AS_Msk     ( 0x01UL << CCU4_CC4_INTS_E0AS_Pos )                           /*!< CCU4_CC4 INTS: E0AS Mask                */
    #define CCU4_CC4_INTS_E1AS_Pos     9                                                              /*!< CCU4_CC4 INTS: E1AS Position            */
    #define CCU4_CC4_INTS_E1AS_Msk     ( 0x01UL << CCU4_CC4_INTS_E1AS_Pos )                           /*!< CCU4_CC4 INTS: E1AS Mask                */
    #define CCU4_CC4_INTS_E2AS_Pos     10                                                             /*!< CCU4_CC4 INTS: E2AS Position            */
    #define CCU4_CC4_INTS_E2AS_Msk     ( 0x01UL << CCU4_CC4_INTS_E2AS_Pos )                           /*!< CCU4_CC4 INTS: E2AS Mask                */
    #define CCU4_CC4_INTS_TRPF_Pos     11                                                             /*!< CCU4_CC4 INTS: TRPF Position            */
    #define CCU4_CC4_INTS_TRPF_Msk     ( 0x01UL << CCU4_CC4_INTS_TRPF_Pos )                           /*!< CCU4_CC4 INTS: TRPF Mask                */

