FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  CCU4_CC4_INTE  ------------------------------- */
    #define CCU4_CC4_INTE_PME_Pos      0                                                              /*!< CCU4_CC4 INTE: PME Position             */
    #define CCU4_CC4_INTE_PME_Msk      ( 0x01UL << CCU4_CC4_INTE_PME_Pos )                            /*!< CCU4_CC4 INTE: PME Mask                 */
    #define CCU4_CC4_INTE_OME_Pos      1                                                              /*!< CCU4_CC4 INTE: OME Position             */
    #define CCU4_CC4_INTE_OME_Msk      ( 0x01UL << CCU4_CC4_INTE_OME_Pos )                            /*!< CCU4_CC4 INTE: OME Mask                 */
    #define CCU4_CC4_INTE_CMUE_Pos     2                                                              /*!< CCU4_CC4 INTE: CMUE Position            */
    #define CCU4_CC4_INTE_CMUE_Msk     ( 0x01UL << CCU4_CC4_INTE_CMUE_Pos )                           /*!< CCU4_CC4 INTE: CMUE Mask                */
    #define CCU4_CC4_INTE_CMDE_Pos     3                                                              /*!< CCU4_CC4 INTE: CMDE Position            */
    #define CCU4_CC4_INTE_CMDE_Msk     ( 0x01UL << CCU4_CC4_INTE_CMDE_Pos )                           /*!< CCU4_CC4 INTE: CMDE Mask                */
    #define CCU4_CC4_INTE_E0AE_Pos     8                                                              /*!< CCU4_CC4 INTE: E0AE Position            */
    #define CCU4_CC4_INTE_E0AE_Msk     ( 0x01UL << CCU4_CC4_INTE_E0AE_Pos )                           /*!< CCU4_CC4 INTE: E0AE Mask                */
    #define CCU4_CC4_INTE_E1AE_Pos     9                                                              /*!< CCU4_CC4 INTE: E1AE Position            */
    #define CCU4_CC4_INTE_E1AE_Msk     ( 0x01UL << CCU4_CC4_INTE_E1AE_Pos )                           /*!< CCU4_CC4 INTE: E1AE Mask                */
    #define CCU4_CC4_INTE_E2AE_Pos     10                                                             /*!< CCU4_CC4 INTE: E2AE Position            */
    #define CCU4_CC4_INTE_E2AE_Msk     ( 0x01UL << CCU4_CC4_INTE_E2AE_Pos )                           /*!< CCU4_CC4 INTE: E2AE Mask                */

/* --------------------------------  CCU4_CC4_SRS  -------------------------------- */
    #define CCU4_CC4_SRS_POSR_Pos      0                                                              /*!< CCU4_CC4 SRS: POSR Position             */
    #define CCU4_CC4_SRS_POSR_Msk      ( 0x03UL << CCU4_CC4_SRS_POSR_Pos )                            /*!< CCU4_CC4 SRS: POSR Mask                 */
    #define CCU4_CC4_SRS_CMSR_Pos      2                                                              /*!< CCU4_CC4 SRS: CMSR Position             */
    #define CCU4_CC4_SRS_CMSR_Msk      ( 0x03UL << CCU4_CC4_SRS_CMSR_Pos )                            /*!< CCU4_CC4 SRS: CMSR Mask                 */
    #define CCU4_CC4_SRS_E0SR_Pos      8                                                              /*!< CCU4_CC4 SRS: E0SR Position             */
    #define CCU4_CC4_SRS_E0SR_Msk      ( 0x03UL << CCU4_CC4_SRS_E0SR_Pos )                            /*!< CCU4_CC4 SRS: E0SR Mask                 */
    #define CCU4_CC4_SRS_E1SR_Pos      10                                                             /*!< CCU4_CC4 SRS: E1SR Position             */
    #define CCU4_CC4_SRS_E1SR_Msk      ( 0x03UL << CCU4_CC4_SRS_E1SR_Pos )                            /*!< CCU4_CC4 SRS: E1SR Mask                 */
    #define CCU4_CC4_SRS_E2SR_Pos      12                                                             /*!< CCU4_CC4 SRS: E2SR Position             */
    #define CCU4_CC4_SRS_E2SR_Msk      ( 0x03UL << CCU4_CC4_SRS_E2SR_Pos )                            /*!< CCU4_CC4 SRS: E2SR Mask                 */

/* --------------------------------  CCU4_CC4_SWS  -------------------------------- */
    #define CCU4_CC4_SWS_SPM_Pos       0                                                              /*!< CCU4_CC4 SWS: SPM Position              */
    #define CCU4_CC4_SWS_SPM_Msk       ( 0x01UL << CCU4_CC4_SWS_SPM_Pos )                             /*!< CCU4_CC4 SWS: SPM Mask                  */
    #define CCU4_CC4_SWS_SOM_Pos       1                                                              /*!< CCU4_CC4 SWS: SOM Position              */
    #define CCU4_CC4_SWS_SOM_Msk       ( 0x01UL << CCU4_CC4_SWS_SOM_Pos )                             /*!< CCU4_CC4 SWS: SOM Mask                  */
    #define CCU4_CC4_SWS_SCMU_Pos      2                                                              /*!< CCU4_CC4 SWS: SCMU Position             */
    #define CCU4_CC4_SWS_SCMU_Msk      ( 0x01UL << CCU4_CC4_SWS_SCMU_Pos )                            /*!< CCU4_CC4 SWS: SCMU Mask                 */
    #define CCU4_CC4_SWS_SCMD_Pos      3                                                              /*!< CCU4_CC4 SWS: SCMD Position             */
    #define CCU4_CC4_SWS_SCMD_Msk      ( 0x01UL << CCU4_CC4_SWS_SCMD_Pos )                            /*!< CCU4_CC4 SWS: SCMD Mask                 */
    #define CCU4_CC4_SWS_SE0A_Pos      8                                                              /*!< CCU4_CC4 SWS: SE0A Position             */
    #define CCU4_CC4_SWS_SE0A_Msk      ( 0x01UL << CCU4_CC4_SWS_SE0A_Pos )                            /*!< CCU4_CC4 SWS: SE0A Mask                 */
    #define CCU4_CC4_SWS_SE1A_Pos      9                                                              /*!< CCU4_CC4 SWS: SE1A Position             */
    #define CCU4_CC4_SWS_SE1A_Msk      ( 0x01UL << CCU4_CC4_SWS_SE1A_Pos )                            /*!< CCU4_CC4 SWS: SE1A Mask                 */
    #define CCU4_CC4_SWS_SE2A_Pos      10                                                             /*!< CCU4_CC4 SWS: SE2A Position             */
    #define CCU4_CC4_SWS_SE2A_Msk      ( 0x01UL << CCU4_CC4_SWS_SE2A_Pos )                            /*!< CCU4_CC4 SWS: SE2A Mask                 */
    #define CCU4_CC4_SWS_STRPF_Pos     11                                                             /*!< CCU4_CC4 SWS: STRPF Position            */
    #define CCU4_CC4_SWS_STRPF_Msk     ( 0x01UL << CCU4_CC4_SWS_STRPF_Pos )                           /*!< CCU4_CC4 SWS: STRPF Mask                */

