FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  CCU4_CC4_SWR  -------------------------------- */
    #define CCU4_CC4_SWR_RPM_Pos       0                                                              /*!< CCU4_CC4 SWR: RPM Position              */
    #define CCU4_CC4_SWR_RPM_Msk       ( 0x01UL << CCU4_CC4_SWR_RPM_Pos )                             /*!< CCU4_CC4 SWR: RPM Mask                  */
    #define CCU4_CC4_SWR_ROM_Pos       1                                                              /*!< CCU4_CC4 SWR: ROM Position              */
    #define CCU4_CC4_SWR_ROM_Msk       ( 0x01UL << CCU4_CC4_SWR_ROM_Pos )                             /*!< CCU4_CC4 SWR: ROM Mask                  */
    #define CCU4_CC4_SWR_RCMU_Pos      2                                                              /*!< CCU4_CC4 SWR: RCMU Position             */
    #define CCU4_CC4_SWR_RCMU_Msk      ( 0x01UL << CCU4_CC4_SWR_RCMU_Pos )                            /*!< CCU4_CC4 SWR: RCMU Mask                 */
    #define CCU4_CC4_SWR_RCMD_Pos      3                                                              /*!< CCU4_CC4 SWR: RCMD Position             */
    #define CCU4_CC4_SWR_RCMD_Msk      ( 0x01UL << CCU4_CC4_SWR_RCMD_Pos )                            /*!< CCU4_CC4 SWR: RCMD Mask                 */
    #define CCU4_CC4_SWR_RE0A_Pos      8                                                              /*!< CCU4_CC4 SWR: RE0A Position             */
    #define CCU4_CC4_SWR_RE0A_Msk      ( 0x01UL << CCU4_CC4_SWR_RE0A_Pos )                            /*!< CCU4_CC4 SWR: RE0A Mask                 */
    #define CCU4_CC4_SWR_RE1A_Pos      9                                                              /*!< CCU4_CC4 SWR: RE1A Position             */
    #define CCU4_CC4_SWR_RE1A_Msk      ( 0x01UL << CCU4_CC4_SWR_RE1A_Pos )                            /*!< CCU4_CC4 SWR: RE1A Mask                 */
    #define CCU4_CC4_SWR_RE2A_Pos      10                                                             /*!< CCU4_CC4 SWR: RE2A Position             */
    #define CCU4_CC4_SWR_RE2A_Msk      ( 0x01UL << CCU4_CC4_SWR_RE2A_Pos )                            /*!< CCU4_CC4 SWR: RE2A Mask                 */
    #define CCU4_CC4_SWR_RTRPF_Pos     11                                                             /*!< CCU4_CC4 SWR: RTRPF Position            */
    #define CCU4_CC4_SWR_RTRPF_Msk     ( 0x01UL << CCU4_CC4_SWR_RTRPF_Pos )                           /*!< CCU4_CC4 SWR: RTRPF Mask                */

/* -------------------------------  CCU4_CC4_ECRD0  ------------------------------- */
    #define CCU4_CC4_ECRD0_CAPV_Pos    0                                                              /*!< CCU4_CC4 ECRD0: CAPV Position           */
    #define CCU4_CC4_ECRD0_CAPV_Msk    ( 0x0000ffffUL << CCU4_CC4_ECRD0_CAPV_Pos )                    /*!< CCU4_CC4 ECRD0: CAPV Mask               */
    #define CCU4_CC4_ECRD0_FPCV_Pos    16                                                             /*!< CCU4_CC4 ECRD0: FPCV Position           */
    #define CCU4_CC4_ECRD0_FPCV_Msk    ( 0x0fUL << CCU4_CC4_ECRD0_FPCV_Pos )                          /*!< CCU4_CC4 ECRD0: FPCV Mask               */
    #define CCU4_CC4_ECRD0_SPTR_Pos    20                                                             /*!< CCU4_CC4 ECRD0: SPTR Position           */
    #define CCU4_CC4_ECRD0_SPTR_Msk    ( 0x03UL << CCU4_CC4_ECRD0_SPTR_Pos )                          /*!< CCU4_CC4 ECRD0: SPTR Mask               */
    #define CCU4_CC4_ECRD0_VPTR_Pos    22                                                             /*!< CCU4_CC4 ECRD0: VPTR Position           */
    #define CCU4_CC4_ECRD0_VPTR_Msk    ( 0x03UL << CCU4_CC4_ECRD0_VPTR_Pos )                          /*!< CCU4_CC4 ECRD0: VPTR Mask               */
    #define CCU4_CC4_ECRD0_FFL_Pos     24                                                             /*!< CCU4_CC4 ECRD0: FFL Position            */
    #define CCU4_CC4_ECRD0_FFL_Msk     ( 0x01UL << CCU4_CC4_ECRD0_FFL_Pos )                           /*!< CCU4_CC4 ECRD0: FFL Mask                */
    #define CCU4_CC4_ECRD0_LCV_Pos     25                                                             /*!< CCU4_CC4 ECRD0: LCV Position            */
    #define CCU4_CC4_ECRD0_LCV_Msk     ( 0x01UL << CCU4_CC4_ECRD0_LCV_Pos )                           /*!< CCU4_CC4 ECRD0: LCV Mask                */

/* -------------------------------  CCU4_CC4_ECRD1  ------------------------------- */
    #define CCU4_CC4_ECRD1_CAPV_Pos    0                                                              /*!< CCU4_CC4 ECRD1: CAPV Position           */
    #define CCU4_CC4_ECRD1_CAPV_Msk    ( 0x0000ffffUL << CCU4_CC4_ECRD1_CAPV_Pos )                    /*!< CCU4_CC4 ECRD1: CAPV Mask               */
    #define CCU4_CC4_ECRD1_FPCV_Pos    16                                                             /*!< CCU4_CC4 ECRD1: FPCV Position           */
    #define CCU4_CC4_ECRD1_FPCV_Msk    ( 0x0fUL << CCU4_CC4_ECRD1_FPCV_Pos )                          /*!< CCU4_CC4 ECRD1: FPCV Mask               */
    #define CCU4_CC4_ECRD1_SPTR_Pos    20                                                             /*!< CCU4_CC4 ECRD1: SPTR Position           */
    #define CCU4_CC4_ECRD1_SPTR_Msk    ( 0x03UL << CCU4_CC4_ECRD1_SPTR_Pos )                          /*!< CCU4_CC4 ECRD1: SPTR Mask               */
    #define CCU4_CC4_ECRD1_VPTR_Pos    22                                                             /*!< CCU4_CC4 ECRD1: VPTR Position           */
    #define CCU4_CC4_ECRD1_VPTR_Msk    ( 0x03UL << CCU4_CC4_ECRD1_VPTR_Pos )                          /*!< CCU4_CC4 ECRD1: VPTR Mask               */
    #define CCU4_CC4_ECRD1_FFL_Pos     24                                                             /*!< CCU4_CC4 ECRD1: FFL Position            */
    #define CCU4_CC4_ECRD1_FFL_Msk     ( 0x01UL << CCU4_CC4_ECRD1_FFL_Pos )                           /*!< CCU4_CC4 ECRD1: FFL Mask                */
    #define CCU4_CC4_ECRD1_LCV_Pos     25                                                             /*!< CCU4_CC4 ECRD1: LCV Position            */
    #define CCU4_CC4_ECRD1_LCV_Msk     ( 0x01UL << CCU4_CC4_ECRD1_LCV_Pos )                           /*!< CCU4_CC4 ECRD1: LCV Mask                */


/* ================================================================================ */
/* ================          Group 'VADC' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------------  VADC_CLC  ---------------------------------- */
    #define VADC_CLC_DISR_Pos               0                                                         /*!< VADC CLC: DISR Position                 */
    #define VADC_CLC_DISR_Msk               ( 0x01UL << VADC_CLC_DISR_Pos )                           /*!< VADC CLC: DISR Mask                     */
    #define VADC_CLC_DISS_Pos               1                                                         /*!< VADC CLC: DISS Position                 */
    #define VADC_CLC_DISS_Msk               ( 0x01UL << VADC_CLC_DISS_Pos )                           /*!< VADC CLC: DISS Mask                     */
    #define VADC_CLC_EDIS_Pos               3                                                         /*!< VADC CLC: EDIS Position                 */
    #define VADC_CLC_EDIS_Msk               ( 0x01UL << VADC_CLC_EDIS_Pos )                           /*!< VADC CLC: EDIS Mask                     */

/* -----------------------------------  VADC_ID  ---------------------------------- */
    #define VADC_ID_MOD_REV_Pos             0                                                         /*!< VADC ID: MOD_REV Position               */
    #define VADC_ID_MOD_REV_Msk             ( 0x000000ffUL << VADC_ID_MOD_REV_Pos )                   /*!< VADC ID: MOD_REV Mask                   */
    #define VADC_ID_MOD_TYPE_Pos            8                                                         /*!< VADC ID: MOD_TYPE Position              */
    #define VADC_ID_MOD_TYPE_Msk            ( 0x000000ffUL << VADC_ID_MOD_TYPE_Pos )                  /*!< VADC ID: MOD_TYPE Mask                  */
    #define VADC_ID_MOD_NUMBER_Pos          16                                                        /*!< VADC ID: MOD_NUMBER Position            */
    #define VADC_ID_MOD_NUMBER_Msk          ( 0x0000ffffUL << VADC_ID_MOD_NUMBER_Pos )                /*!< VADC ID: MOD_NUMBER Mask                */

