FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  VADC_OCS  ---------------------------------- */
    #define VADC_OCS_TGS_Pos                0                                                         /*!< VADC OCS: TGS Position                  */
    #define VADC_OCS_TGS_Msk                ( 0x03UL << VADC_OCS_TGS_Pos )                            /*!< VADC OCS: TGS Mask                      */
    #define VADC_OCS_TGB_Pos                2                                                         /*!< VADC OCS: TGB Position                  */
    #define VADC_OCS_TGB_Msk                ( 0x01UL << VADC_OCS_TGB_Pos )                            /*!< VADC OCS: TGB Mask                      */
    #define VADC_OCS_TG_P_Pos               3                                                         /*!< VADC OCS: TG_P Position                 */
    #define VADC_OCS_TG_P_Msk               ( 0x01UL << VADC_OCS_TG_P_Pos )                           /*!< VADC OCS: TG_P Mask                     */
    #define VADC_OCS_SUS_Pos                24                                                        /*!< VADC OCS: SUS Position                  */
    #define VADC_OCS_SUS_Msk                ( 0x0fUL << VADC_OCS_SUS_Pos )                            /*!< VADC OCS: SUS Mask                      */
    #define VADC_OCS_SUS_P_Pos              28                                                        /*!< VADC OCS: SUS_P Position                */
    #define VADC_OCS_SUS_P_Msk              ( 0x01UL << VADC_OCS_SUS_P_Pos )                          /*!< VADC OCS: SUS_P Mask                    */
    #define VADC_OCS_SUSSTA_Pos             29                                                        /*!< VADC OCS: SUSSTA Position               */
    #define VADC_OCS_SUSSTA_Msk             ( 0x01UL << VADC_OCS_SUSSTA_Pos )                         /*!< VADC OCS: SUSSTA Mask                   */

/* --------------------------------  VADC_GLOBCFG  -------------------------------- */
    #define VADC_GLOBCFG_DIVA_Pos           0                                                         /*!< VADC GLOBCFG: DIVA Position             */
    #define VADC_GLOBCFG_DIVA_Msk           ( 0x1fUL << VADC_GLOBCFG_DIVA_Pos )                       /*!< VADC GLOBCFG: DIVA Mask                 */
    #define VADC_GLOBCFG_DCMSB_Pos          7                                                         /*!< VADC GLOBCFG: DCMSB Position            */
    #define VADC_GLOBCFG_DCMSB_Msk          ( 0x01UL << VADC_GLOBCFG_DCMSB_Pos )                      /*!< VADC GLOBCFG: DCMSB Mask                */
    #define VADC_GLOBCFG_DIVD_Pos           8                                                         /*!< VADC GLOBCFG: DIVD Position             */
    #define VADC_GLOBCFG_DIVD_Msk           ( 0x03UL << VADC_GLOBCFG_DIVD_Pos )                       /*!< VADC GLOBCFG: DIVD Mask                 */
    #define VADC_GLOBCFG_DIVWC_Pos          15                                                        /*!< VADC GLOBCFG: DIVWC Position            */
    #define VADC_GLOBCFG_DIVWC_Msk          ( 0x01UL << VADC_GLOBCFG_DIVWC_Pos )                      /*!< VADC GLOBCFG: DIVWC Mask                */
    #define VADC_GLOBCFG_DPCAL0_Pos         16                                                        /*!< VADC GLOBCFG: DPCAL0 Position           */
    #define VADC_GLOBCFG_DPCAL0_Msk         ( 0x01UL << VADC_GLOBCFG_DPCAL0_Pos )                     /*!< VADC GLOBCFG: DPCAL0 Mask               */
    #define VADC_GLOBCFG_DPCAL1_Pos         17                                                        /*!< VADC GLOBCFG: DPCAL1 Position           */
    #define VADC_GLOBCFG_DPCAL1_Msk         ( 0x01UL << VADC_GLOBCFG_DPCAL1_Pos )                     /*!< VADC GLOBCFG: DPCAL1 Mask               */
    #define VADC_GLOBCFG_SUCAL_Pos          31                                                        /*!< VADC GLOBCFG: SUCAL Position            */
    #define VADC_GLOBCFG_SUCAL_Msk          ( 0x01UL << VADC_GLOBCFG_SUCAL_Pos )                      /*!< VADC GLOBCFG: SUCAL Mask                */

/* --------------------------------  VADC_ACCPROT0  ------------------------------- */
    #define VADC_ACCPROT0_APC0_Pos          0                                                         /*!< VADC ACCPROT0: APC0 Position            */
    #define VADC_ACCPROT0_APC0_Msk          ( 0x01UL << VADC_ACCPROT0_APC0_Pos )                      /*!< VADC ACCPROT0: APC0 Mask                */
    #define VADC_ACCPROT0_APC1_Pos          1                                                         /*!< VADC ACCPROT0: APC1 Position            */
    #define VADC_ACCPROT0_APC1_Msk          ( 0x01UL << VADC_ACCPROT0_APC1_Pos )                      /*!< VADC ACCPROT0: APC1 Mask                */
    #define VADC_ACCPROT0_APEM_Pos          15                                                        /*!< VADC ACCPROT0: APEM Position            */
    #define VADC_ACCPROT0_APEM_Msk          ( 0x01UL << VADC_ACCPROT0_APEM_Pos )                      /*!< VADC ACCPROT0: APEM Mask                */
    #define VADC_ACCPROT0_API0_Pos          16                                                        /*!< VADC ACCPROT0: API0 Position            */
    #define VADC_ACCPROT0_API0_Msk          ( 0x01UL << VADC_ACCPROT0_API0_Pos )                      /*!< VADC ACCPROT0: API0 Mask                */
    #define VADC_ACCPROT0_API1_Pos          17                                                        /*!< VADC ACCPROT0: API1 Position            */
    #define VADC_ACCPROT0_API1_Msk          ( 0x01UL << VADC_ACCPROT0_API1_Pos )                      /*!< VADC ACCPROT0: API1 Mask                */
    #define VADC_ACCPROT0_APGC_Pos          31                                                        /*!< VADC ACCPROT0: APGC Position            */
    #define VADC_ACCPROT0_APGC_Msk          ( 0x01UL << VADC_ACCPROT0_APGC_Pos )                      /*!< VADC ACCPROT0: APGC Mask                */

