FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_ACCPROT1  ------------------------------- */
    #define VADC_ACCPROT1_APS0_Pos          0                                                         /*!< VADC ACCPROT1: APS0 Position            */
    #define VADC_ACCPROT1_APS0_Msk          ( 0x01UL << VADC_ACCPROT1_APS0_Pos )                      /*!< VADC ACCPROT1: APS0 Mask                */
    #define VADC_ACCPROT1_APS1_Pos          1                                                         /*!< VADC ACCPROT1: APS1 Position            */
    #define VADC_ACCPROT1_APS1_Msk          ( 0x01UL << VADC_ACCPROT1_APS1_Pos )                      /*!< VADC ACCPROT1: APS1 Mask                */
    #define VADC_ACCPROT1_APTF_Pos          15                                                        /*!< VADC ACCPROT1: APTF Position            */
    #define VADC_ACCPROT1_APTF_Msk          ( 0x01UL << VADC_ACCPROT1_APTF_Pos )                      /*!< VADC ACCPROT1: APTF Mask                */
    #define VADC_ACCPROT1_APR0_Pos          16                                                        /*!< VADC ACCPROT1: APR0 Position            */
    #define VADC_ACCPROT1_APR0_Msk          ( 0x01UL << VADC_ACCPROT1_APR0_Pos )                      /*!< VADC ACCPROT1: APR0 Mask                */
    #define VADC_ACCPROT1_APR1_Pos          17                                                        /*!< VADC ACCPROT1: APR1 Position            */
    #define VADC_ACCPROT1_APR1_Msk          ( 0x01UL << VADC_ACCPROT1_APR1_Pos )                      /*!< VADC ACCPROT1: APR1 Mask                */

/* -------------------------------  VADC_GLOBICLASS  ------------------------------ */
    #define VADC_GLOBICLASS_STCS_Pos        0                                                         /*!< VADC GLOBICLASS: STCS Position          */
    #define VADC_GLOBICLASS_STCS_Msk        ( 0x1fUL << VADC_GLOBICLASS_STCS_Pos )                    /*!< VADC GLOBICLASS: STCS Mask              */
    #define VADC_GLOBICLASS_CMS_Pos         8                                                         /*!< VADC GLOBICLASS: CMS Position           */
    #define VADC_GLOBICLASS_CMS_Msk         ( 0x07UL << VADC_GLOBICLASS_CMS_Pos )                     /*!< VADC GLOBICLASS: CMS Mask               */
    #define VADC_GLOBICLASS_STCE_Pos        16                                                        /*!< VADC GLOBICLASS: STCE Position          */
    #define VADC_GLOBICLASS_STCE_Msk        ( 0x1fUL << VADC_GLOBICLASS_STCE_Pos )                    /*!< VADC GLOBICLASS: STCE Mask              */
    #define VADC_GLOBICLASS_CME_Pos         24                                                        /*!< VADC GLOBICLASS: CME Position           */
    #define VADC_GLOBICLASS_CME_Msk         ( 0x07UL << VADC_GLOBICLASS_CME_Pos )                     /*!< VADC GLOBICLASS: CME Mask               */

/* -------------------------------  VADC_GLOBBOUND  ------------------------------- */
    #define VADC_GLOBBOUND_BOUNDARY0_Pos    0                                                         /*!< VADC GLOBBOUND: BOUNDARY0 Position      */
    #define VADC_GLOBBOUND_BOUNDARY0_Msk    ( 0x00000fffUL << VADC_GLOBBOUND_BOUNDARY0_Pos )          /*!< VADC GLOBBOUND: BOUNDARY0 Mask          */
    #define VADC_GLOBBOUND_BOUNDARY1_Pos    16                                                        /*!< VADC GLOBBOUND: BOUNDARY1 Position      */
    #define VADC_GLOBBOUND_BOUNDARY1_Msk    ( 0x00000fffUL << VADC_GLOBBOUND_BOUNDARY1_Pos )          /*!< VADC GLOBBOUND: BOUNDARY1 Mask          */

/* -------------------------------  VADC_GLOBEFLAG  ------------------------------- */
    #define VADC_GLOBEFLAG_SEVGLB_Pos       0                                                         /*!< VADC GLOBEFLAG: SEVGLB Position         */
    #define VADC_GLOBEFLAG_SEVGLB_Msk       ( 0x01UL << VADC_GLOBEFLAG_SEVGLB_Pos )                   /*!< VADC GLOBEFLAG: SEVGLB Mask             */
    #define VADC_GLOBEFLAG_REVGLB_Pos       8                                                         /*!< VADC GLOBEFLAG: REVGLB Position         */
    #define VADC_GLOBEFLAG_REVGLB_Msk       ( 0x01UL << VADC_GLOBEFLAG_REVGLB_Pos )                   /*!< VADC GLOBEFLAG: REVGLB Mask             */
    #define VADC_GLOBEFLAG_SEVGLBCLR_Pos    16                                                        /*!< VADC GLOBEFLAG: SEVGLBCLR Position      */
    #define VADC_GLOBEFLAG_SEVGLBCLR_Msk    ( 0x01UL << VADC_GLOBEFLAG_SEVGLBCLR_Pos )                /*!< VADC GLOBEFLAG: SEVGLBCLR Mask          */
    #define VADC_GLOBEFLAG_REVGLBCLR_Pos    24                                                        /*!< VADC GLOBEFLAG: REVGLBCLR Position      */
    #define VADC_GLOBEFLAG_REVGLBCLR_Msk    ( 0x01UL << VADC_GLOBEFLAG_REVGLBCLR_Pos )                /*!< VADC GLOBEFLAG: REVGLBCLR Mask          */

/* --------------------------------  VADC_GLOBEVNP  ------------------------------- */
    #define VADC_GLOBEVNP_SEV0NP_Pos        0                                                         /*!< VADC GLOBEVNP: SEV0NP Position          */
    #define VADC_GLOBEVNP_SEV0NP_Msk        ( 0x0fUL << VADC_GLOBEVNP_SEV0NP_Pos )                    /*!< VADC GLOBEVNP: SEV0NP Mask              */
    #define VADC_GLOBEVNP_REV0NP_Pos        16                                                        /*!< VADC GLOBEVNP: REV0NP Position          */
    #define VADC_GLOBEVNP_REV0NP_Msk        ( 0x0fUL << VADC_GLOBEVNP_REV0NP_Pos )                    /*!< VADC GLOBEVNP: REV0NP Mask              */

/* ---------------------------------  VADC_BRSSEL  -------------------------------- */
    #define VADC_BRSSEL_CHSELG0_Pos         0                                                         /*!< VADC BRSSEL: CHSELG0 Position           */
    #define VADC_BRSSEL_CHSELG0_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG0_Pos )                     /*!< VADC BRSSEL: CHSELG0 Mask               */
    #define VADC_BRSSEL_CHSELG1_Pos         1                                                         /*!< VADC BRSSEL: CHSELG1 Position           */
    #define VADC_BRSSEL_CHSELG1_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG1_Pos )                     /*!< VADC BRSSEL: CHSELG1 Mask               */
    #define VADC_BRSSEL_CHSELG2_Pos         2                                                         /*!< VADC BRSSEL: CHSELG2 Position           */
    #define VADC_BRSSEL_CHSELG2_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG2_Pos )                     /*!< VADC BRSSEL: CHSELG2 Mask               */
    #define VADC_BRSSEL_CHSELG3_Pos         3                                                         /*!< VADC BRSSEL: CHSELG3 Position           */
    #define VADC_BRSSEL_CHSELG3_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG3_Pos )                     /*!< VADC BRSSEL: CHSELG3 Mask               */
    #define VADC_BRSSEL_CHSELG4_Pos         4                                                         /*!< VADC BRSSEL: CHSELG4 Position           */
    #define VADC_BRSSEL_CHSELG4_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG4_Pos )                     /*!< VADC BRSSEL: CHSELG4 Mask               */
    #define VADC_BRSSEL_CHSELG5_Pos         5                                                         /*!< VADC BRSSEL: CHSELG5 Position           */
    #define VADC_BRSSEL_CHSELG5_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG5_Pos )                     /*!< VADC BRSSEL: CHSELG5 Mask               */
    #define VADC_BRSSEL_CHSELG6_Pos         6                                                         /*!< VADC BRSSEL: CHSELG6 Position           */
    #define VADC_BRSSEL_CHSELG6_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG6_Pos )                     /*!< VADC BRSSEL: CHSELG6 Mask               */
    #define VADC_BRSSEL_CHSELG7_Pos         7                                                         /*!< VADC BRSSEL: CHSELG7 Position           */
    #define VADC_BRSSEL_CHSELG7_Msk         ( 0x01UL << VADC_BRSSEL_CHSELG7_Pos )                     /*!< VADC BRSSEL: CHSELG7 Mask               */

