FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  VADC_BRSPND  -------------------------------- */
    #define VADC_BRSPND_CHPNDG0_Pos         0                                                         /*!< VADC BRSPND: CHPNDG0 Position           */
    #define VADC_BRSPND_CHPNDG0_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG0_Pos )                     /*!< VADC BRSPND: CHPNDG0 Mask               */
    #define VADC_BRSPND_CHPNDG1_Pos         1                                                         /*!< VADC BRSPND: CHPNDG1 Position           */
    #define VADC_BRSPND_CHPNDG1_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG1_Pos )                     /*!< VADC BRSPND: CHPNDG1 Mask               */
    #define VADC_BRSPND_CHPNDG2_Pos         2                                                         /*!< VADC BRSPND: CHPNDG2 Position           */
    #define VADC_BRSPND_CHPNDG2_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG2_Pos )                     /*!< VADC BRSPND: CHPNDG2 Mask               */
    #define VADC_BRSPND_CHPNDG3_Pos         3                                                         /*!< VADC BRSPND: CHPNDG3 Position           */
    #define VADC_BRSPND_CHPNDG3_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG3_Pos )                     /*!< VADC BRSPND: CHPNDG3 Mask               */
    #define VADC_BRSPND_CHPNDG4_Pos         4                                                         /*!< VADC BRSPND: CHPNDG4 Position           */
    #define VADC_BRSPND_CHPNDG4_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG4_Pos )                     /*!< VADC BRSPND: CHPNDG4 Mask               */
    #define VADC_BRSPND_CHPNDG5_Pos         5                                                         /*!< VADC BRSPND: CHPNDG5 Position           */
    #define VADC_BRSPND_CHPNDG5_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG5_Pos )                     /*!< VADC BRSPND: CHPNDG5 Mask               */
    #define VADC_BRSPND_CHPNDG6_Pos         6                                                         /*!< VADC BRSPND: CHPNDG6 Position           */
    #define VADC_BRSPND_CHPNDG6_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG6_Pos )                     /*!< VADC BRSPND: CHPNDG6 Mask               */
    #define VADC_BRSPND_CHPNDG7_Pos         7                                                         /*!< VADC BRSPND: CHPNDG7 Position           */
    #define VADC_BRSPND_CHPNDG7_Msk         ( 0x01UL << VADC_BRSPND_CHPNDG7_Pos )                     /*!< VADC BRSPND: CHPNDG7 Mask               */

/* --------------------------------  VADC_BRSCTRL  -------------------------------- */
    #define VADC_BRSCTRL_SRCRESREG_Pos      0                                                         /*!< VADC BRSCTRL: SRCRESREG Position        */
    #define VADC_BRSCTRL_SRCRESREG_Msk      ( 0x0fUL << VADC_BRSCTRL_SRCRESREG_Pos )                  /*!< VADC BRSCTRL: SRCRESREG Mask            */
    #define VADC_BRSCTRL_XTSEL_Pos          8                                                         /*!< VADC BRSCTRL: XTSEL Position            */
    #define VADC_BRSCTRL_XTSEL_Msk          ( 0x0fUL << VADC_BRSCTRL_XTSEL_Pos )                      /*!< VADC BRSCTRL: XTSEL Mask                */
    #define VADC_BRSCTRL_XTLVL_Pos          12                                                        /*!< VADC BRSCTRL: XTLVL Position            */
    #define VADC_BRSCTRL_XTLVL_Msk          ( 0x01UL << VADC_BRSCTRL_XTLVL_Pos )                      /*!< VADC BRSCTRL: XTLVL Mask                */
    #define VADC_BRSCTRL_XTMODE_Pos         13                                                        /*!< VADC BRSCTRL: XTMODE Position           */
    #define VADC_BRSCTRL_XTMODE_Msk         ( 0x03UL << VADC_BRSCTRL_XTMODE_Pos )                     /*!< VADC BRSCTRL: XTMODE Mask               */
    #define VADC_BRSCTRL_XTWC_Pos           15                                                        /*!< VADC BRSCTRL: XTWC Position             */
    #define VADC_BRSCTRL_XTWC_Msk           ( 0x01UL << VADC_BRSCTRL_XTWC_Pos )                       /*!< VADC BRSCTRL: XTWC Mask                 */
    #define VADC_BRSCTRL_GTSEL_Pos          16                                                        /*!< VADC BRSCTRL: GTSEL Position            */
    #define VADC_BRSCTRL_GTSEL_Msk          ( 0x0fUL << VADC_BRSCTRL_GTSEL_Pos )                      /*!< VADC BRSCTRL: GTSEL Mask                */
    #define VADC_BRSCTRL_GTLVL_Pos          20                                                        /*!< VADC BRSCTRL: GTLVL Position            */
    #define VADC_BRSCTRL_GTLVL_Msk          ( 0x01UL << VADC_BRSCTRL_GTLVL_Pos )                      /*!< VADC BRSCTRL: GTLVL Mask                */
    #define VADC_BRSCTRL_GTWC_Pos           23                                                        /*!< VADC BRSCTRL: GTWC Position             */
    #define VADC_BRSCTRL_GTWC_Msk           ( 0x01UL << VADC_BRSCTRL_GTWC_Pos )                       /*!< VADC BRSCTRL: GTWC Mask                 */

/* ---------------------------------  VADC_BRSMR  --------------------------------- */
    #define VADC_BRSMR_ENGT_Pos             0                                                         /*!< VADC BRSMR: ENGT Position               */
    #define VADC_BRSMR_ENGT_Msk             ( 0x03UL << VADC_BRSMR_ENGT_Pos )                         /*!< VADC BRSMR: ENGT Mask                   */
    #define VADC_BRSMR_ENTR_Pos             2                                                         /*!< VADC BRSMR: ENTR Position               */
    #define VADC_BRSMR_ENTR_Msk             ( 0x01UL << VADC_BRSMR_ENTR_Pos )                         /*!< VADC BRSMR: ENTR Mask                   */
    #define VADC_BRSMR_ENSI_Pos             3                                                         /*!< VADC BRSMR: ENSI Position               */
    #define VADC_BRSMR_ENSI_Msk             ( 0x01UL << VADC_BRSMR_ENSI_Pos )                         /*!< VADC BRSMR: ENSI Mask                   */
    #define VADC_BRSMR_SCAN_Pos             4                                                         /*!< VADC BRSMR: SCAN Position               */
    #define VADC_BRSMR_SCAN_Msk             ( 0x01UL << VADC_BRSMR_SCAN_Pos )                         /*!< VADC BRSMR: SCAN Mask                   */
    #define VADC_BRSMR_LDM_Pos              5                                                         /*!< VADC BRSMR: LDM Position                */
    #define VADC_BRSMR_LDM_Msk              ( 0x01UL << VADC_BRSMR_LDM_Pos )                          /*!< VADC BRSMR: LDM Mask                    */
    #define VADC_BRSMR_REQGT_Pos            7                                                         /*!< VADC BRSMR: REQGT Position              */
    #define VADC_BRSMR_REQGT_Msk            ( 0x01UL << VADC_BRSMR_REQGT_Pos )                        /*!< VADC BRSMR: REQGT Mask                  */
    #define VADC_BRSMR_CLRPND_Pos           8                                                         /*!< VADC BRSMR: CLRPND Position             */
    #define VADC_BRSMR_CLRPND_Msk           ( 0x01UL << VADC_BRSMR_CLRPND_Pos )                       /*!< VADC BRSMR: CLRPND Mask                 */
    #define VADC_BRSMR_LDEV_Pos             9                                                         /*!< VADC BRSMR: LDEV Position               */
    #define VADC_BRSMR_LDEV_Msk             ( 0x01UL << VADC_BRSMR_LDEV_Pos )                         /*!< VADC BRSMR: LDEV Mask                   */
    #define VADC_BRSMR_RPTDIS_Pos           16                                                        /*!< VADC BRSMR: RPTDIS Position             */
    #define VADC_BRSMR_RPTDIS_Msk           ( 0x01UL << VADC_BRSMR_RPTDIS_Pos )                       /*!< VADC BRSMR: RPTDIS Mask                 */

/* --------------------------------  VADC_GLOBRCR  -------------------------------- */
    #define VADC_GLOBRCR_DRCTR_Pos          16                                                        /*!< VADC GLOBRCR: DRCTR Position            */
    #define VADC_GLOBRCR_DRCTR_Msk          ( 0x0fUL << VADC_GLOBRCR_DRCTR_Pos )                      /*!< VADC GLOBRCR: DRCTR Mask                */
    #define VADC_GLOBRCR_WFR_Pos            24                                                        /*!< VADC GLOBRCR: WFR Position              */
    #define VADC_GLOBRCR_WFR_Msk            ( 0x01UL << VADC_GLOBRCR_WFR_Pos )                        /*!< VADC GLOBRCR: WFR Mask                  */
    #define VADC_GLOBRCR_SRGEN_Pos          31                                                        /*!< VADC GLOBRCR: SRGEN Position            */
    #define VADC_GLOBRCR_SRGEN_Msk          ( 0x01UL << VADC_GLOBRCR_SRGEN_Pos )                      /*!< VADC GLOBRCR: SRGEN Mask                */

