FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_GLOBRES  -------------------------------- */
    #define VADC_GLOBRES_RESULT_Pos         0                                                         /*!< VADC GLOBRES: RESULT Position           */
    #define VADC_GLOBRES_RESULT_Msk         ( 0x0000ffffUL << VADC_GLOBRES_RESULT_Pos )               /*!< VADC GLOBRES: RESULT Mask               */
    #define VADC_GLOBRES_GNR_Pos            16                                                        /*!< VADC GLOBRES: GNR Position              */
    #define VADC_GLOBRES_GNR_Msk            ( 0x0fUL << VADC_GLOBRES_GNR_Pos )                        /*!< VADC GLOBRES: GNR Mask                  */
    #define VADC_GLOBRES_CHNR_Pos           20                                                        /*!< VADC GLOBRES: CHNR Position             */
    #define VADC_GLOBRES_CHNR_Msk           ( 0x1fUL << VADC_GLOBRES_CHNR_Pos )                       /*!< VADC GLOBRES: CHNR Mask                 */
    #define VADC_GLOBRES_EMUX_Pos           25                                                        /*!< VADC GLOBRES: EMUX Position             */
    #define VADC_GLOBRES_EMUX_Msk           ( 0x07UL << VADC_GLOBRES_EMUX_Pos )                       /*!< VADC GLOBRES: EMUX Mask                 */
    #define VADC_GLOBRES_CRS_Pos            28                                                        /*!< VADC GLOBRES: CRS Position              */
    #define VADC_GLOBRES_CRS_Msk            ( 0x03UL << VADC_GLOBRES_CRS_Pos )                        /*!< VADC GLOBRES: CRS Mask                  */
    #define VADC_GLOBRES_FCR_Pos            30                                                        /*!< VADC GLOBRES: FCR Position              */
    #define VADC_GLOBRES_FCR_Msk            ( 0x01UL << VADC_GLOBRES_FCR_Pos )                        /*!< VADC GLOBRES: FCR Mask                  */
    #define VADC_GLOBRES_VF_Pos             31                                                        /*!< VADC GLOBRES: VF Position               */
    #define VADC_GLOBRES_VF_Msk             ( 0x01UL << VADC_GLOBRES_VF_Pos )                         /*!< VADC GLOBRES: VF Mask                   */

/* --------------------------------  VADC_GLOBRESD  ------------------------------- */
    #define VADC_GLOBRESD_RESULT_Pos        0                                                         /*!< VADC GLOBRESD: RESULT Position          */
    #define VADC_GLOBRESD_RESULT_Msk        ( 0x0000ffffUL << VADC_GLOBRESD_RESULT_Pos )              /*!< VADC GLOBRESD: RESULT Mask              */
    #define VADC_GLOBRESD_GNR_Pos           16                                                        /*!< VADC GLOBRESD: GNR Position             */
    #define VADC_GLOBRESD_GNR_Msk           ( 0x0fUL << VADC_GLOBRESD_GNR_Pos )                       /*!< VADC GLOBRESD: GNR Mask                 */
    #define VADC_GLOBRESD_CHNR_Pos          20                                                        /*!< VADC GLOBRESD: CHNR Position            */
    #define VADC_GLOBRESD_CHNR_Msk          ( 0x1fUL << VADC_GLOBRESD_CHNR_Pos )                      /*!< VADC GLOBRESD: CHNR Mask                */
    #define VADC_GLOBRESD_EMUX_Pos          25                                                        /*!< VADC GLOBRESD: EMUX Position            */
    #define VADC_GLOBRESD_EMUX_Msk          ( 0x07UL << VADC_GLOBRESD_EMUX_Pos )                      /*!< VADC GLOBRESD: EMUX Mask                */
    #define VADC_GLOBRESD_CRS_Pos           28                                                        /*!< VADC GLOBRESD: CRS Position             */
    #define VADC_GLOBRESD_CRS_Msk           ( 0x03UL << VADC_GLOBRESD_CRS_Pos )                       /*!< VADC GLOBRESD: CRS Mask                 */
    #define VADC_GLOBRESD_FCR_Pos           30                                                        /*!< VADC GLOBRESD: FCR Position             */
    #define VADC_GLOBRESD_FCR_Msk           ( 0x01UL << VADC_GLOBRESD_FCR_Pos )                       /*!< VADC GLOBRESD: FCR Mask                 */
    #define VADC_GLOBRESD_VF_Pos            31                                                        /*!< VADC GLOBRESD: VF Position              */
    #define VADC_GLOBRESD_VF_Msk            ( 0x01UL << VADC_GLOBRESD_VF_Pos )                        /*!< VADC GLOBRESD: VF Mask                  */

/* --------------------------------  VADC_EMUXSEL  -------------------------------- */
    #define VADC_EMUXSEL_EMUXGRP0_Pos       0                                                         /*!< VADC EMUXSEL: EMUXGRP0 Position         */
    #define VADC_EMUXSEL_EMUXGRP0_Msk       ( 0x0fUL << VADC_EMUXSEL_EMUXGRP0_Pos )                   /*!< VADC EMUXSEL: EMUXGRP0 Mask             */
    #define VADC_EMUXSEL_EMUXGRP1_Pos       4                                                         /*!< VADC EMUXSEL: EMUXGRP1 Position         */
    #define VADC_EMUXSEL_EMUXGRP1_Msk       ( 0x0fUL << VADC_EMUXSEL_EMUXGRP1_Pos )                   /*!< VADC EMUXSEL: EMUXGRP1 Mask             */


/* ================================================================================ */
/* ================         Group 'VADC_G' Position & Mask         ================ */
/* ================================================================================ */


/* --------------------------------  VADC_G_ARBCFG  ------------------------------- */
    #define VADC_G_ARBCFG_ANONC_Pos        0                                                          /*!< VADC_G ARBCFG: ANONC Position           */
    #define VADC_G_ARBCFG_ANONC_Msk        ( 0x03UL << VADC_G_ARBCFG_ANONC_Pos )                      /*!< VADC_G ARBCFG: ANONC Mask               */
    #define VADC_G_ARBCFG_ARBRND_Pos       4                                                          /*!< VADC_G ARBCFG: ARBRND Position          */
    #define VADC_G_ARBCFG_ARBRND_Msk       ( 0x03UL << VADC_G_ARBCFG_ARBRND_Pos )                     /*!< VADC_G ARBCFG: ARBRND Mask              */
    #define VADC_G_ARBCFG_ARBM_Pos         7                                                          /*!< VADC_G ARBCFG: ARBM Position            */
    #define VADC_G_ARBCFG_ARBM_Msk         ( 0x01UL << VADC_G_ARBCFG_ARBM_Pos )                       /*!< VADC_G ARBCFG: ARBM Mask                */
    #define VADC_G_ARBCFG_ANONS_Pos        16                                                         /*!< VADC_G ARBCFG: ANONS Position           */
    #define VADC_G_ARBCFG_ANONS_Msk        ( 0x03UL << VADC_G_ARBCFG_ANONS_Pos )                      /*!< VADC_G ARBCFG: ANONS Mask               */
    #define VADC_G_ARBCFG_CSRC_Pos         18                                                         /*!< VADC_G ARBCFG: CSRC Position            */
    #define VADC_G_ARBCFG_CSRC_Msk         ( 0x03UL << VADC_G_ARBCFG_CSRC_Pos )                       /*!< VADC_G ARBCFG: CSRC Mask                */
    #define VADC_G_ARBCFG_CHNR_Pos         20                                                         /*!< VADC_G ARBCFG: CHNR Position            */
    #define VADC_G_ARBCFG_CHNR_Msk         ( 0x1fUL << VADC_G_ARBCFG_CHNR_Pos )                       /*!< VADC_G ARBCFG: CHNR Mask                */
    #define VADC_G_ARBCFG_SYNRUN_Pos       25                                                         /*!< VADC_G ARBCFG: SYNRUN Position          */
    #define VADC_G_ARBCFG_SYNRUN_Msk       ( 0x01UL << VADC_G_ARBCFG_SYNRUN_Pos )                     /*!< VADC_G ARBCFG: SYNRUN Mask              */
    #define VADC_G_ARBCFG_CAL_Pos          28                                                         /*!< VADC_G ARBCFG: CAL Position             */
    #define VADC_G_ARBCFG_CAL_Msk          ( 0x01UL << VADC_G_ARBCFG_CAL_Pos )                        /*!< VADC_G ARBCFG: CAL Mask                 */
    #define VADC_G_ARBCFG_CALS_Pos         29                                                         /*!< VADC_G ARBCFG: CALS Position            */
    #define VADC_G_ARBCFG_CALS_Msk         ( 0x01UL << VADC_G_ARBCFG_CALS_Pos )                       /*!< VADC_G ARBCFG: CALS Mask                */
    #define VADC_G_ARBCFG_BUSY_Pos         30                                                         /*!< VADC_G ARBCFG: BUSY Position            */
    #define VADC_G_ARBCFG_BUSY_Msk         ( 0x01UL << VADC_G_ARBCFG_BUSY_Pos )                       /*!< VADC_G ARBCFG: BUSY Mask                */
    #define VADC_G_ARBCFG_SAMPLE_Pos       31                                                         /*!< VADC_G ARBCFG: SAMPLE Position          */
    #define VADC_G_ARBCFG_SAMPLE_Msk       ( 0x01UL << VADC_G_ARBCFG_SAMPLE_Pos )                     /*!< VADC_G ARBCFG: SAMPLE Mask              */

