FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_ARBPR  -------------------------------- */
    #define VADC_G_ARBPR_PRIO0_Pos         0                                                          /*!< VADC_G ARBPR: PRIO0 Position            */
    #define VADC_G_ARBPR_PRIO0_Msk         ( 0x03UL << VADC_G_ARBPR_PRIO0_Pos )                       /*!< VADC_G ARBPR: PRIO0 Mask                */
    #define VADC_G_ARBPR_CSM0_Pos          3                                                          /*!< VADC_G ARBPR: CSM0 Position             */
    #define VADC_G_ARBPR_CSM0_Msk          ( 0x01UL << VADC_G_ARBPR_CSM0_Pos )                        /*!< VADC_G ARBPR: CSM0 Mask                 */
    #define VADC_G_ARBPR_PRIO1_Pos         4                                                          /*!< VADC_G ARBPR: PRIO1 Position            */
    #define VADC_G_ARBPR_PRIO1_Msk         ( 0x03UL << VADC_G_ARBPR_PRIO1_Pos )                       /*!< VADC_G ARBPR: PRIO1 Mask                */
    #define VADC_G_ARBPR_CSM1_Pos          7                                                          /*!< VADC_G ARBPR: CSM1 Position             */
    #define VADC_G_ARBPR_CSM1_Msk          ( 0x01UL << VADC_G_ARBPR_CSM1_Pos )                        /*!< VADC_G ARBPR: CSM1 Mask                 */
    #define VADC_G_ARBPR_PRIO2_Pos         8                                                          /*!< VADC_G ARBPR: PRIO2 Position            */
    #define VADC_G_ARBPR_PRIO2_Msk         ( 0x03UL << VADC_G_ARBPR_PRIO2_Pos )                       /*!< VADC_G ARBPR: PRIO2 Mask                */
    #define VADC_G_ARBPR_CSM2_Pos          11                                                         /*!< VADC_G ARBPR: CSM2 Position             */
    #define VADC_G_ARBPR_CSM2_Msk          ( 0x01UL << VADC_G_ARBPR_CSM2_Pos )                        /*!< VADC_G ARBPR: CSM2 Mask                 */
    #define VADC_G_ARBPR_ASEN0_Pos         24                                                         /*!< VADC_G ARBPR: ASEN0 Position            */
    #define VADC_G_ARBPR_ASEN0_Msk         ( 0x01UL << VADC_G_ARBPR_ASEN0_Pos )                       /*!< VADC_G ARBPR: ASEN0 Mask                */
    #define VADC_G_ARBPR_ASEN1_Pos         25                                                         /*!< VADC_G ARBPR: ASEN1 Position            */
    #define VADC_G_ARBPR_ASEN1_Msk         ( 0x01UL << VADC_G_ARBPR_ASEN1_Pos )                       /*!< VADC_G ARBPR: ASEN1 Mask                */
    #define VADC_G_ARBPR_ASEN2_Pos         26                                                         /*!< VADC_G ARBPR: ASEN2 Position            */
    #define VADC_G_ARBPR_ASEN2_Msk         ( 0x01UL << VADC_G_ARBPR_ASEN2_Pos )                       /*!< VADC_G ARBPR: ASEN2 Mask                */

/* --------------------------------  VADC_G_CHASS  -------------------------------- */
    #define VADC_G_CHASS_ASSCH0_Pos        0                                                          /*!< VADC_G CHASS: ASSCH0 Position           */
    #define VADC_G_CHASS_ASSCH0_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH0_Pos )                      /*!< VADC_G CHASS: ASSCH0 Mask               */
    #define VADC_G_CHASS_ASSCH1_Pos        1                                                          /*!< VADC_G CHASS: ASSCH1 Position           */
    #define VADC_G_CHASS_ASSCH1_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH1_Pos )                      /*!< VADC_G CHASS: ASSCH1 Mask               */
    #define VADC_G_CHASS_ASSCH2_Pos        2                                                          /*!< VADC_G CHASS: ASSCH2 Position           */
    #define VADC_G_CHASS_ASSCH2_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH2_Pos )                      /*!< VADC_G CHASS: ASSCH2 Mask               */
    #define VADC_G_CHASS_ASSCH3_Pos        3                                                          /*!< VADC_G CHASS: ASSCH3 Position           */
    #define VADC_G_CHASS_ASSCH3_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH3_Pos )                      /*!< VADC_G CHASS: ASSCH3 Mask               */
    #define VADC_G_CHASS_ASSCH4_Pos        4                                                          /*!< VADC_G CHASS: ASSCH4 Position           */
    #define VADC_G_CHASS_ASSCH4_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH4_Pos )                      /*!< VADC_G CHASS: ASSCH4 Mask               */
    #define VADC_G_CHASS_ASSCH5_Pos        5                                                          /*!< VADC_G CHASS: ASSCH5 Position           */
    #define VADC_G_CHASS_ASSCH5_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH5_Pos )                      /*!< VADC_G CHASS: ASSCH5 Mask               */
    #define VADC_G_CHASS_ASSCH6_Pos        6                                                          /*!< VADC_G CHASS: ASSCH6 Position           */
    #define VADC_G_CHASS_ASSCH6_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH6_Pos )                      /*!< VADC_G CHASS: ASSCH6 Mask               */
    #define VADC_G_CHASS_ASSCH7_Pos        7                                                          /*!< VADC_G CHASS: ASSCH7 Position           */
    #define VADC_G_CHASS_ASSCH7_Msk        ( 0x01UL << VADC_G_CHASS_ASSCH7_Pos )                      /*!< VADC_G CHASS: ASSCH7 Mask               */

/* --------------------------------  VADC_G_RRASS  -------------------------------- */
    #define VADC_G_RRASS_ASSRR0_Pos        0                                                          /*!< VADC_G RRASS: ASSRR0 Position           */
    #define VADC_G_RRASS_ASSRR0_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR0_Pos )                      /*!< VADC_G RRASS: ASSRR0 Mask               */
    #define VADC_G_RRASS_ASSRR1_Pos        1                                                          /*!< VADC_G RRASS: ASSRR1 Position           */
    #define VADC_G_RRASS_ASSRR1_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR1_Pos )                      /*!< VADC_G RRASS: ASSRR1 Mask               */
    #define VADC_G_RRASS_ASSRR2_Pos        2                                                          /*!< VADC_G RRASS: ASSRR2 Position           */
    #define VADC_G_RRASS_ASSRR2_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR2_Pos )                      /*!< VADC_G RRASS: ASSRR2 Mask               */
    #define VADC_G_RRASS_ASSRR3_Pos        3                                                          /*!< VADC_G RRASS: ASSRR3 Position           */
    #define VADC_G_RRASS_ASSRR3_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR3_Pos )                      /*!< VADC_G RRASS: ASSRR3 Mask               */
    #define VADC_G_RRASS_ASSRR4_Pos        4                                                          /*!< VADC_G RRASS: ASSRR4 Position           */
    #define VADC_G_RRASS_ASSRR4_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR4_Pos )                      /*!< VADC_G RRASS: ASSRR4 Mask               */
    #define VADC_G_RRASS_ASSRR5_Pos        5                                                          /*!< VADC_G RRASS: ASSRR5 Position           */
    #define VADC_G_RRASS_ASSRR5_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR5_Pos )                      /*!< VADC_G RRASS: ASSRR5 Mask               */
    #define VADC_G_RRASS_ASSRR6_Pos        6                                                          /*!< VADC_G RRASS: ASSRR6 Position           */
    #define VADC_G_RRASS_ASSRR6_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR6_Pos )                      /*!< VADC_G RRASS: ASSRR6 Mask               */
    #define VADC_G_RRASS_ASSRR7_Pos        7                                                          /*!< VADC_G RRASS: ASSRR7 Position           */
    #define VADC_G_RRASS_ASSRR7_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR7_Pos )                      /*!< VADC_G RRASS: ASSRR7 Mask               */
    #define VADC_G_RRASS_ASSRR8_Pos        8                                                          /*!< VADC_G RRASS: ASSRR8 Position           */
    #define VADC_G_RRASS_ASSRR8_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR8_Pos )                      /*!< VADC_G RRASS: ASSRR8 Mask               */
    #define VADC_G_RRASS_ASSRR9_Pos        9                                                          /*!< VADC_G RRASS: ASSRR9 Position           */
    #define VADC_G_RRASS_ASSRR9_Msk        ( 0x01UL << VADC_G_RRASS_ASSRR9_Pos )                      /*!< VADC_G RRASS: ASSRR9 Mask               */
    #define VADC_G_RRASS_ASSRR10_Pos       10                                                         /*!< VADC_G RRASS: ASSRR10 Position          */
    #define VADC_G_RRASS_ASSRR10_Msk       ( 0x01UL << VADC_G_RRASS_ASSRR10_Pos )                     /*!< VADC_G RRASS: ASSRR10 Mask              */
    #define VADC_G_RRASS_ASSRR11_Pos       11                                                         /*!< VADC_G RRASS: ASSRR11 Position          */
    #define VADC_G_RRASS_ASSRR11_Msk       ( 0x01UL << VADC_G_RRASS_ASSRR11_Pos )                     /*!< VADC_G RRASS: ASSRR11 Mask              */
    #define VADC_G_RRASS_ASSRR12_Pos       12                                                         /*!< VADC_G RRASS: ASSRR12 Position          */
    #define VADC_G_RRASS_ASSRR12_Msk       ( 0x01UL << VADC_G_RRASS_ASSRR12_Pos )                     /*!< VADC_G RRASS: ASSRR12 Mask              */
    #define VADC_G_RRASS_ASSRR13_Pos       13                                                         /*!< VADC_G RRASS: ASSRR13 Position          */
    #define VADC_G_RRASS_ASSRR13_Msk       ( 0x01UL << VADC_G_RRASS_ASSRR13_Pos )                     /*!< VADC_G RRASS: ASSRR13 Mask              */
    #define VADC_G_RRASS_ASSRR14_Pos       14                                                         /*!< VADC_G RRASS: ASSRR14 Position          */
    #define VADC_G_RRASS_ASSRR14_Msk       ( 0x01UL << VADC_G_RRASS_ASSRR14_Pos )                     /*!< VADC_G RRASS: ASSRR14 Mask              */
    #define VADC_G_RRASS_ASSRR15_Pos       15                                                         /*!< VADC_G RRASS: ASSRR15 Position          */
    #define VADC_G_RRASS_ASSRR15_Msk       ( 0x01UL << VADC_G_RRASS_ASSRR15_Pos )                     /*!< VADC_G RRASS: ASSRR15 Mask              */

/* --------------------------------  VADC_G_ICLASS  ------------------------------- */
    #define VADC_G_ICLASS_STCS_Pos         0                                                          /*!< VADC_G ICLASS: STCS Position            */
    #define VADC_G_ICLASS_STCS_Msk         ( 0x1fUL << VADC_G_ICLASS_STCS_Pos )                       /*!< VADC_G ICLASS: STCS Mask                */
    #define VADC_G_ICLASS_CMS_Pos          8                                                          /*!< VADC_G ICLASS: CMS Position             */
    #define VADC_G_ICLASS_CMS_Msk          ( 0x07UL << VADC_G_ICLASS_CMS_Pos )                        /*!< VADC_G ICLASS: CMS Mask                 */
    #define VADC_G_ICLASS_STCE_Pos         16                                                         /*!< VADC_G ICLASS: STCE Position            */
    #define VADC_G_ICLASS_STCE_Msk         ( 0x1fUL << VADC_G_ICLASS_STCE_Pos )                       /*!< VADC_G ICLASS: STCE Mask                */
    #define VADC_G_ICLASS_CME_Pos          24                                                         /*!< VADC_G ICLASS: CME Position             */
    #define VADC_G_ICLASS_CME_Msk          ( 0x07UL << VADC_G_ICLASS_CME_Pos )                        /*!< VADC_G ICLASS: CME Mask                 */

/* --------------------------------  VADC_G_ALIAS  -------------------------------- */
    #define VADC_G_ALIAS_ALIAS0_Pos        0                                                          /*!< VADC_G ALIAS: ALIAS0 Position           */
    #define VADC_G_ALIAS_ALIAS0_Msk        ( 0x1fUL << VADC_G_ALIAS_ALIAS0_Pos )                      /*!< VADC_G ALIAS: ALIAS0 Mask               */
    #define VADC_G_ALIAS_ALIAS1_Pos        8                                                          /*!< VADC_G ALIAS: ALIAS1 Position           */
    #define VADC_G_ALIAS_ALIAS1_Msk        ( 0x1fUL << VADC_G_ALIAS_ALIAS1_Pos )                      /*!< VADC_G ALIAS: ALIAS1 Mask               */

