FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_BOUND  -------------------------------- */
    #define VADC_G_BOUND_BOUNDARY0_Pos     0                                                          /*!< VADC_G BOUND: BOUNDARY0 Position        */
    #define VADC_G_BOUND_BOUNDARY0_Msk     ( 0x00000fffUL << VADC_G_BOUND_BOUNDARY0_Pos )             /*!< VADC_G BOUND: BOUNDARY0 Mask            */
    #define VADC_G_BOUND_BOUNDARY1_Pos     16                                                         /*!< VADC_G BOUND: BOUNDARY1 Position        */
    #define VADC_G_BOUND_BOUNDARY1_Msk     ( 0x00000fffUL << VADC_G_BOUND_BOUNDARY1_Pos )             /*!< VADC_G BOUND: BOUNDARY1 Mask            */

/* --------------------------------  VADC_G_SYNCTR  ------------------------------- */
    #define VADC_G_SYNCTR_STSEL_Pos        0                                                          /*!< VADC_G SYNCTR: STSEL Position           */
    #define VADC_G_SYNCTR_STSEL_Msk        ( 0x03UL << VADC_G_SYNCTR_STSEL_Pos )                      /*!< VADC_G SYNCTR: STSEL Mask               */
    #define VADC_G_SYNCTR_EVALR1_Pos       4                                                          /*!< VADC_G SYNCTR: EVALR1 Position          */
    #define VADC_G_SYNCTR_EVALR1_Msk       ( 0x01UL << VADC_G_SYNCTR_EVALR1_Pos )                     /*!< VADC_G SYNCTR: EVALR1 Mask              */

/* ---------------------------------  VADC_G_BFL  --------------------------------- */
    #define VADC_G_BFL_BFL0_Pos            0                                                          /*!< VADC_G BFL: BFL0 Position               */
    #define VADC_G_BFL_BFL0_Msk            ( 0x01UL << VADC_G_BFL_BFL0_Pos )                          /*!< VADC_G BFL: BFL0 Mask                   */
    #define VADC_G_BFL_BFL1_Pos            1                                                          /*!< VADC_G BFL: BFL1 Position               */
    #define VADC_G_BFL_BFL1_Msk            ( 0x01UL << VADC_G_BFL_BFL1_Pos )                          /*!< VADC_G BFL: BFL1 Mask                   */
    #define VADC_G_BFL_BFL2_Pos            2                                                          /*!< VADC_G BFL: BFL2 Position               */
    #define VADC_G_BFL_BFL2_Msk            ( 0x01UL << VADC_G_BFL_BFL2_Pos )                          /*!< VADC_G BFL: BFL2 Mask                   */
    #define VADC_G_BFL_BFL3_Pos            3                                                          /*!< VADC_G BFL: BFL3 Position               */
    #define VADC_G_BFL_BFL3_Msk            ( 0x01UL << VADC_G_BFL_BFL3_Pos )                          /*!< VADC_G BFL: BFL3 Mask                   */
    #define VADC_G_BFL_BFA0_Pos            8                                                          /*!< VADC_G BFL: BFA0 Position               */
    #define VADC_G_BFL_BFA0_Msk            ( 0x01UL << VADC_G_BFL_BFA0_Pos )                          /*!< VADC_G BFL: BFA0 Mask                   */
    #define VADC_G_BFL_BFA1_Pos            9                                                          /*!< VADC_G BFL: BFA1 Position               */
    #define VADC_G_BFL_BFA1_Msk            ( 0x01UL << VADC_G_BFL_BFA1_Pos )                          /*!< VADC_G BFL: BFA1 Mask                   */
    #define VADC_G_BFL_BFA2_Pos            10                                                         /*!< VADC_G BFL: BFA2 Position               */
    #define VADC_G_BFL_BFA2_Msk            ( 0x01UL << VADC_G_BFL_BFA2_Pos )                          /*!< VADC_G BFL: BFA2 Mask                   */
    #define VADC_G_BFL_BFA3_Pos            11                                                         /*!< VADC_G BFL: BFA3 Position               */
    #define VADC_G_BFL_BFA3_Msk            ( 0x01UL << VADC_G_BFL_BFA3_Pos )                          /*!< VADC_G BFL: BFA3 Mask                   */
    #define VADC_G_BFL_BFI0_Pos            16                                                         /*!< VADC_G BFL: BFI0 Position               */
    #define VADC_G_BFL_BFI0_Msk            ( 0x01UL << VADC_G_BFL_BFI0_Pos )                          /*!< VADC_G BFL: BFI0 Mask                   */
    #define VADC_G_BFL_BFI1_Pos            17                                                         /*!< VADC_G BFL: BFI1 Position               */
    #define VADC_G_BFL_BFI1_Msk            ( 0x01UL << VADC_G_BFL_BFI1_Pos )                          /*!< VADC_G BFL: BFI1 Mask                   */
    #define VADC_G_BFL_BFI2_Pos            18                                                         /*!< VADC_G BFL: BFI2 Position               */
    #define VADC_G_BFL_BFI2_Msk            ( 0x01UL << VADC_G_BFL_BFI2_Pos )                          /*!< VADC_G BFL: BFI2 Mask                   */
    #define VADC_G_BFL_BFI3_Pos            19                                                         /*!< VADC_G BFL: BFI3 Position               */
    #define VADC_G_BFL_BFI3_Msk            ( 0x01UL << VADC_G_BFL_BFI3_Pos )                          /*!< VADC_G BFL: BFI3 Mask                   */

/* ---------------------------------  VADC_G_BFLS  -------------------------------- */
    #define VADC_G_BFLS_BFC0_Pos           0                                                          /*!< VADC_G BFLS: BFC0 Position              */
    #define VADC_G_BFLS_BFC0_Msk           ( 0x01UL << VADC_G_BFLS_BFC0_Pos )                         /*!< VADC_G BFLS: BFC0 Mask                  */
    #define VADC_G_BFLS_BFC1_Pos           1                                                          /*!< VADC_G BFLS: BFC1 Position              */
    #define VADC_G_BFLS_BFC1_Msk           ( 0x01UL << VADC_G_BFLS_BFC1_Pos )                         /*!< VADC_G BFLS: BFC1 Mask                  */
    #define VADC_G_BFLS_BFC2_Pos           2                                                          /*!< VADC_G BFLS: BFC2 Position              */
    #define VADC_G_BFLS_BFC2_Msk           ( 0x01UL << VADC_G_BFLS_BFC2_Pos )                         /*!< VADC_G BFLS: BFC2 Mask                  */
    #define VADC_G_BFLS_BFC3_Pos           3                                                          /*!< VADC_G BFLS: BFC3 Position              */
    #define VADC_G_BFLS_BFC3_Msk           ( 0x01UL << VADC_G_BFLS_BFC3_Pos )                         /*!< VADC_G BFLS: BFC3 Mask                  */
    #define VADC_G_BFLS_BFS0_Pos           16                                                         /*!< VADC_G BFLS: BFS0 Position              */
    #define VADC_G_BFLS_BFS0_Msk           ( 0x01UL << VADC_G_BFLS_BFS0_Pos )                         /*!< VADC_G BFLS: BFS0 Mask                  */
    #define VADC_G_BFLS_BFS1_Pos           17                                                         /*!< VADC_G BFLS: BFS1 Position              */
    #define VADC_G_BFLS_BFS1_Msk           ( 0x01UL << VADC_G_BFLS_BFS1_Pos )                         /*!< VADC_G BFLS: BFS1 Mask                  */
    #define VADC_G_BFLS_BFS2_Pos           18                                                         /*!< VADC_G BFLS: BFS2 Position              */
    #define VADC_G_BFLS_BFS2_Msk           ( 0x01UL << VADC_G_BFLS_BFS2_Pos )                         /*!< VADC_G BFLS: BFS2 Mask                  */
    #define VADC_G_BFLS_BFS3_Pos           19                                                         /*!< VADC_G BFLS: BFS3 Position              */
    #define VADC_G_BFLS_BFS3_Msk           ( 0x01UL << VADC_G_BFLS_BFS3_Pos )                         /*!< VADC_G BFLS: BFS3 Mask                  */

/* ---------------------------------  VADC_G_BFLC  -------------------------------- */
    #define VADC_G_BFLC_BFM0_Pos           0                                                          /*!< VADC_G BFLC: BFM0 Position              */
    #define VADC_G_BFLC_BFM0_Msk           ( 0x0fUL << VADC_G_BFLC_BFM0_Pos )                         /*!< VADC_G BFLC: BFM0 Mask                  */
    #define VADC_G_BFLC_BFM1_Pos           4                                                          /*!< VADC_G BFLC: BFM1 Position              */
    #define VADC_G_BFLC_BFM1_Msk           ( 0x0fUL << VADC_G_BFLC_BFM1_Pos )                         /*!< VADC_G BFLC: BFM1 Mask                  */
    #define VADC_G_BFLC_BFM2_Pos           8                                                          /*!< VADC_G BFLC: BFM2 Position              */
    #define VADC_G_BFLC_BFM2_Msk           ( 0x0fUL << VADC_G_BFLC_BFM2_Pos )                         /*!< VADC_G BFLC: BFM2 Mask                  */
    #define VADC_G_BFLC_BFM3_Pos           12                                                         /*!< VADC_G BFLC: BFM3 Position              */
    #define VADC_G_BFLC_BFM3_Msk           ( 0x0fUL << VADC_G_BFLC_BFM3_Pos )                         /*!< VADC_G BFLC: BFM3 Mask                  */

/* --------------------------------  VADC_G_BFLNP  -------------------------------- */
    #define VADC_G_BFLNP_BFL0NP_Pos        0                                                          /*!< VADC_G BFLNP: BFL0NP Position           */
    #define VADC_G_BFLNP_BFL0NP_Msk        ( 0x0fUL << VADC_G_BFLNP_BFL0NP_Pos )                      /*!< VADC_G BFLNP: BFL0NP Mask               */
    #define VADC_G_BFLNP_BFL1NP_Pos        4                                                          /*!< VADC_G BFLNP: BFL1NP Position           */
    #define VADC_G_BFLNP_BFL1NP_Msk        ( 0x0fUL << VADC_G_BFLNP_BFL1NP_Pos )                      /*!< VADC_G BFLNP: BFL1NP Mask               */
    #define VADC_G_BFLNP_BFL2NP_Pos        8                                                          /*!< VADC_G BFLNP: BFL2NP Position           */
    #define VADC_G_BFLNP_BFL2NP_Msk        ( 0x0fUL << VADC_G_BFLNP_BFL2NP_Pos )                      /*!< VADC_G BFLNP: BFL2NP Mask               */
    #define VADC_G_BFLNP_BFL3NP_Pos        12                                                         /*!< VADC_G BFLNP: BFL3NP Position           */
    #define VADC_G_BFLNP_BFL3NP_Msk        ( 0x0fUL << VADC_G_BFLNP_BFL3NP_Pos )                      /*!< VADC_G BFLNP: BFL3NP Mask               */

