FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_QCTRL0  ------------------------------- */
    #define VADC_G_QCTRL0_SRCRESREG_Pos    0                                                          /*!< VADC_G QCTRL0: SRCRESREG Position       */
    #define VADC_G_QCTRL0_SRCRESREG_Msk    ( 0x0fUL << VADC_G_QCTRL0_SRCRESREG_Pos )                  /*!< VADC_G QCTRL0: SRCRESREG Mask           */
    #define VADC_G_QCTRL0_XTSEL_Pos        8                                                          /*!< VADC_G QCTRL0: XTSEL Position           */
    #define VADC_G_QCTRL0_XTSEL_Msk        ( 0x0fUL << VADC_G_QCTRL0_XTSEL_Pos )                      /*!< VADC_G QCTRL0: XTSEL Mask               */
    #define VADC_G_QCTRL0_XTLVL_Pos        12                                                         /*!< VADC_G QCTRL0: XTLVL Position           */
    #define VADC_G_QCTRL0_XTLVL_Msk        ( 0x01UL << VADC_G_QCTRL0_XTLVL_Pos )                      /*!< VADC_G QCTRL0: XTLVL Mask               */
    #define VADC_G_QCTRL0_XTMODE_Pos       13                                                         /*!< VADC_G QCTRL0: XTMODE Position          */
    #define VADC_G_QCTRL0_XTMODE_Msk       ( 0x03UL << VADC_G_QCTRL0_XTMODE_Pos )                     /*!< VADC_G QCTRL0: XTMODE Mask              */
    #define VADC_G_QCTRL0_XTWC_Pos         15                                                         /*!< VADC_G QCTRL0: XTWC Position            */
    #define VADC_G_QCTRL0_XTWC_Msk         ( 0x01UL << VADC_G_QCTRL0_XTWC_Pos )                       /*!< VADC_G QCTRL0: XTWC Mask                */
    #define VADC_G_QCTRL0_GTSEL_Pos        16                                                         /*!< VADC_G QCTRL0: GTSEL Position           */
    #define VADC_G_QCTRL0_GTSEL_Msk        ( 0x0fUL << VADC_G_QCTRL0_GTSEL_Pos )                      /*!< VADC_G QCTRL0: GTSEL Mask               */
    #define VADC_G_QCTRL0_GTLVL_Pos        20                                                         /*!< VADC_G QCTRL0: GTLVL Position           */
    #define VADC_G_QCTRL0_GTLVL_Msk        ( 0x01UL << VADC_G_QCTRL0_GTLVL_Pos )                      /*!< VADC_G QCTRL0: GTLVL Mask               */
    #define VADC_G_QCTRL0_GTWC_Pos         23                                                         /*!< VADC_G QCTRL0: GTWC Position            */
    #define VADC_G_QCTRL0_GTWC_Msk         ( 0x01UL << VADC_G_QCTRL0_GTWC_Pos )                       /*!< VADC_G QCTRL0: GTWC Mask                */
    #define VADC_G_QCTRL0_TMEN_Pos         28                                                         /*!< VADC_G QCTRL0: TMEN Position            */
    #define VADC_G_QCTRL0_TMEN_Msk         ( 0x01UL << VADC_G_QCTRL0_TMEN_Pos )                       /*!< VADC_G QCTRL0: TMEN Mask                */
    #define VADC_G_QCTRL0_TMWC_Pos         31                                                         /*!< VADC_G QCTRL0: TMWC Position            */
    #define VADC_G_QCTRL0_TMWC_Msk         ( 0x01UL << VADC_G_QCTRL0_TMWC_Pos )                       /*!< VADC_G QCTRL0: TMWC Mask                */

/* ---------------------------------  VADC_G_QMR0  -------------------------------- */
    #define VADC_G_QMR0_ENGT_Pos           0                                                          /*!< VADC_G QMR0: ENGT Position              */
    #define VADC_G_QMR0_ENGT_Msk           ( 0x03UL << VADC_G_QMR0_ENGT_Pos )                         /*!< VADC_G QMR0: ENGT Mask                  */
    #define VADC_G_QMR0_ENTR_Pos           2                                                          /*!< VADC_G QMR0: ENTR Position              */
    #define VADC_G_QMR0_ENTR_Msk           ( 0x01UL << VADC_G_QMR0_ENTR_Pos )                         /*!< VADC_G QMR0: ENTR Mask                  */
    #define VADC_G_QMR0_CLRV_Pos           8                                                          /*!< VADC_G QMR0: CLRV Position              */
    #define VADC_G_QMR0_CLRV_Msk           ( 0x01UL << VADC_G_QMR0_CLRV_Pos )                         /*!< VADC_G QMR0: CLRV Mask                  */
    #define VADC_G_QMR0_TREV_Pos           9                                                          /*!< VADC_G QMR0: TREV Position              */
    #define VADC_G_QMR0_TREV_Msk           ( 0x01UL << VADC_G_QMR0_TREV_Pos )                         /*!< VADC_G QMR0: TREV Mask                  */
    #define VADC_G_QMR0_FLUSH_Pos          10                                                         /*!< VADC_G QMR0: FLUSH Position             */
    #define VADC_G_QMR0_FLUSH_Msk          ( 0x01UL << VADC_G_QMR0_FLUSH_Pos )                        /*!< VADC_G QMR0: FLUSH Mask                 */
    #define VADC_G_QMR0_CEV_Pos            11                                                         /*!< VADC_G QMR0: CEV Position               */
    #define VADC_G_QMR0_CEV_Msk            ( 0x01UL << VADC_G_QMR0_CEV_Pos )                          /*!< VADC_G QMR0: CEV Mask                   */
    #define VADC_G_QMR0_RPTDIS_Pos         16                                                         /*!< VADC_G QMR0: RPTDIS Position            */
    #define VADC_G_QMR0_RPTDIS_Msk         ( 0x01UL << VADC_G_QMR0_RPTDIS_Pos )                       /*!< VADC_G QMR0: RPTDIS Mask                */

/* ---------------------------------  VADC_G_QSR0  -------------------------------- */
    #define VADC_G_QSR0_FILL_Pos           0                                                          /*!< VADC_G QSR0: FILL Position              */
    #define VADC_G_QSR0_FILL_Msk           ( 0x0fUL << VADC_G_QSR0_FILL_Pos )                         /*!< VADC_G QSR0: FILL Mask                  */
    #define VADC_G_QSR0_EMPTY_Pos          5                                                          /*!< VADC_G QSR0: EMPTY Position             */
    #define VADC_G_QSR0_EMPTY_Msk          ( 0x01UL << VADC_G_QSR0_EMPTY_Pos )                        /*!< VADC_G QSR0: EMPTY Mask                 */
    #define VADC_G_QSR0_REQGT_Pos          7                                                          /*!< VADC_G QSR0: REQGT Position             */
    #define VADC_G_QSR0_REQGT_Msk          ( 0x01UL << VADC_G_QSR0_REQGT_Pos )                        /*!< VADC_G QSR0: REQGT Mask                 */
    #define VADC_G_QSR0_EV_Pos             8                                                          /*!< VADC_G QSR0: EV Position                */
    #define VADC_G_QSR0_EV_Msk             ( 0x01UL << VADC_G_QSR0_EV_Pos )                           /*!< VADC_G QSR0: EV Mask                    */

/* ---------------------------------  VADC_G_Q0R0  -------------------------------- */
    #define VADC_G_Q0R0_REQCHNR_Pos        0                                                          /*!< VADC_G Q0R0: REQCHNR Position           */
    #define VADC_G_Q0R0_REQCHNR_Msk        ( 0x1fUL << VADC_G_Q0R0_REQCHNR_Pos )                      /*!< VADC_G Q0R0: REQCHNR Mask               */
    #define VADC_G_Q0R0_RF_Pos             5                                                          /*!< VADC_G Q0R0: RF Position                */
    #define VADC_G_Q0R0_RF_Msk             ( 0x01UL << VADC_G_Q0R0_RF_Pos )                           /*!< VADC_G Q0R0: RF Mask                    */
    #define VADC_G_Q0R0_ENSI_Pos           6                                                          /*!< VADC_G Q0R0: ENSI Position              */
    #define VADC_G_Q0R0_ENSI_Msk           ( 0x01UL << VADC_G_Q0R0_ENSI_Pos )                         /*!< VADC_G Q0R0: ENSI Mask                  */
    #define VADC_G_Q0R0_EXTR_Pos           7                                                          /*!< VADC_G Q0R0: EXTR Position              */
    #define VADC_G_Q0R0_EXTR_Msk           ( 0x01UL << VADC_G_Q0R0_EXTR_Pos )                         /*!< VADC_G Q0R0: EXTR Mask                  */
    #define VADC_G_Q0R0_V_Pos              8                                                          /*!< VADC_G Q0R0: V Position                 */
    #define VADC_G_Q0R0_V_Msk              ( 0x01UL << VADC_G_Q0R0_V_Pos )                            /*!< VADC_G Q0R0: V Mask                     */

/* --------------------------------  VADC_G_QINR0  -------------------------------- */
    #define VADC_G_QINR0_REQCHNR_Pos       0                                                          /*!< VADC_G QINR0: REQCHNR Position          */
    #define VADC_G_QINR0_REQCHNR_Msk       ( 0x1fUL << VADC_G_QINR0_REQCHNR_Pos )                     /*!< VADC_G QINR0: REQCHNR Mask              */
    #define VADC_G_QINR0_RF_Pos            5                                                          /*!< VADC_G QINR0: RF Position               */
    #define VADC_G_QINR0_RF_Msk            ( 0x01UL << VADC_G_QINR0_RF_Pos )                          /*!< VADC_G QINR0: RF Mask                   */
    #define VADC_G_QINR0_ENSI_Pos          6                                                          /*!< VADC_G QINR0: ENSI Position             */
    #define VADC_G_QINR0_ENSI_Msk          ( 0x01UL << VADC_G_QINR0_ENSI_Pos )                        /*!< VADC_G QINR0: ENSI Mask                 */
    #define VADC_G_QINR0_EXTR_Pos          7                                                          /*!< VADC_G QINR0: EXTR Position             */
    #define VADC_G_QINR0_EXTR_Msk          ( 0x01UL << VADC_G_QINR0_EXTR_Pos )                        /*!< VADC_G QINR0: EXTR Mask                 */

