FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_QBUR0  -------------------------------- */
    #define VADC_G_QBUR0_REQCHNR_Pos       0                                                          /*!< VADC_G QBUR0: REQCHNR Position          */
    #define VADC_G_QBUR0_REQCHNR_Msk       ( 0x1fUL << VADC_G_QBUR0_REQCHNR_Pos )                     /*!< VADC_G QBUR0: REQCHNR Mask              */
    #define VADC_G_QBUR0_RF_Pos            5                                                          /*!< VADC_G QBUR0: RF Position               */
    #define VADC_G_QBUR0_RF_Msk            ( 0x01UL << VADC_G_QBUR0_RF_Pos )                          /*!< VADC_G QBUR0: RF Mask                   */
    #define VADC_G_QBUR0_ENSI_Pos          6                                                          /*!< VADC_G QBUR0: ENSI Position             */
    #define VADC_G_QBUR0_ENSI_Msk          ( 0x01UL << VADC_G_QBUR0_ENSI_Pos )                        /*!< VADC_G QBUR0: ENSI Mask                 */
    #define VADC_G_QBUR0_EXTR_Pos          7                                                          /*!< VADC_G QBUR0: EXTR Position             */
    #define VADC_G_QBUR0_EXTR_Msk          ( 0x01UL << VADC_G_QBUR0_EXTR_Pos )                        /*!< VADC_G QBUR0: EXTR Mask                 */
    #define VADC_G_QBUR0_V_Pos             8                                                          /*!< VADC_G QBUR0: V Position                */
    #define VADC_G_QBUR0_V_Msk             ( 0x01UL << VADC_G_QBUR0_V_Pos )                           /*!< VADC_G QBUR0: V Mask                    */

/* --------------------------------  VADC_G_ASCTRL  ------------------------------- */
    #define VADC_G_ASCTRL_SRCRESREG_Pos    0                                                          /*!< VADC_G ASCTRL: SRCRESREG Position       */
    #define VADC_G_ASCTRL_SRCRESREG_Msk    ( 0x0fUL << VADC_G_ASCTRL_SRCRESREG_Pos )                  /*!< VADC_G ASCTRL: SRCRESREG Mask           */
    #define VADC_G_ASCTRL_XTSEL_Pos        8                                                          /*!< VADC_G ASCTRL: XTSEL Position           */
    #define VADC_G_ASCTRL_XTSEL_Msk        ( 0x0fUL << VADC_G_ASCTRL_XTSEL_Pos )                      /*!< VADC_G ASCTRL: XTSEL Mask               */
    #define VADC_G_ASCTRL_XTLVL_Pos        12                                                         /*!< VADC_G ASCTRL: XTLVL Position           */
    #define VADC_G_ASCTRL_XTLVL_Msk        ( 0x01UL << VADC_G_ASCTRL_XTLVL_Pos )                      /*!< VADC_G ASCTRL: XTLVL Mask               */
    #define VADC_G_ASCTRL_XTMODE_Pos       13                                                         /*!< VADC_G ASCTRL: XTMODE Position          */
    #define VADC_G_ASCTRL_XTMODE_Msk       ( 0x03UL << VADC_G_ASCTRL_XTMODE_Pos )                     /*!< VADC_G ASCTRL: XTMODE Mask              */
    #define VADC_G_ASCTRL_XTWC_Pos         15                                                         /*!< VADC_G ASCTRL: XTWC Position            */
    #define VADC_G_ASCTRL_XTWC_Msk         ( 0x01UL << VADC_G_ASCTRL_XTWC_Pos )                       /*!< VADC_G ASCTRL: XTWC Mask                */
    #define VADC_G_ASCTRL_GTSEL_Pos        16                                                         /*!< VADC_G ASCTRL: GTSEL Position           */
    #define VADC_G_ASCTRL_GTSEL_Msk        ( 0x0fUL << VADC_G_ASCTRL_GTSEL_Pos )                      /*!< VADC_G ASCTRL: GTSEL Mask               */
    #define VADC_G_ASCTRL_GTLVL_Pos        20                                                         /*!< VADC_G ASCTRL: GTLVL Position           */
    #define VADC_G_ASCTRL_GTLVL_Msk        ( 0x01UL << VADC_G_ASCTRL_GTLVL_Pos )                      /*!< VADC_G ASCTRL: GTLVL Mask               */
    #define VADC_G_ASCTRL_GTWC_Pos         23                                                         /*!< VADC_G ASCTRL: GTWC Position            */
    #define VADC_G_ASCTRL_GTWC_Msk         ( 0x01UL << VADC_G_ASCTRL_GTWC_Pos )                       /*!< VADC_G ASCTRL: GTWC Mask                */
    #define VADC_G_ASCTRL_TMEN_Pos         28                                                         /*!< VADC_G ASCTRL: TMEN Position            */
    #define VADC_G_ASCTRL_TMEN_Msk         ( 0x01UL << VADC_G_ASCTRL_TMEN_Pos )                       /*!< VADC_G ASCTRL: TMEN Mask                */
    #define VADC_G_ASCTRL_TMWC_Pos         31                                                         /*!< VADC_G ASCTRL: TMWC Position            */
    #define VADC_G_ASCTRL_TMWC_Msk         ( 0x01UL << VADC_G_ASCTRL_TMWC_Pos )                       /*!< VADC_G ASCTRL: TMWC Mask                */

/* ---------------------------------  VADC_G_ASMR  -------------------------------- */
    #define VADC_G_ASMR_ENGT_Pos           0                                                          /*!< VADC_G ASMR: ENGT Position              */
    #define VADC_G_ASMR_ENGT_Msk           ( 0x03UL << VADC_G_ASMR_ENGT_Pos )                         /*!< VADC_G ASMR: ENGT Mask                  */
    #define VADC_G_ASMR_ENTR_Pos           2                                                          /*!< VADC_G ASMR: ENTR Position              */
    #define VADC_G_ASMR_ENTR_Msk           ( 0x01UL << VADC_G_ASMR_ENTR_Pos )                         /*!< VADC_G ASMR: ENTR Mask                  */
    #define VADC_G_ASMR_ENSI_Pos           3                                                          /*!< VADC_G ASMR: ENSI Position              */
    #define VADC_G_ASMR_ENSI_Msk           ( 0x01UL << VADC_G_ASMR_ENSI_Pos )                         /*!< VADC_G ASMR: ENSI Mask                  */
    #define VADC_G_ASMR_SCAN_Pos           4                                                          /*!< VADC_G ASMR: SCAN Position              */
    #define VADC_G_ASMR_SCAN_Msk           ( 0x01UL << VADC_G_ASMR_SCAN_Pos )                         /*!< VADC_G ASMR: SCAN Mask                  */
    #define VADC_G_ASMR_LDM_Pos            5                                                          /*!< VADC_G ASMR: LDM Position               */
    #define VADC_G_ASMR_LDM_Msk            ( 0x01UL << VADC_G_ASMR_LDM_Pos )                          /*!< VADC_G ASMR: LDM Mask                   */
    #define VADC_G_ASMR_REQGT_Pos          7                                                          /*!< VADC_G ASMR: REQGT Position             */
    #define VADC_G_ASMR_REQGT_Msk          ( 0x01UL << VADC_G_ASMR_REQGT_Pos )                        /*!< VADC_G ASMR: REQGT Mask                 */
    #define VADC_G_ASMR_CLRPND_Pos         8                                                          /*!< VADC_G ASMR: CLRPND Position            */
    #define VADC_G_ASMR_CLRPND_Msk         ( 0x01UL << VADC_G_ASMR_CLRPND_Pos )                       /*!< VADC_G ASMR: CLRPND Mask                */
    #define VADC_G_ASMR_LDEV_Pos           9                                                          /*!< VADC_G ASMR: LDEV Position              */
    #define VADC_G_ASMR_LDEV_Msk           ( 0x01UL << VADC_G_ASMR_LDEV_Pos )                         /*!< VADC_G ASMR: LDEV Mask                  */
    #define VADC_G_ASMR_RPTDIS_Pos         16                                                         /*!< VADC_G ASMR: RPTDIS Position            */
    #define VADC_G_ASMR_RPTDIS_Msk         ( 0x01UL << VADC_G_ASMR_RPTDIS_Pos )                       /*!< VADC_G ASMR: RPTDIS Mask                */

/* --------------------------------  VADC_G_ASSEL  -------------------------------- */
    #define VADC_G_ASSEL_CHSEL0_Pos        0                                                          /*!< VADC_G ASSEL: CHSEL0 Position           */
    #define VADC_G_ASSEL_CHSEL0_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL0_Pos )                      /*!< VADC_G ASSEL: CHSEL0 Mask               */
    #define VADC_G_ASSEL_CHSEL1_Pos        1                                                          /*!< VADC_G ASSEL: CHSEL1 Position           */
    #define VADC_G_ASSEL_CHSEL1_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL1_Pos )                      /*!< VADC_G ASSEL: CHSEL1 Mask               */
    #define VADC_G_ASSEL_CHSEL2_Pos        2                                                          /*!< VADC_G ASSEL: CHSEL2 Position           */
    #define VADC_G_ASSEL_CHSEL2_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL2_Pos )                      /*!< VADC_G ASSEL: CHSEL2 Mask               */
    #define VADC_G_ASSEL_CHSEL3_Pos        3                                                          /*!< VADC_G ASSEL: CHSEL3 Position           */
    #define VADC_G_ASSEL_CHSEL3_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL3_Pos )                      /*!< VADC_G ASSEL: CHSEL3 Mask               */
    #define VADC_G_ASSEL_CHSEL4_Pos        4                                                          /*!< VADC_G ASSEL: CHSEL4 Position           */
    #define VADC_G_ASSEL_CHSEL4_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL4_Pos )                      /*!< VADC_G ASSEL: CHSEL4 Mask               */
    #define VADC_G_ASSEL_CHSEL5_Pos        5                                                          /*!< VADC_G ASSEL: CHSEL5 Position           */
    #define VADC_G_ASSEL_CHSEL5_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL5_Pos )                      /*!< VADC_G ASSEL: CHSEL5 Mask               */
    #define VADC_G_ASSEL_CHSEL6_Pos        6                                                          /*!< VADC_G ASSEL: CHSEL6 Position           */
    #define VADC_G_ASSEL_CHSEL6_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL6_Pos )                      /*!< VADC_G ASSEL: CHSEL6 Mask               */
    #define VADC_G_ASSEL_CHSEL7_Pos        7                                                          /*!< VADC_G ASSEL: CHSEL7 Position           */
    #define VADC_G_ASSEL_CHSEL7_Msk        ( 0x01UL << VADC_G_ASSEL_CHSEL7_Pos )                      /*!< VADC_G ASSEL: CHSEL7 Mask               */

/* --------------------------------  VADC_G_ASPND  -------------------------------- */
    #define VADC_G_ASPND_CHPND0_Pos        0                                                          /*!< VADC_G ASPND: CHPND0 Position           */
    #define VADC_G_ASPND_CHPND0_Msk        ( 0x01UL << VADC_G_ASPND_CHPND0_Pos )                      /*!< VADC_G ASPND: CHPND0 Mask               */
    #define VADC_G_ASPND_CHPND1_Pos        1                                                          /*!< VADC_G ASPND: CHPND1 Position           */
    #define VADC_G_ASPND_CHPND1_Msk        ( 0x01UL << VADC_G_ASPND_CHPND1_Pos )                      /*!< VADC_G ASPND: CHPND1 Mask               */
    #define VADC_G_ASPND_CHPND2_Pos        2                                                          /*!< VADC_G ASPND: CHPND2 Position           */
    #define VADC_G_ASPND_CHPND2_Msk        ( 0x01UL << VADC_G_ASPND_CHPND2_Pos )                      /*!< VADC_G ASPND: CHPND2 Mask               */
    #define VADC_G_ASPND_CHPND3_Pos        3                                                          /*!< VADC_G ASPND: CHPND3 Position           */
    #define VADC_G_ASPND_CHPND3_Msk        ( 0x01UL << VADC_G_ASPND_CHPND3_Pos )                      /*!< VADC_G ASPND: CHPND3 Mask               */
    #define VADC_G_ASPND_CHPND4_Pos        4                                                          /*!< VADC_G ASPND: CHPND4 Position           */
    #define VADC_G_ASPND_CHPND4_Msk        ( 0x01UL << VADC_G_ASPND_CHPND4_Pos )                      /*!< VADC_G ASPND: CHPND4 Mask               */
    #define VADC_G_ASPND_CHPND5_Pos        5                                                          /*!< VADC_G ASPND: CHPND5 Position           */
    #define VADC_G_ASPND_CHPND5_Msk        ( 0x01UL << VADC_G_ASPND_CHPND5_Pos )                      /*!< VADC_G ASPND: CHPND5 Mask               */
    #define VADC_G_ASPND_CHPND6_Pos        6                                                          /*!< VADC_G ASPND: CHPND6 Position           */
    #define VADC_G_ASPND_CHPND6_Msk        ( 0x01UL << VADC_G_ASPND_CHPND6_Pos )                      /*!< VADC_G ASPND: CHPND6 Mask               */
    #define VADC_G_ASPND_CHPND7_Pos        7                                                          /*!< VADC_G ASPND: CHPND7 Position           */
    #define VADC_G_ASPND_CHPND7_Msk        ( 0x01UL << VADC_G_ASPND_CHPND7_Pos )                      /*!< VADC_G ASPND: CHPND7 Mask               */

/* --------------------------------  VADC_G_CEFLAG  ------------------------------- */
    #define VADC_G_CEFLAG_CEV0_Pos         0                                                          /*!< VADC_G CEFLAG: CEV0 Position            */
    #define VADC_G_CEFLAG_CEV0_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV0_Pos )                       /*!< VADC_G CEFLAG: CEV0 Mask                */
    #define VADC_G_CEFLAG_CEV1_Pos         1                                                          /*!< VADC_G CEFLAG: CEV1 Position            */
    #define VADC_G_CEFLAG_CEV1_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV1_Pos )                       /*!< VADC_G CEFLAG: CEV1 Mask                */
    #define VADC_G_CEFLAG_CEV2_Pos         2                                                          /*!< VADC_G CEFLAG: CEV2 Position            */
    #define VADC_G_CEFLAG_CEV2_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV2_Pos )                       /*!< VADC_G CEFLAG: CEV2 Mask                */
    #define VADC_G_CEFLAG_CEV3_Pos         3                                                          /*!< VADC_G CEFLAG: CEV3 Position            */
    #define VADC_G_CEFLAG_CEV3_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV3_Pos )                       /*!< VADC_G CEFLAG: CEV3 Mask                */
    #define VADC_G_CEFLAG_CEV4_Pos         4                                                          /*!< VADC_G CEFLAG: CEV4 Position            */
    #define VADC_G_CEFLAG_CEV4_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV4_Pos )                       /*!< VADC_G CEFLAG: CEV4 Mask                */
    #define VADC_G_CEFLAG_CEV5_Pos         5                                                          /*!< VADC_G CEFLAG: CEV5 Position            */
    #define VADC_G_CEFLAG_CEV5_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV5_Pos )                       /*!< VADC_G CEFLAG: CEV5 Mask                */
    #define VADC_G_CEFLAG_CEV6_Pos         6                                                          /*!< VADC_G CEFLAG: CEV6 Position            */
    #define VADC_G_CEFLAG_CEV6_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV6_Pos )                       /*!< VADC_G CEFLAG: CEV6 Mask                */
    #define VADC_G_CEFLAG_CEV7_Pos         7                                                          /*!< VADC_G CEFLAG: CEV7 Position            */
    #define VADC_G_CEFLAG_CEV7_Msk         ( 0x01UL << VADC_G_CEFLAG_CEV7_Pos )                       /*!< VADC_G CEFLAG: CEV7 Mask                */

/* --------------------------------  VADC_G_REFLAG  ------------------------------- */
    #define VADC_G_REFLAG_REV0_Pos         0                                                          /*!< VADC_G REFLAG: REV0 Position            */
    #define VADC_G_REFLAG_REV0_Msk         ( 0x01UL << VADC_G_REFLAG_REV0_Pos )                       /*!< VADC_G REFLAG: REV0 Mask                */
    #define VADC_G_REFLAG_REV1_Pos         1                                                          /*!< VADC_G REFLAG: REV1 Position            */
    #define VADC_G_REFLAG_REV1_Msk         ( 0x01UL << VADC_G_REFLAG_REV1_Pos )                       /*!< VADC_G REFLAG: REV1 Mask                */
    #define VADC_G_REFLAG_REV2_Pos         2                                                          /*!< VADC_G REFLAG: REV2 Position            */
    #define VADC_G_REFLAG_REV2_Msk         ( 0x01UL << VADC_G_REFLAG_REV2_Pos )                       /*!< VADC_G REFLAG: REV2 Mask                */
    #define VADC_G_REFLAG_REV3_Pos         3                                                          /*!< VADC_G REFLAG: REV3 Position            */
    #define VADC_G_REFLAG_REV3_Msk         ( 0x01UL << VADC_G_REFLAG_REV3_Pos )                       /*!< VADC_G REFLAG: REV3 Mask                */
    #define VADC_G_REFLAG_REV4_Pos         4                                                          /*!< VADC_G REFLAG: REV4 Position            */
    #define VADC_G_REFLAG_REV4_Msk         ( 0x01UL << VADC_G_REFLAG_REV4_Pos )                       /*!< VADC_G REFLAG: REV4 Mask                */
    #define VADC_G_REFLAG_REV5_Pos         5                                                          /*!< VADC_G REFLAG: REV5 Position            */
    #define VADC_G_REFLAG_REV5_Msk         ( 0x01UL << VADC_G_REFLAG_REV5_Pos )                       /*!< VADC_G REFLAG: REV5 Mask                */
    #define VADC_G_REFLAG_REV6_Pos         6                                                          /*!< VADC_G REFLAG: REV6 Position            */
    #define VADC_G_REFLAG_REV6_Msk         ( 0x01UL << VADC_G_REFLAG_REV6_Pos )                       /*!< VADC_G REFLAG: REV6 Mask                */
    #define VADC_G_REFLAG_REV7_Pos         7                                                          /*!< VADC_G REFLAG: REV7 Position            */
    #define VADC_G_REFLAG_REV7_Msk         ( 0x01UL << VADC_G_REFLAG_REV7_Pos )                       /*!< VADC_G REFLAG: REV7 Mask                */
    #define VADC_G_REFLAG_REV8_Pos         8                                                          /*!< VADC_G REFLAG: REV8 Position            */
    #define VADC_G_REFLAG_REV8_Msk         ( 0x01UL << VADC_G_REFLAG_REV8_Pos )                       /*!< VADC_G REFLAG: REV8 Mask                */
    #define VADC_G_REFLAG_REV9_Pos         9                                                          /*!< VADC_G REFLAG: REV9 Position            */
    #define VADC_G_REFLAG_REV9_Msk         ( 0x01UL << VADC_G_REFLAG_REV9_Pos )                       /*!< VADC_G REFLAG: REV9 Mask                */
    #define VADC_G_REFLAG_REV10_Pos        10                                                         /*!< VADC_G REFLAG: REV10 Position           */
    #define VADC_G_REFLAG_REV10_Msk        ( 0x01UL << VADC_G_REFLAG_REV10_Pos )                      /*!< VADC_G REFLAG: REV10 Mask               */
    #define VADC_G_REFLAG_REV11_Pos        11                                                         /*!< VADC_G REFLAG: REV11 Position           */
    #define VADC_G_REFLAG_REV11_Msk        ( 0x01UL << VADC_G_REFLAG_REV11_Pos )                      /*!< VADC_G REFLAG: REV11 Mask               */
    #define VADC_G_REFLAG_REV12_Pos        12                                                         /*!< VADC_G REFLAG: REV12 Position           */
    #define VADC_G_REFLAG_REV12_Msk        ( 0x01UL << VADC_G_REFLAG_REV12_Pos )                      /*!< VADC_G REFLAG: REV12 Mask               */
    #define VADC_G_REFLAG_REV13_Pos        13                                                         /*!< VADC_G REFLAG: REV13 Position           */
    #define VADC_G_REFLAG_REV13_Msk        ( 0x01UL << VADC_G_REFLAG_REV13_Pos )                      /*!< VADC_G REFLAG: REV13 Mask               */
    #define VADC_G_REFLAG_REV14_Pos        14                                                         /*!< VADC_G REFLAG: REV14 Position           */
    #define VADC_G_REFLAG_REV14_Msk        ( 0x01UL << VADC_G_REFLAG_REV14_Pos )                      /*!< VADC_G REFLAG: REV14 Mask               */
    #define VADC_G_REFLAG_REV15_Pos        15                                                         /*!< VADC_G REFLAG: REV15 Position           */
    #define VADC_G_REFLAG_REV15_Msk        ( 0x01UL << VADC_G_REFLAG_REV15_Pos )                      /*!< VADC_G REFLAG: REV15 Mask               */

/* --------------------------------  VADC_G_SEFLAG  ------------------------------- */
    #define VADC_G_SEFLAG_SEV0_Pos         0                                                          /*!< VADC_G SEFLAG: SEV0 Position            */
    #define VADC_G_SEFLAG_SEV0_Msk         ( 0x01UL << VADC_G_SEFLAG_SEV0_Pos )                       /*!< VADC_G SEFLAG: SEV0 Mask                */
    #define VADC_G_SEFLAG_SEV1_Pos         1                                                          /*!< VADC_G SEFLAG: SEV1 Position            */
    #define VADC_G_SEFLAG_SEV1_Msk         ( 0x01UL << VADC_G_SEFLAG_SEV1_Pos )                       /*!< VADC_G SEFLAG: SEV1 Mask                */

