FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_CEFCLR  ------------------------------- */
    #define VADC_G_CEFCLR_CEV0_Pos         0                                                          /*!< VADC_G CEFCLR: CEV0 Position            */
    #define VADC_G_CEFCLR_CEV0_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV0_Pos )                       /*!< VADC_G CEFCLR: CEV0 Mask                */
    #define VADC_G_CEFCLR_CEV1_Pos         1                                                          /*!< VADC_G CEFCLR: CEV1 Position            */
    #define VADC_G_CEFCLR_CEV1_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV1_Pos )                       /*!< VADC_G CEFCLR: CEV1 Mask                */
    #define VADC_G_CEFCLR_CEV2_Pos         2                                                          /*!< VADC_G CEFCLR: CEV2 Position            */
    #define VADC_G_CEFCLR_CEV2_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV2_Pos )                       /*!< VADC_G CEFCLR: CEV2 Mask                */
    #define VADC_G_CEFCLR_CEV3_Pos         3                                                          /*!< VADC_G CEFCLR: CEV3 Position            */
    #define VADC_G_CEFCLR_CEV3_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV3_Pos )                       /*!< VADC_G CEFCLR: CEV3 Mask                */
    #define VADC_G_CEFCLR_CEV4_Pos         4                                                          /*!< VADC_G CEFCLR: CEV4 Position            */
    #define VADC_G_CEFCLR_CEV4_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV4_Pos )                       /*!< VADC_G CEFCLR: CEV4 Mask                */
    #define VADC_G_CEFCLR_CEV5_Pos         5                                                          /*!< VADC_G CEFCLR: CEV5 Position            */
    #define VADC_G_CEFCLR_CEV5_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV5_Pos )                       /*!< VADC_G CEFCLR: CEV5 Mask                */
    #define VADC_G_CEFCLR_CEV6_Pos         6                                                          /*!< VADC_G CEFCLR: CEV6 Position            */
    #define VADC_G_CEFCLR_CEV6_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV6_Pos )                       /*!< VADC_G CEFCLR: CEV6 Mask                */
    #define VADC_G_CEFCLR_CEV7_Pos         7                                                          /*!< VADC_G CEFCLR: CEV7 Position            */
    #define VADC_G_CEFCLR_CEV7_Msk         ( 0x01UL << VADC_G_CEFCLR_CEV7_Pos )                       /*!< VADC_G CEFCLR: CEV7 Mask                */

/* --------------------------------  VADC_G_REFCLR  ------------------------------- */
    #define VADC_G_REFCLR_REV0_Pos         0                                                          /*!< VADC_G REFCLR: REV0 Position            */
    #define VADC_G_REFCLR_REV0_Msk         ( 0x01UL << VADC_G_REFCLR_REV0_Pos )                       /*!< VADC_G REFCLR: REV0 Mask                */
    #define VADC_G_REFCLR_REV1_Pos         1                                                          /*!< VADC_G REFCLR: REV1 Position            */
    #define VADC_G_REFCLR_REV1_Msk         ( 0x01UL << VADC_G_REFCLR_REV1_Pos )                       /*!< VADC_G REFCLR: REV1 Mask                */
    #define VADC_G_REFCLR_REV2_Pos         2                                                          /*!< VADC_G REFCLR: REV2 Position            */
    #define VADC_G_REFCLR_REV2_Msk         ( 0x01UL << VADC_G_REFCLR_REV2_Pos )                       /*!< VADC_G REFCLR: REV2 Mask                */
    #define VADC_G_REFCLR_REV3_Pos         3                                                          /*!< VADC_G REFCLR: REV3 Position            */
    #define VADC_G_REFCLR_REV3_Msk         ( 0x01UL << VADC_G_REFCLR_REV3_Pos )                       /*!< VADC_G REFCLR: REV3 Mask                */
    #define VADC_G_REFCLR_REV4_Pos         4                                                          /*!< VADC_G REFCLR: REV4 Position            */
    #define VADC_G_REFCLR_REV4_Msk         ( 0x01UL << VADC_G_REFCLR_REV4_Pos )                       /*!< VADC_G REFCLR: REV4 Mask                */
    #define VADC_G_REFCLR_REV5_Pos         5                                                          /*!< VADC_G REFCLR: REV5 Position            */
    #define VADC_G_REFCLR_REV5_Msk         ( 0x01UL << VADC_G_REFCLR_REV5_Pos )                       /*!< VADC_G REFCLR: REV5 Mask                */
    #define VADC_G_REFCLR_REV6_Pos         6                                                          /*!< VADC_G REFCLR: REV6 Position            */
    #define VADC_G_REFCLR_REV6_Msk         ( 0x01UL << VADC_G_REFCLR_REV6_Pos )                       /*!< VADC_G REFCLR: REV6 Mask                */
    #define VADC_G_REFCLR_REV7_Pos         7                                                          /*!< VADC_G REFCLR: REV7 Position            */
    #define VADC_G_REFCLR_REV7_Msk         ( 0x01UL << VADC_G_REFCLR_REV7_Pos )                       /*!< VADC_G REFCLR: REV7 Mask                */
    #define VADC_G_REFCLR_REV8_Pos         8                                                          /*!< VADC_G REFCLR: REV8 Position            */
    #define VADC_G_REFCLR_REV8_Msk         ( 0x01UL << VADC_G_REFCLR_REV8_Pos )                       /*!< VADC_G REFCLR: REV8 Mask                */
    #define VADC_G_REFCLR_REV9_Pos         9                                                          /*!< VADC_G REFCLR: REV9 Position            */
    #define VADC_G_REFCLR_REV9_Msk         ( 0x01UL << VADC_G_REFCLR_REV9_Pos )                       /*!< VADC_G REFCLR: REV9 Mask                */
    #define VADC_G_REFCLR_REV10_Pos        10                                                         /*!< VADC_G REFCLR: REV10 Position           */
    #define VADC_G_REFCLR_REV10_Msk        ( 0x01UL << VADC_G_REFCLR_REV10_Pos )                      /*!< VADC_G REFCLR: REV10 Mask               */
    #define VADC_G_REFCLR_REV11_Pos        11                                                         /*!< VADC_G REFCLR: REV11 Position           */
    #define VADC_G_REFCLR_REV11_Msk        ( 0x01UL << VADC_G_REFCLR_REV11_Pos )                      /*!< VADC_G REFCLR: REV11 Mask               */
    #define VADC_G_REFCLR_REV12_Pos        12                                                         /*!< VADC_G REFCLR: REV12 Position           */
    #define VADC_G_REFCLR_REV12_Msk        ( 0x01UL << VADC_G_REFCLR_REV12_Pos )                      /*!< VADC_G REFCLR: REV12 Mask               */
    #define VADC_G_REFCLR_REV13_Pos        13                                                         /*!< VADC_G REFCLR: REV13 Position           */
    #define VADC_G_REFCLR_REV13_Msk        ( 0x01UL << VADC_G_REFCLR_REV13_Pos )                      /*!< VADC_G REFCLR: REV13 Mask               */
    #define VADC_G_REFCLR_REV14_Pos        14                                                         /*!< VADC_G REFCLR: REV14 Position           */
    #define VADC_G_REFCLR_REV14_Msk        ( 0x01UL << VADC_G_REFCLR_REV14_Pos )                      /*!< VADC_G REFCLR: REV14 Mask               */
    #define VADC_G_REFCLR_REV15_Pos        15                                                         /*!< VADC_G REFCLR: REV15 Position           */
    #define VADC_G_REFCLR_REV15_Msk        ( 0x01UL << VADC_G_REFCLR_REV15_Pos )                      /*!< VADC_G REFCLR: REV15 Mask               */

/* --------------------------------  VADC_G_SEFCLR  ------------------------------- */
    #define VADC_G_SEFCLR_SEV0_Pos         0                                                          /*!< VADC_G SEFCLR: SEV0 Position            */
    #define VADC_G_SEFCLR_SEV0_Msk         ( 0x01UL << VADC_G_SEFCLR_SEV0_Pos )                       /*!< VADC_G SEFCLR: SEV0 Mask                */
    #define VADC_G_SEFCLR_SEV1_Pos         1                                                          /*!< VADC_G SEFCLR: SEV1 Position            */
    #define VADC_G_SEFCLR_SEV1_Msk         ( 0x01UL << VADC_G_SEFCLR_SEV1_Pos )                       /*!< VADC_G SEFCLR: SEV1 Mask                */

/* --------------------------------  VADC_G_CEVNP0  ------------------------------- */
    #define VADC_G_CEVNP0_CEV0NP_Pos       0                                                          /*!< VADC_G CEVNP0: CEV0NP Position          */
    #define VADC_G_CEVNP0_CEV0NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV0NP_Pos )                     /*!< VADC_G CEVNP0: CEV0NP Mask              */
    #define VADC_G_CEVNP0_CEV1NP_Pos       4                                                          /*!< VADC_G CEVNP0: CEV1NP Position          */
    #define VADC_G_CEVNP0_CEV1NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV1NP_Pos )                     /*!< VADC_G CEVNP0: CEV1NP Mask              */
    #define VADC_G_CEVNP0_CEV2NP_Pos       8                                                          /*!< VADC_G CEVNP0: CEV2NP Position          */
    #define VADC_G_CEVNP0_CEV2NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV2NP_Pos )                     /*!< VADC_G CEVNP0: CEV2NP Mask              */
    #define VADC_G_CEVNP0_CEV3NP_Pos       12                                                         /*!< VADC_G CEVNP0: CEV3NP Position          */
    #define VADC_G_CEVNP0_CEV3NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV3NP_Pos )                     /*!< VADC_G CEVNP0: CEV3NP Mask              */
    #define VADC_G_CEVNP0_CEV4NP_Pos       16                                                         /*!< VADC_G CEVNP0: CEV4NP Position          */
    #define VADC_G_CEVNP0_CEV4NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV4NP_Pos )                     /*!< VADC_G CEVNP0: CEV4NP Mask              */
    #define VADC_G_CEVNP0_CEV5NP_Pos       20                                                         /*!< VADC_G CEVNP0: CEV5NP Position          */
    #define VADC_G_CEVNP0_CEV5NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV5NP_Pos )                     /*!< VADC_G CEVNP0: CEV5NP Mask              */
    #define VADC_G_CEVNP0_CEV6NP_Pos       24                                                         /*!< VADC_G CEVNP0: CEV6NP Position          */
    #define VADC_G_CEVNP0_CEV6NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV6NP_Pos )                     /*!< VADC_G CEVNP0: CEV6NP Mask              */
    #define VADC_G_CEVNP0_CEV7NP_Pos       28                                                         /*!< VADC_G CEVNP0: CEV7NP Position          */
    #define VADC_G_CEVNP0_CEV7NP_Msk       ( 0x0fUL << VADC_G_CEVNP0_CEV7NP_Pos )                     /*!< VADC_G CEVNP0: CEV7NP Mask              */

/* --------------------------------  VADC_G_REVNP0  ------------------------------- */
    #define VADC_G_REVNP0_REV0NP_Pos       0                                                          /*!< VADC_G REVNP0: REV0NP Position          */
    #define VADC_G_REVNP0_REV0NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV0NP_Pos )                     /*!< VADC_G REVNP0: REV0NP Mask              */
    #define VADC_G_REVNP0_REV1NP_Pos       4                                                          /*!< VADC_G REVNP0: REV1NP Position          */
    #define VADC_G_REVNP0_REV1NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV1NP_Pos )                     /*!< VADC_G REVNP0: REV1NP Mask              */
    #define VADC_G_REVNP0_REV2NP_Pos       8                                                          /*!< VADC_G REVNP0: REV2NP Position          */
    #define VADC_G_REVNP0_REV2NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV2NP_Pos )                     /*!< VADC_G REVNP0: REV2NP Mask              */
    #define VADC_G_REVNP0_REV3NP_Pos       12                                                         /*!< VADC_G REVNP0: REV3NP Position          */
    #define VADC_G_REVNP0_REV3NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV3NP_Pos )                     /*!< VADC_G REVNP0: REV3NP Mask              */
    #define VADC_G_REVNP0_REV4NP_Pos       16                                                         /*!< VADC_G REVNP0: REV4NP Position          */
    #define VADC_G_REVNP0_REV4NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV4NP_Pos )                     /*!< VADC_G REVNP0: REV4NP Mask              */
    #define VADC_G_REVNP0_REV5NP_Pos       20                                                         /*!< VADC_G REVNP0: REV5NP Position          */
    #define VADC_G_REVNP0_REV5NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV5NP_Pos )                     /*!< VADC_G REVNP0: REV5NP Mask              */
    #define VADC_G_REVNP0_REV6NP_Pos       24                                                         /*!< VADC_G REVNP0: REV6NP Position          */
    #define VADC_G_REVNP0_REV6NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV6NP_Pos )                     /*!< VADC_G REVNP0: REV6NP Mask              */
    #define VADC_G_REVNP0_REV7NP_Pos       28                                                         /*!< VADC_G REVNP0: REV7NP Position          */
    #define VADC_G_REVNP0_REV7NP_Msk       ( 0x0fUL << VADC_G_REVNP0_REV7NP_Pos )                     /*!< VADC_G REVNP0: REV7NP Mask              */

/* --------------------------------  VADC_G_REVNP1  ------------------------------- */
    #define VADC_G_REVNP1_REV8NP_Pos       0                                                          /*!< VADC_G REVNP1: REV8NP Position          */
    #define VADC_G_REVNP1_REV8NP_Msk       ( 0x0fUL << VADC_G_REVNP1_REV8NP_Pos )                     /*!< VADC_G REVNP1: REV8NP Mask              */
    #define VADC_G_REVNP1_REV9NP_Pos       4                                                          /*!< VADC_G REVNP1: REV9NP Position          */
    #define VADC_G_REVNP1_REV9NP_Msk       ( 0x0fUL << VADC_G_REVNP1_REV9NP_Pos )                     /*!< VADC_G REVNP1: REV9NP Mask              */
    #define VADC_G_REVNP1_REV10NP_Pos      8                                                          /*!< VADC_G REVNP1: REV10NP Position         */
    #define VADC_G_REVNP1_REV10NP_Msk      ( 0x0fUL << VADC_G_REVNP1_REV10NP_Pos )                    /*!< VADC_G REVNP1: REV10NP Mask             */
    #define VADC_G_REVNP1_REV11NP_Pos      12                                                         /*!< VADC_G REVNP1: REV11NP Position         */
    #define VADC_G_REVNP1_REV11NP_Msk      ( 0x0fUL << VADC_G_REVNP1_REV11NP_Pos )                    /*!< VADC_G REVNP1: REV11NP Mask             */
    #define VADC_G_REVNP1_REV12NP_Pos      16                                                         /*!< VADC_G REVNP1: REV12NP Position         */
    #define VADC_G_REVNP1_REV12NP_Msk      ( 0x0fUL << VADC_G_REVNP1_REV12NP_Pos )                    /*!< VADC_G REVNP1: REV12NP Mask             */
    #define VADC_G_REVNP1_REV13NP_Pos      20                                                         /*!< VADC_G REVNP1: REV13NP Position         */
    #define VADC_G_REVNP1_REV13NP_Msk      ( 0x0fUL << VADC_G_REVNP1_REV13NP_Pos )                    /*!< VADC_G REVNP1: REV13NP Mask             */
    #define VADC_G_REVNP1_REV14NP_Pos      24                                                         /*!< VADC_G REVNP1: REV14NP Position         */
    #define VADC_G_REVNP1_REV14NP_Msk      ( 0x0fUL << VADC_G_REVNP1_REV14NP_Pos )                    /*!< VADC_G REVNP1: REV14NP Mask             */
    #define VADC_G_REVNP1_REV15NP_Pos      28                                                         /*!< VADC_G REVNP1: REV15NP Position         */
    #define VADC_G_REVNP1_REV15NP_Msk      ( 0x0fUL << VADC_G_REVNP1_REV15NP_Pos )                    /*!< VADC_G REVNP1: REV15NP Mask             */

/* --------------------------------  VADC_G_SEVNP  -------------------------------- */
    #define VADC_G_SEVNP_SEV0NP_Pos        0                                                          /*!< VADC_G SEVNP: SEV0NP Position           */
    #define VADC_G_SEVNP_SEV0NP_Msk        ( 0x0fUL << VADC_G_SEVNP_SEV0NP_Pos )                      /*!< VADC_G SEVNP: SEV0NP Mask               */
    #define VADC_G_SEVNP_SEV1NP_Pos        4                                                          /*!< VADC_G SEVNP: SEV1NP Position           */
    #define VADC_G_SEVNP_SEV1NP_Msk        ( 0x0fUL << VADC_G_SEVNP_SEV1NP_Pos )                      /*!< VADC_G SEVNP: SEV1NP Mask               */

