FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_SRACT  -------------------------------- */
    #define VADC_G_SRACT_AGSR0_Pos         0                                                          /*!< VADC_G SRACT: AGSR0 Position            */
    #define VADC_G_SRACT_AGSR0_Msk         ( 0x01UL << VADC_G_SRACT_AGSR0_Pos )                       /*!< VADC_G SRACT: AGSR0 Mask                */
    #define VADC_G_SRACT_AGSR1_Pos         1                                                          /*!< VADC_G SRACT: AGSR1 Position            */
    #define VADC_G_SRACT_AGSR1_Msk         ( 0x01UL << VADC_G_SRACT_AGSR1_Pos )                       /*!< VADC_G SRACT: AGSR1 Mask                */
    #define VADC_G_SRACT_ASSR0_Pos         8                                                          /*!< VADC_G SRACT: ASSR0 Position            */
    #define VADC_G_SRACT_ASSR0_Msk         ( 0x01UL << VADC_G_SRACT_ASSR0_Pos )                       /*!< VADC_G SRACT: ASSR0 Mask                */
    #define VADC_G_SRACT_ASSR1_Pos         9                                                          /*!< VADC_G SRACT: ASSR1 Position            */
    #define VADC_G_SRACT_ASSR1_Msk         ( 0x01UL << VADC_G_SRACT_ASSR1_Pos )                       /*!< VADC_G SRACT: ASSR1 Mask                */
    #define VADC_G_SRACT_ASSR2_Pos         10                                                         /*!< VADC_G SRACT: ASSR2 Position            */
    #define VADC_G_SRACT_ASSR2_Msk         ( 0x01UL << VADC_G_SRACT_ASSR2_Pos )                       /*!< VADC_G SRACT: ASSR2 Mask                */
    #define VADC_G_SRACT_ASSR3_Pos         11                                                         /*!< VADC_G SRACT: ASSR3 Position            */
    #define VADC_G_SRACT_ASSR3_Msk         ( 0x01UL << VADC_G_SRACT_ASSR3_Pos )                       /*!< VADC_G SRACT: ASSR3 Mask                */

/* -------------------------------  VADC_G_EMUXCTR  ------------------------------- */
    #define VADC_G_EMUXCTR_EMUXSET_Pos     0                                                          /*!< VADC_G EMUXCTR: EMUXSET Position        */
    #define VADC_G_EMUXCTR_EMUXSET_Msk     ( 0x07UL << VADC_G_EMUXCTR_EMUXSET_Pos )                   /*!< VADC_G EMUXCTR: EMUXSET Mask            */
    #define VADC_G_EMUXCTR_EMUXACT_Pos     8                                                          /*!< VADC_G EMUXCTR: EMUXACT Position        */
    #define VADC_G_EMUXCTR_EMUXACT_Msk     ( 0x07UL << VADC_G_EMUXCTR_EMUXACT_Pos )                   /*!< VADC_G EMUXCTR: EMUXACT Mask            */
    #define VADC_G_EMUXCTR_EMUXCH_Pos      16                                                         /*!< VADC_G EMUXCTR: EMUXCH Position         */
    #define VADC_G_EMUXCTR_EMUXCH_Msk      ( 0x000003ffUL << VADC_G_EMUXCTR_EMUXCH_Pos )              /*!< VADC_G EMUXCTR: EMUXCH Mask             */
    #define VADC_G_EMUXCTR_EMUXMODE_Pos    26                                                         /*!< VADC_G EMUXCTR: EMUXMODE Position       */
    #define VADC_G_EMUXCTR_EMUXMODE_Msk    ( 0x03UL << VADC_G_EMUXCTR_EMUXMODE_Pos )                  /*!< VADC_G EMUXCTR: EMUXMODE Mask           */
    #define VADC_G_EMUXCTR_EMXCOD_Pos      28                                                         /*!< VADC_G EMUXCTR: EMXCOD Position         */
    #define VADC_G_EMUXCTR_EMXCOD_Msk      ( 0x01UL << VADC_G_EMUXCTR_EMXCOD_Pos )                    /*!< VADC_G EMUXCTR: EMXCOD Mask             */
    #define VADC_G_EMUXCTR_EMXST_Pos       29                                                         /*!< VADC_G EMUXCTR: EMXST Position          */
    #define VADC_G_EMUXCTR_EMXST_Msk       ( 0x01UL << VADC_G_EMUXCTR_EMXST_Pos )                     /*!< VADC_G EMUXCTR: EMXST Mask              */
    #define VADC_G_EMUXCTR_EMXCSS_Pos      30                                                         /*!< VADC_G EMUXCTR: EMXCSS Position         */
    #define VADC_G_EMUXCTR_EMXCSS_Msk      ( 0x01UL << VADC_G_EMUXCTR_EMXCSS_Pos )                    /*!< VADC_G EMUXCTR: EMXCSS Mask             */
    #define VADC_G_EMUXCTR_EMXWC_Pos       31                                                         /*!< VADC_G EMUXCTR: EMXWC Position          */
    #define VADC_G_EMUXCTR_EMXWC_Msk       ( 0x01UL << VADC_G_EMUXCTR_EMXWC_Pos )                     /*!< VADC_G EMUXCTR: EMXWC Mask              */

/* ---------------------------------  VADC_G_VFR  --------------------------------- */
    #define VADC_G_VFR_VF0_Pos             0                                                          /*!< VADC_G VFR: VF0 Position                */
    #define VADC_G_VFR_VF0_Msk             ( 0x01UL << VADC_G_VFR_VF0_Pos )                           /*!< VADC_G VFR: VF0 Mask                    */
    #define VADC_G_VFR_VF1_Pos             1                                                          /*!< VADC_G VFR: VF1 Position                */
    #define VADC_G_VFR_VF1_Msk             ( 0x01UL << VADC_G_VFR_VF1_Pos )                           /*!< VADC_G VFR: VF1 Mask                    */
    #define VADC_G_VFR_VF2_Pos             2                                                          /*!< VADC_G VFR: VF2 Position                */
    #define VADC_G_VFR_VF2_Msk             ( 0x01UL << VADC_G_VFR_VF2_Pos )                           /*!< VADC_G VFR: VF2 Mask                    */
    #define VADC_G_VFR_VF3_Pos             3                                                          /*!< VADC_G VFR: VF3 Position                */
    #define VADC_G_VFR_VF3_Msk             ( 0x01UL << VADC_G_VFR_VF3_Pos )                           /*!< VADC_G VFR: VF3 Mask                    */
    #define VADC_G_VFR_VF4_Pos             4                                                          /*!< VADC_G VFR: VF4 Position                */
    #define VADC_G_VFR_VF4_Msk             ( 0x01UL << VADC_G_VFR_VF4_Pos )                           /*!< VADC_G VFR: VF4 Mask                    */
    #define VADC_G_VFR_VF5_Pos             5                                                          /*!< VADC_G VFR: VF5 Position                */
    #define VADC_G_VFR_VF5_Msk             ( 0x01UL << VADC_G_VFR_VF5_Pos )                           /*!< VADC_G VFR: VF5 Mask                    */
    #define VADC_G_VFR_VF6_Pos             6                                                          /*!< VADC_G VFR: VF6 Position                */
    #define VADC_G_VFR_VF6_Msk             ( 0x01UL << VADC_G_VFR_VF6_Pos )                           /*!< VADC_G VFR: VF6 Mask                    */
    #define VADC_G_VFR_VF7_Pos             7                                                          /*!< VADC_G VFR: VF7 Position                */
    #define VADC_G_VFR_VF7_Msk             ( 0x01UL << VADC_G_VFR_VF7_Pos )                           /*!< VADC_G VFR: VF7 Mask                    */
    #define VADC_G_VFR_VF8_Pos             8                                                          /*!< VADC_G VFR: VF8 Position                */
    #define VADC_G_VFR_VF8_Msk             ( 0x01UL << VADC_G_VFR_VF8_Pos )                           /*!< VADC_G VFR: VF8 Mask                    */
    #define VADC_G_VFR_VF9_Pos             9                                                          /*!< VADC_G VFR: VF9 Position                */
    #define VADC_G_VFR_VF9_Msk             ( 0x01UL << VADC_G_VFR_VF9_Pos )                           /*!< VADC_G VFR: VF9 Mask                    */
    #define VADC_G_VFR_VF10_Pos            10                                                         /*!< VADC_G VFR: VF10 Position               */
    #define VADC_G_VFR_VF10_Msk            ( 0x01UL << VADC_G_VFR_VF10_Pos )                          /*!< VADC_G VFR: VF10 Mask                   */
    #define VADC_G_VFR_VF11_Pos            11                                                         /*!< VADC_G VFR: VF11 Position               */
    #define VADC_G_VFR_VF11_Msk            ( 0x01UL << VADC_G_VFR_VF11_Pos )                          /*!< VADC_G VFR: VF11 Mask                   */
    #define VADC_G_VFR_VF12_Pos            12                                                         /*!< VADC_G VFR: VF12 Position               */
    #define VADC_G_VFR_VF12_Msk            ( 0x01UL << VADC_G_VFR_VF12_Pos )                          /*!< VADC_G VFR: VF12 Mask                   */
    #define VADC_G_VFR_VF13_Pos            13                                                         /*!< VADC_G VFR: VF13 Position               */
    #define VADC_G_VFR_VF13_Msk            ( 0x01UL << VADC_G_VFR_VF13_Pos )                          /*!< VADC_G VFR: VF13 Mask                   */
    #define VADC_G_VFR_VF14_Pos            14                                                         /*!< VADC_G VFR: VF14 Position               */
    #define VADC_G_VFR_VF14_Msk            ( 0x01UL << VADC_G_VFR_VF14_Pos )                          /*!< VADC_G VFR: VF14 Mask                   */
    #define VADC_G_VFR_VF15_Pos            15                                                         /*!< VADC_G VFR: VF15 Position               */
    #define VADC_G_VFR_VF15_Msk            ( 0x01UL << VADC_G_VFR_VF15_Pos )                          /*!< VADC_G VFR: VF15 Mask                   */

