FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* --------------------------------  VADC_G_CHCTR  -------------------------------- */
    #define VADC_G_CHCTR_ICLSEL_Pos        0                                                          /*!< VADC_G CHCTR: ICLSEL Position           */
    #define VADC_G_CHCTR_ICLSEL_Msk        ( 0x03UL << VADC_G_CHCTR_ICLSEL_Pos )                      /*!< VADC_G CHCTR: ICLSEL Mask               */
    #define VADC_G_CHCTR_BNDSELL_Pos       4                                                          /*!< VADC_G CHCTR: BNDSELL Position          */
    #define VADC_G_CHCTR_BNDSELL_Msk       ( 0x03UL << VADC_G_CHCTR_BNDSELL_Pos )                     /*!< VADC_G CHCTR: BNDSELL Mask              */
    #define VADC_G_CHCTR_BNDSELU_Pos       6                                                          /*!< VADC_G CHCTR: BNDSELU Position          */
    #define VADC_G_CHCTR_BNDSELU_Msk       ( 0x03UL << VADC_G_CHCTR_BNDSELU_Pos )                     /*!< VADC_G CHCTR: BNDSELU Mask              */
    #define VADC_G_CHCTR_CHEVMODE_Pos      8                                                          /*!< VADC_G CHCTR: CHEVMODE Position         */
    #define VADC_G_CHCTR_CHEVMODE_Msk      ( 0x03UL << VADC_G_CHCTR_CHEVMODE_Pos )                    /*!< VADC_G CHCTR: CHEVMODE Mask             */
    #define VADC_G_CHCTR_SYNC_Pos          10                                                         /*!< VADC_G CHCTR: SYNC Position             */
    #define VADC_G_CHCTR_SYNC_Msk          ( 0x01UL << VADC_G_CHCTR_SYNC_Pos )                        /*!< VADC_G CHCTR: SYNC Mask                 */
    #define VADC_G_CHCTR_REFSEL_Pos        11                                                         /*!< VADC_G CHCTR: REFSEL Position           */
    #define VADC_G_CHCTR_REFSEL_Msk        ( 0x01UL << VADC_G_CHCTR_REFSEL_Pos )                      /*!< VADC_G CHCTR: REFSEL Mask               */
    #define VADC_G_CHCTR_BNDSELX_Pos       12                                                         /*!< VADC_G CHCTR: BNDSELX Position          */
    #define VADC_G_CHCTR_BNDSELX_Msk       ( 0x0fUL << VADC_G_CHCTR_BNDSELX_Pos )                     /*!< VADC_G CHCTR: BNDSELX Mask              */
    #define VADC_G_CHCTR_RESREG_Pos        16                                                         /*!< VADC_G CHCTR: RESREG Position           */
    #define VADC_G_CHCTR_RESREG_Msk        ( 0x0fUL << VADC_G_CHCTR_RESREG_Pos )                      /*!< VADC_G CHCTR: RESREG Mask               */
    #define VADC_G_CHCTR_RESTBS_Pos        20                                                         /*!< VADC_G CHCTR: RESTBS Position           */
    #define VADC_G_CHCTR_RESTBS_Msk        ( 0x01UL << VADC_G_CHCTR_RESTBS_Pos )                      /*!< VADC_G CHCTR: RESTBS Mask               */
    #define VADC_G_CHCTR_RESPOS_Pos        21                                                         /*!< VADC_G CHCTR: RESPOS Position           */
    #define VADC_G_CHCTR_RESPOS_Msk        ( 0x01UL << VADC_G_CHCTR_RESPOS_Pos )                      /*!< VADC_G CHCTR: RESPOS Mask               */
    #define VADC_G_CHCTR_BWDCH_Pos         28                                                         /*!< VADC_G CHCTR: BWDCH Position            */
    #define VADC_G_CHCTR_BWDCH_Msk         ( 0x03UL << VADC_G_CHCTR_BWDCH_Pos )                       /*!< VADC_G CHCTR: BWDCH Mask                */
    #define VADC_G_CHCTR_BWDEN_Pos         30                                                         /*!< VADC_G CHCTR: BWDEN Position            */
    #define VADC_G_CHCTR_BWDEN_Msk         ( 0x01UL << VADC_G_CHCTR_BWDEN_Pos )                       /*!< VADC_G CHCTR: BWDEN Mask                */

/* ---------------------------------  VADC_G_RCR  --------------------------------- */
    #define VADC_G_RCR_DRCTR_Pos           16                                                         /*!< VADC_G RCR: DRCTR Position              */
    #define VADC_G_RCR_DRCTR_Msk           ( 0x0fUL << VADC_G_RCR_DRCTR_Pos )                         /*!< VADC_G RCR: DRCTR Mask                  */
    #define VADC_G_RCR_DMM_Pos             20                                                         /*!< VADC_G RCR: DMM Position                */
    #define VADC_G_RCR_DMM_Msk             ( 0x03UL << VADC_G_RCR_DMM_Pos )                           /*!< VADC_G RCR: DMM Mask                    */
    #define VADC_G_RCR_WFR_Pos             24                                                         /*!< VADC_G RCR: WFR Position                */
    #define VADC_G_RCR_WFR_Msk             ( 0x01UL << VADC_G_RCR_WFR_Pos )                           /*!< VADC_G RCR: WFR Mask                    */
    #define VADC_G_RCR_FEN_Pos             25                                                         /*!< VADC_G RCR: FEN Position                */
    #define VADC_G_RCR_FEN_Msk             ( 0x03UL << VADC_G_RCR_FEN_Pos )                           /*!< VADC_G RCR: FEN Mask                    */
    #define VADC_G_RCR_SRGEN_Pos           31                                                         /*!< VADC_G RCR: SRGEN Position              */
    #define VADC_G_RCR_SRGEN_Msk           ( 0x01UL << VADC_G_RCR_SRGEN_Pos )                         /*!< VADC_G RCR: SRGEN Mask                  */

/* ---------------------------------  VADC_G_RES  --------------------------------- */
    #define VADC_G_RES_RESULT_Pos          0                                                          /*!< VADC_G RES: RESULT Position             */
    #define VADC_G_RES_RESULT_Msk          ( 0x0000ffffUL << VADC_G_RES_RESULT_Pos )                  /*!< VADC_G RES: RESULT Mask                 */
    #define VADC_G_RES_DRC_Pos             16                                                         /*!< VADC_G RES: DRC Position                */
    #define VADC_G_RES_DRC_Msk             ( 0x0fUL << VADC_G_RES_DRC_Pos )                           /*!< VADC_G RES: DRC Mask                    */
    #define VADC_G_RES_CHNR_Pos            20                                                         /*!< VADC_G RES: CHNR Position               */
    #define VADC_G_RES_CHNR_Msk            ( 0x1fUL << VADC_G_RES_CHNR_Pos )                          /*!< VADC_G RES: CHNR Mask                   */
    #define VADC_G_RES_EMUX_Pos            25                                                         /*!< VADC_G RES: EMUX Position               */
    #define VADC_G_RES_EMUX_Msk            ( 0x07UL << VADC_G_RES_EMUX_Pos )                          /*!< VADC_G RES: EMUX Mask                   */
    #define VADC_G_RES_CRS_Pos             28                                                         /*!< VADC_G RES: CRS Position                */
    #define VADC_G_RES_CRS_Msk             ( 0x03UL << VADC_G_RES_CRS_Pos )                           /*!< VADC_G RES: CRS Mask                    */
    #define VADC_G_RES_FCR_Pos             30                                                         /*!< VADC_G RES: FCR Position                */
    #define VADC_G_RES_FCR_Msk             ( 0x01UL << VADC_G_RES_FCR_Pos )                           /*!< VADC_G RES: FCR Mask                    */
    #define VADC_G_RES_VF_Pos              31                                                         /*!< VADC_G RES: VF Position                 */
    #define VADC_G_RES_VF_Msk              ( 0x01UL << VADC_G_RES_VF_Pos )                            /*!< VADC_G RES: VF Mask                     */

/* ---------------------------------  VADC_G_RESD  -------------------------------- */
    #define VADC_G_RESD_RESULT_Pos         0                                                          /*!< VADC_G RESD: RESULT Position            */
    #define VADC_G_RESD_RESULT_Msk         ( 0x0000ffffUL << VADC_G_RESD_RESULT_Pos )                 /*!< VADC_G RESD: RESULT Mask                */
    #define VADC_G_RESD_DRC_Pos            16                                                         /*!< VADC_G RESD: DRC Position               */
    #define VADC_G_RESD_DRC_Msk            ( 0x0fUL << VADC_G_RESD_DRC_Pos )                          /*!< VADC_G RESD: DRC Mask                   */
    #define VADC_G_RESD_CHNR_Pos           20                                                         /*!< VADC_G RESD: CHNR Position              */
    #define VADC_G_RESD_CHNR_Msk           ( 0x1fUL << VADC_G_RESD_CHNR_Pos )                         /*!< VADC_G RESD: CHNR Mask                  */
    #define VADC_G_RESD_EMUX_Pos           25                                                         /*!< VADC_G RESD: EMUX Position              */
    #define VADC_G_RESD_EMUX_Msk           ( 0x07UL << VADC_G_RESD_EMUX_Pos )                         /*!< VADC_G RESD: EMUX Mask                  */
    #define VADC_G_RESD_CRS_Pos            28                                                         /*!< VADC_G RESD: CRS Position               */
    #define VADC_G_RESD_CRS_Msk            ( 0x03UL << VADC_G_RESD_CRS_Pos )                          /*!< VADC_G RESD: CRS Mask                   */
    #define VADC_G_RESD_FCR_Pos            30                                                         /*!< VADC_G RESD: FCR Position               */
    #define VADC_G_RESD_FCR_Msk            ( 0x01UL << VADC_G_RESD_FCR_Pos )                          /*!< VADC_G RESD: FCR Mask                   */
    #define VADC_G_RESD_VF_Pos             31                                                         /*!< VADC_G RESD: VF Position                */
    #define VADC_G_RESD_VF_Msk             ( 0x01UL << VADC_G_RESD_VF_Pos )                           /*!< VADC_G RESD: VF Mask                    */


/* ================================================================================ */
/* ================           Group 'SHS' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  SHS_ID  ----------------------------------- */
    #define SHS_ID_MOD_REV_Pos          0                                                             /*!< SHS ID: MOD_REV Position                */
    #define SHS_ID_MOD_REV_Msk          ( 0x000000ffUL << SHS_ID_MOD_REV_Pos )                        /*!< SHS ID: MOD_REV Mask                    */
    #define SHS_ID_MOD_TYPE_Pos         8                                                             /*!< SHS ID: MOD_TYPE Position               */
    #define SHS_ID_MOD_TYPE_Msk         ( 0x000000ffUL << SHS_ID_MOD_TYPE_Pos )                       /*!< SHS ID: MOD_TYPE Mask                   */
    #define SHS_ID_MOD_NUMBER_Pos       16                                                            /*!< SHS ID: MOD_NUMBER Position             */
    #define SHS_ID_MOD_NUMBER_Msk       ( 0x0000ffffUL << SHS_ID_MOD_NUMBER_Pos )                     /*!< SHS ID: MOD_NUMBER Mask                 */

