FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  SHS_SHSCFG  --------------------------------- */
    #define SHS_SHSCFG_DIVS_Pos         0                                                             /*!< SHS SHSCFG: DIVS Position               */
    #define SHS_SHSCFG_DIVS_Msk         ( 0x0fUL << SHS_SHSCFG_DIVS_Pos )                             /*!< SHS SHSCFG: DIVS Mask                   */
    #define SHS_SHSCFG_AREF_Pos         10                                                            /*!< SHS SHSCFG: AREF Position               */
    #define SHS_SHSCFG_AREF_Msk         ( 0x03UL << SHS_SHSCFG_AREF_Pos )                             /*!< SHS SHSCFG: AREF Mask                   */
    #define SHS_SHSCFG_ANOFF_Pos        12                                                            /*!< SHS SHSCFG: ANOFF Position              */
    #define SHS_SHSCFG_ANOFF_Msk        ( 0x01UL << SHS_SHSCFG_ANOFF_Pos )                            /*!< SHS SHSCFG: ANOFF Mask                  */
    #define SHS_SHSCFG_ANRDY_Pos        14                                                            /*!< SHS SHSCFG: ANRDY Position              */
    #define SHS_SHSCFG_ANRDY_Msk        ( 0x01UL << SHS_SHSCFG_ANRDY_Pos )                            /*!< SHS SHSCFG: ANRDY Mask                  */
    #define SHS_SHSCFG_SCWC_Pos         15                                                            /*!< SHS SHSCFG: SCWC Position               */
    #define SHS_SHSCFG_SCWC_Msk         ( 0x01UL << SHS_SHSCFG_SCWC_Pos )                             /*!< SHS SHSCFG: SCWC Mask                   */
    #define SHS_SHSCFG_SP0_Pos          16                                                            /*!< SHS SHSCFG: SP0 Position                */
    #define SHS_SHSCFG_SP0_Msk          ( 0x01UL << SHS_SHSCFG_SP0_Pos )                              /*!< SHS SHSCFG: SP0 Mask                    */
    #define SHS_SHSCFG_SP1_Pos          17                                                            /*!< SHS SHSCFG: SP1 Position                */
    #define SHS_SHSCFG_SP1_Msk          ( 0x01UL << SHS_SHSCFG_SP1_Pos )                              /*!< SHS SHSCFG: SP1 Mask                    */
    #define SHS_SHSCFG_TC_Pos           24                                                            /*!< SHS SHSCFG: TC Position                 */
    #define SHS_SHSCFG_TC_Msk           ( 0x0fUL << SHS_SHSCFG_TC_Pos )                               /*!< SHS SHSCFG: TC Mask                     */
    #define SHS_SHSCFG_STATE_Pos        28                                                            /*!< SHS SHSCFG: STATE Position              */
    #define SHS_SHSCFG_STATE_Msk        ( 0x0fUL << SHS_SHSCFG_STATE_Pos )                            /*!< SHS SHSCFG: STATE Mask                  */

/* ---------------------------------  SHS_STEPCFG  -------------------------------- */
    #define SHS_STEPCFG_KSEL0_Pos       0                                                             /*!< SHS STEPCFG: KSEL0 Position             */
    #define SHS_STEPCFG_KSEL0_Msk       ( 0x07UL << SHS_STEPCFG_KSEL0_Pos )                           /*!< SHS STEPCFG: KSEL0 Mask                 */
    #define SHS_STEPCFG_SEN0_Pos        3                                                             /*!< SHS STEPCFG: SEN0 Position              */
    #define SHS_STEPCFG_SEN0_Msk        ( 0x01UL << SHS_STEPCFG_SEN0_Pos )                            /*!< SHS STEPCFG: SEN0 Mask                  */
    #define SHS_STEPCFG_KSEL1_Pos       4                                                             /*!< SHS STEPCFG: KSEL1 Position             */
    #define SHS_STEPCFG_KSEL1_Msk       ( 0x07UL << SHS_STEPCFG_KSEL1_Pos )                           /*!< SHS STEPCFG: KSEL1 Mask                 */
    #define SHS_STEPCFG_SEN1_Pos        7                                                             /*!< SHS STEPCFG: SEN1 Position              */
    #define SHS_STEPCFG_SEN1_Msk        ( 0x01UL << SHS_STEPCFG_SEN1_Pos )                            /*!< SHS STEPCFG: SEN1 Mask                  */
    #define SHS_STEPCFG_KSEL2_Pos       8                                                             /*!< SHS STEPCFG: KSEL2 Position             */
    #define SHS_STEPCFG_KSEL2_Msk       ( 0x07UL << SHS_STEPCFG_KSEL2_Pos )                           /*!< SHS STEPCFG: KSEL2 Mask                 */
    #define SHS_STEPCFG_SEN2_Pos        11                                                            /*!< SHS STEPCFG: SEN2 Position              */
    #define SHS_STEPCFG_SEN2_Msk        ( 0x01UL << SHS_STEPCFG_SEN2_Pos )                            /*!< SHS STEPCFG: SEN2 Mask                  */
    #define SHS_STEPCFG_KSEL3_Pos       12                                                            /*!< SHS STEPCFG: KSEL3 Position             */
    #define SHS_STEPCFG_KSEL3_Msk       ( 0x07UL << SHS_STEPCFG_KSEL3_Pos )                           /*!< SHS STEPCFG: KSEL3 Mask                 */
    #define SHS_STEPCFG_SEN3_Pos        15                                                            /*!< SHS STEPCFG: SEN3 Position              */
    #define SHS_STEPCFG_SEN3_Msk        ( 0x01UL << SHS_STEPCFG_SEN3_Pos )                            /*!< SHS STEPCFG: SEN3 Mask                  */
    #define SHS_STEPCFG_KSEL4_Pos       16                                                            /*!< SHS STEPCFG: KSEL4 Position             */
    #define SHS_STEPCFG_KSEL4_Msk       ( 0x07UL << SHS_STEPCFG_KSEL4_Pos )                           /*!< SHS STEPCFG: KSEL4 Mask                 */
    #define SHS_STEPCFG_SEN4_Pos        19                                                            /*!< SHS STEPCFG: SEN4 Position              */
    #define SHS_STEPCFG_SEN4_Msk        ( 0x01UL << SHS_STEPCFG_SEN4_Pos )                            /*!< SHS STEPCFG: SEN4 Mask                  */
    #define SHS_STEPCFG_KSEL5_Pos       20                                                            /*!< SHS STEPCFG: KSEL5 Position             */
    #define SHS_STEPCFG_KSEL5_Msk       ( 0x07UL << SHS_STEPCFG_KSEL5_Pos )                           /*!< SHS STEPCFG: KSEL5 Mask                 */
    #define SHS_STEPCFG_SEN5_Pos        23                                                            /*!< SHS STEPCFG: SEN5 Position              */
    #define SHS_STEPCFG_SEN5_Msk        ( 0x01UL << SHS_STEPCFG_SEN5_Pos )                            /*!< SHS STEPCFG: SEN5 Mask                  */
    #define SHS_STEPCFG_KSEL6_Pos       24                                                            /*!< SHS STEPCFG: KSEL6 Position             */
    #define SHS_STEPCFG_KSEL6_Msk       ( 0x07UL << SHS_STEPCFG_KSEL6_Pos )                           /*!< SHS STEPCFG: KSEL6 Mask                 */
    #define SHS_STEPCFG_SEN6_Pos        27                                                            /*!< SHS STEPCFG: SEN6 Position              */
    #define SHS_STEPCFG_SEN6_Msk        ( 0x01UL << SHS_STEPCFG_SEN6_Pos )                            /*!< SHS STEPCFG: SEN6 Mask                  */
    #define SHS_STEPCFG_KSEL7_Pos       28                                                            /*!< SHS STEPCFG: KSEL7 Position             */
    #define SHS_STEPCFG_KSEL7_Msk       ( 0x07UL << SHS_STEPCFG_KSEL7_Pos )                           /*!< SHS STEPCFG: KSEL7 Mask                 */
    #define SHS_STEPCFG_SEN7_Pos        31                                                            /*!< SHS STEPCFG: SEN7 Position              */
    #define SHS_STEPCFG_SEN7_Msk        ( 0x01UL << SHS_STEPCFG_SEN7_Pos )                            /*!< SHS STEPCFG: SEN7 Mask                  */

/* ----------------------------------  SHS_LOOP  ---------------------------------- */
    #define SHS_LOOP_LPCH0_Pos          0                                                             /*!< SHS LOOP: LPCH0 Position                */
    #define SHS_LOOP_LPCH0_Msk          ( 0x1fUL << SHS_LOOP_LPCH0_Pos )                              /*!< SHS LOOP: LPCH0 Mask                    */
    #define SHS_LOOP_LPSH0_Pos          8                                                             /*!< SHS LOOP: LPSH0 Position                */
    #define SHS_LOOP_LPSH0_Msk          ( 0x01UL << SHS_LOOP_LPSH0_Pos )                              /*!< SHS LOOP: LPSH0 Mask                    */
    #define SHS_LOOP_LPEN0_Pos          15                                                            /*!< SHS LOOP: LPEN0 Position                */
    #define SHS_LOOP_LPEN0_Msk          ( 0x01UL << SHS_LOOP_LPEN0_Pos )                              /*!< SHS LOOP: LPEN0 Mask                    */
    #define SHS_LOOP_LPCH1_Pos          16                                                            /*!< SHS LOOP: LPCH1 Position                */
    #define SHS_LOOP_LPCH1_Msk          ( 0x1fUL << SHS_LOOP_LPCH1_Pos )                              /*!< SHS LOOP: LPCH1 Mask                    */
    #define SHS_LOOP_LPSH1_Pos          24                                                            /*!< SHS LOOP: LPSH1 Position                */
    #define SHS_LOOP_LPSH1_Msk          ( 0x01UL << SHS_LOOP_LPSH1_Pos )                              /*!< SHS LOOP: LPSH1 Mask                    */
    #define SHS_LOOP_LPEN1_Pos          31                                                            /*!< SHS LOOP: LPEN1 Position                */
    #define SHS_LOOP_LPEN1_Msk          ( 0x01UL << SHS_LOOP_LPEN1_Pos )                              /*!< SHS LOOP: LPEN1 Mask                    */

/* ---------------------------------  SHS_TIMCFG0  -------------------------------- */
    #define SHS_TIMCFG0_AT_Pos          0                                                             /*!< SHS TIMCFG0: AT Position                */
    #define SHS_TIMCFG0_AT_Msk          ( 0x01UL << SHS_TIMCFG0_AT_Pos )                              /*!< SHS TIMCFG0: AT Mask                    */
    #define SHS_TIMCFG0_FCRT_Pos        4                                                             /*!< SHS TIMCFG0: FCRT Position              */
    #define SHS_TIMCFG0_FCRT_Msk        ( 0x0fUL << SHS_TIMCFG0_FCRT_Pos )                            /*!< SHS TIMCFG0: FCRT Mask                  */
    #define SHS_TIMCFG0_SST_Pos         8                                                             /*!< SHS TIMCFG0: SST Position               */
    #define SHS_TIMCFG0_SST_Msk         ( 0x3fUL << SHS_TIMCFG0_SST_Pos )                             /*!< SHS TIMCFG0: SST Mask                   */
    #define SHS_TIMCFG0_TGEN_Pos        16                                                            /*!< SHS TIMCFG0: TGEN Position              */
    #define SHS_TIMCFG0_TGEN_Msk        ( 0x00003fffUL << SHS_TIMCFG0_TGEN_Pos )                      /*!< SHS TIMCFG0: TGEN Mask                  */

/* ---------------------------------  SHS_TIMCFG1  -------------------------------- */
    #define SHS_TIMCFG1_AT_Pos          0                                                             /*!< SHS TIMCFG1: AT Position                */
    #define SHS_TIMCFG1_AT_Msk          ( 0x01UL << SHS_TIMCFG1_AT_Pos )                              /*!< SHS TIMCFG1: AT Mask                    */
    #define SHS_TIMCFG1_FCRT_Pos        4                                                             /*!< SHS TIMCFG1: FCRT Position              */
    #define SHS_TIMCFG1_FCRT_Msk        ( 0x0fUL << SHS_TIMCFG1_FCRT_Pos )                            /*!< SHS TIMCFG1: FCRT Mask                  */
    #define SHS_TIMCFG1_SST_Pos         8                                                             /*!< SHS TIMCFG1: SST Position               */
    #define SHS_TIMCFG1_SST_Msk         ( 0x3fUL << SHS_TIMCFG1_SST_Pos )                             /*!< SHS TIMCFG1: SST Mask                   */
    #define SHS_TIMCFG1_TGEN_Pos        16                                                            /*!< SHS TIMCFG1: TGEN Position              */
    #define SHS_TIMCFG1_TGEN_Msk        ( 0x00003fffUL << SHS_TIMCFG1_TGEN_Pos )                      /*!< SHS TIMCFG1: TGEN Mask                  */

/* ---------------------------------  SHS_CALCTR  --------------------------------- */
    #define SHS_CALCTR_CALORD_Pos       0                                                             /*!< SHS CALCTR: CALORD Position             */
    #define SHS_CALCTR_CALORD_Msk       ( 0x01UL << SHS_CALCTR_CALORD_Pos )                           /*!< SHS CALCTR: CALORD Mask                 */
    #define SHS_CALCTR_CALGNSTC_Pos     8                                                             /*!< SHS CALCTR: CALGNSTC Position           */
    #define SHS_CALCTR_CALGNSTC_Msk     ( 0x3fUL << SHS_CALCTR_CALGNSTC_Pos )                         /*!< SHS CALCTR: CALGNSTC Mask               */
    #define SHS_CALCTR_SUCALVAL_Pos     16                                                            /*!< SHS CALCTR: SUCALVAL Position           */
    #define SHS_CALCTR_SUCALVAL_Msk     ( 0x7fUL << SHS_CALCTR_SUCALVAL_Pos )                         /*!< SHS CALCTR: SUCALVAL Mask               */
    #define SHS_CALCTR_CALMAX_Pos       24                                                            /*!< SHS CALCTR: CALMAX Position             */
    #define SHS_CALCTR_CALMAX_Msk       ( 0x3fUL << SHS_CALCTR_CALMAX_Pos )                           /*!< SHS CALCTR: CALMAX Mask                 */
    #define SHS_CALCTR_SUCAL_Pos        31                                                            /*!< SHS CALCTR: SUCAL Position              */
    #define SHS_CALCTR_SUCAL_Msk        ( 0x01UL << SHS_CALCTR_SUCAL_Pos )                            /*!< SHS CALCTR: SUCAL Mask                  */

