FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* -------------------------------  BCCU_CH_PKCNTR  ------------------------------- */
    #define BCCU_CH_PKCNTR_OFFCNTVAL_Pos    0                                                         /*!< BCCU_CH PKCNTR: OFFCNTVAL Position      */
    #define BCCU_CH_PKCNTR_OFFCNTVAL_Msk    ( 0x000000ffUL << BCCU_CH_PKCNTR_OFFCNTVAL_Pos )          /*!< BCCU_CH PKCNTR: OFFCNTVAL Mask          */
    #define BCCU_CH_PKCNTR_ONCNTVAL_Pos     16                                                        /*!< BCCU_CH PKCNTR: ONCNTVAL Position       */
    #define BCCU_CH_PKCNTR_ONCNTVAL_Msk     ( 0x000000ffUL << BCCU_CH_PKCNTR_ONCNTVAL_Pos )           /*!< BCCU_CH PKCNTR: ONCNTVAL Mask           */


/* ================================================================================ */
/* ================         Group 'BCCU_DE' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  BCCU_DE_DLS  -------------------------------- */
    #define BCCU_DE_DLS_TDLEV_Pos     0                                                               /*!< BCCU_DE DLS: TDLEV Position             */
    #define BCCU_DE_DLS_TDLEV_Msk     ( 0x00000fffUL << BCCU_DE_DLS_TDLEV_Pos )                       /*!< BCCU_DE DLS: TDLEV Mask                 */

/* ---------------------------------  BCCU_DE_DL  --------------------------------- */
    #define BCCU_DE_DL_DLEV_Pos       0                                                               /*!< BCCU_DE DL: DLEV Position               */
    #define BCCU_DE_DL_DLEV_Msk       ( 0x00000fffUL << BCCU_DE_DL_DLEV_Pos )                         /*!< BCCU_DE DL: DLEV Mask                   */

/* ---------------------------------  BCCU_DE_DTT  -------------------------------- */
    #define BCCU_DE_DTT_DIMDIV_Pos    0                                                               /*!< BCCU_DE DTT: DIMDIV Position            */
    #define BCCU_DE_DTT_DIMDIV_Msk    ( 0x000003ffUL << BCCU_DE_DTT_DIMDIV_Pos )                      /*!< BCCU_DE DTT: DIMDIV Mask                */
    #define BCCU_DE_DTT_DTEN_Pos      16                                                              /*!< BCCU_DE DTT: DTEN Position              */
    #define BCCU_DE_DTT_DTEN_Msk      ( 0x01UL << BCCU_DE_DTT_DTEN_Pos )                              /*!< BCCU_DE DTT: DTEN Mask                  */
    #define BCCU_DE_DTT_CSEL_Pos      17                                                              /*!< BCCU_DE DTT: CSEL Position              */
    #define BCCU_DE_DTT_CSEL_Msk      ( 0x01UL << BCCU_DE_DTT_CSEL_Pos )                              /*!< BCCU_DE DTT: CSEL Mask                  */


/* ================================================================================ */
/* ================         struct 'PORT0' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  PORT0_OUT  --------------------------------- */
    #define PORT0_OUT_P0_Pos          0                                                               /*!< PORT0 OUT: P0 Position                  */
    #define PORT0_OUT_P0_Msk          ( 0x01UL << PORT0_OUT_P0_Pos )                                  /*!< PORT0 OUT: P0 Mask                      */
    #define PORT0_OUT_P1_Pos          1                                                               /*!< PORT0 OUT: P1 Position                  */
    #define PORT0_OUT_P1_Msk          ( 0x01UL << PORT0_OUT_P1_Pos )                                  /*!< PORT0 OUT: P1 Mask                      */
    #define PORT0_OUT_P2_Pos          2                                                               /*!< PORT0 OUT: P2 Position                  */
    #define PORT0_OUT_P2_Msk          ( 0x01UL << PORT0_OUT_P2_Pos )                                  /*!< PORT0 OUT: P2 Mask                      */
    #define PORT0_OUT_P3_Pos          3                                                               /*!< PORT0 OUT: P3 Position                  */
    #define PORT0_OUT_P3_Msk          ( 0x01UL << PORT0_OUT_P3_Pos )                                  /*!< PORT0 OUT: P3 Mask                      */
    #define PORT0_OUT_P4_Pos          4                                                               /*!< PORT0 OUT: P4 Position                  */
    #define PORT0_OUT_P4_Msk          ( 0x01UL << PORT0_OUT_P4_Pos )                                  /*!< PORT0 OUT: P4 Mask                      */
    #define PORT0_OUT_P5_Pos          5                                                               /*!< PORT0 OUT: P5 Position                  */
    #define PORT0_OUT_P5_Msk          ( 0x01UL << PORT0_OUT_P5_Pos )                                  /*!< PORT0 OUT: P5 Mask                      */
    #define PORT0_OUT_P6_Pos          6                                                               /*!< PORT0 OUT: P6 Position                  */
    #define PORT0_OUT_P6_Msk          ( 0x01UL << PORT0_OUT_P6_Pos )                                  /*!< PORT0 OUT: P6 Mask                      */
    #define PORT0_OUT_P7_Pos          7                                                               /*!< PORT0 OUT: P7 Position                  */
    #define PORT0_OUT_P7_Msk          ( 0x01UL << PORT0_OUT_P7_Pos )                                  /*!< PORT0 OUT: P7 Mask                      */
    #define PORT0_OUT_P8_Pos          8                                                               /*!< PORT0 OUT: P8 Position                  */
    #define PORT0_OUT_P8_Msk          ( 0x01UL << PORT0_OUT_P8_Pos )                                  /*!< PORT0 OUT: P8 Mask                      */
    #define PORT0_OUT_P9_Pos          9                                                               /*!< PORT0 OUT: P9 Position                  */
    #define PORT0_OUT_P9_Msk          ( 0x01UL << PORT0_OUT_P9_Pos )                                  /*!< PORT0 OUT: P9 Mask                      */
    #define PORT0_OUT_P10_Pos         10                                                              /*!< PORT0 OUT: P10 Position                 */
    #define PORT0_OUT_P10_Msk         ( 0x01UL << PORT0_OUT_P10_Pos )                                 /*!< PORT0 OUT: P10 Mask                     */
    #define PORT0_OUT_P11_Pos         11                                                              /*!< PORT0 OUT: P11 Position                 */
    #define PORT0_OUT_P11_Msk         ( 0x01UL << PORT0_OUT_P11_Pos )                                 /*!< PORT0 OUT: P11 Mask                     */
    #define PORT0_OUT_P12_Pos         12                                                              /*!< PORT0 OUT: P12 Position                 */
    #define PORT0_OUT_P12_Msk         ( 0x01UL << PORT0_OUT_P12_Pos )                                 /*!< PORT0 OUT: P12 Mask                     */
    #define PORT0_OUT_P13_Pos         13                                                              /*!< PORT0 OUT: P13 Position                 */
    #define PORT0_OUT_P13_Msk         ( 0x01UL << PORT0_OUT_P13_Pos )                                 /*!< PORT0 OUT: P13 Mask                     */
    #define PORT0_OUT_P14_Pos         14                                                              /*!< PORT0 OUT: P14 Position                 */
    #define PORT0_OUT_P14_Msk         ( 0x01UL << PORT0_OUT_P14_Pos )                                 /*!< PORT0 OUT: P14 Mask                     */
    #define PORT0_OUT_P15_Pos         15                                                              /*!< PORT0 OUT: P15 Position                 */
    #define PORT0_OUT_P15_Msk         ( 0x01UL << PORT0_OUT_P15_Pos )                                 /*!< PORT0 OUT: P15 Mask                     */

/* ----------------------------------  PORT0_OMR  --------------------------------- */
    #define PORT0_OMR_PS0_Pos         0                                                               /*!< PORT0 OMR: PS0 Position                 */
    #define PORT0_OMR_PS0_Msk         ( 0x01UL << PORT0_OMR_PS0_Pos )                                 /*!< PORT0 OMR: PS0 Mask                     */
    #define PORT0_OMR_PS1_Pos         1                                                               /*!< PORT0 OMR: PS1 Position                 */
    #define PORT0_OMR_PS1_Msk         ( 0x01UL << PORT0_OMR_PS1_Pos )                                 /*!< PORT0 OMR: PS1 Mask                     */
    #define PORT0_OMR_PS2_Pos         2                                                               /*!< PORT0 OMR: PS2 Position                 */
    #define PORT0_OMR_PS2_Msk         ( 0x01UL << PORT0_OMR_PS2_Pos )                                 /*!< PORT0 OMR: PS2 Mask                     */
    #define PORT0_OMR_PS3_Pos         3                                                               /*!< PORT0 OMR: PS3 Position                 */
    #define PORT0_OMR_PS3_Msk         ( 0x01UL << PORT0_OMR_PS3_Pos )                                 /*!< PORT0 OMR: PS3 Mask                     */
    #define PORT0_OMR_PS4_Pos         4                                                               /*!< PORT0 OMR: PS4 Position                 */
    #define PORT0_OMR_PS4_Msk         ( 0x01UL << PORT0_OMR_PS4_Pos )                                 /*!< PORT0 OMR: PS4 Mask                     */
    #define PORT0_OMR_PS5_Pos         5                                                               /*!< PORT0 OMR: PS5 Position                 */
    #define PORT0_OMR_PS5_Msk         ( 0x01UL << PORT0_OMR_PS5_Pos )                                 /*!< PORT0 OMR: PS5 Mask                     */
    #define PORT0_OMR_PS6_Pos         6                                                               /*!< PORT0 OMR: PS6 Position                 */
    #define PORT0_OMR_PS6_Msk         ( 0x01UL << PORT0_OMR_PS6_Pos )                                 /*!< PORT0 OMR: PS6 Mask                     */
    #define PORT0_OMR_PS7_Pos         7                                                               /*!< PORT0 OMR: PS7 Position                 */
    #define PORT0_OMR_PS7_Msk         ( 0x01UL << PORT0_OMR_PS7_Pos )                                 /*!< PORT0 OMR: PS7 Mask                     */
    #define PORT0_OMR_PS8_Pos         8                                                               /*!< PORT0 OMR: PS8 Position                 */
    #define PORT0_OMR_PS8_Msk         ( 0x01UL << PORT0_OMR_PS8_Pos )                                 /*!< PORT0 OMR: PS8 Mask                     */
    #define PORT0_OMR_PS9_Pos         9                                                               /*!< PORT0 OMR: PS9 Position                 */
    #define PORT0_OMR_PS9_Msk         ( 0x01UL << PORT0_OMR_PS9_Pos )                                 /*!< PORT0 OMR: PS9 Mask                     */
    #define PORT0_OMR_PS10_Pos        10                                                              /*!< PORT0 OMR: PS10 Position                */
    #define PORT0_OMR_PS10_Msk        ( 0x01UL << PORT0_OMR_PS10_Pos )                                /*!< PORT0 OMR: PS10 Mask                    */
    #define PORT0_OMR_PS11_Pos        11                                                              /*!< PORT0 OMR: PS11 Position                */
    #define PORT0_OMR_PS11_Msk        ( 0x01UL << PORT0_OMR_PS11_Pos )                                /*!< PORT0 OMR: PS11 Mask                    */
    #define PORT0_OMR_PS12_Pos        12                                                              /*!< PORT0 OMR: PS12 Position                */
    #define PORT0_OMR_PS12_Msk        ( 0x01UL << PORT0_OMR_PS12_Pos )                                /*!< PORT0 OMR: PS12 Mask                    */
    #define PORT0_OMR_PS13_Pos        13                                                              /*!< PORT0 OMR: PS13 Position                */
    #define PORT0_OMR_PS13_Msk        ( 0x01UL << PORT0_OMR_PS13_Pos )                                /*!< PORT0 OMR: PS13 Mask                    */
    #define PORT0_OMR_PS14_Pos        14                                                              /*!< PORT0 OMR: PS14 Position                */
    #define PORT0_OMR_PS14_Msk        ( 0x01UL << PORT0_OMR_PS14_Pos )                                /*!< PORT0 OMR: PS14 Mask                    */
    #define PORT0_OMR_PS15_Pos        15                                                              /*!< PORT0 OMR: PS15 Position                */
    #define PORT0_OMR_PS15_Msk        ( 0x01UL << PORT0_OMR_PS15_Pos )                                /*!< PORT0 OMR: PS15 Mask                    */
    #define PORT0_OMR_PR0_Pos         16                                                              /*!< PORT0 OMR: PR0 Position                 */
    #define PORT0_OMR_PR0_Msk         ( 0x01UL << PORT0_OMR_PR0_Pos )                                 /*!< PORT0 OMR: PR0 Mask                     */
    #define PORT0_OMR_PR1_Pos         17                                                              /*!< PORT0 OMR: PR1 Position                 */
    #define PORT0_OMR_PR1_Msk         ( 0x01UL << PORT0_OMR_PR1_Pos )                                 /*!< PORT0 OMR: PR1 Mask                     */
    #define PORT0_OMR_PR2_Pos         18                                                              /*!< PORT0 OMR: PR2 Position                 */
    #define PORT0_OMR_PR2_Msk         ( 0x01UL << PORT0_OMR_PR2_Pos )                                 /*!< PORT0 OMR: PR2 Mask                     */
    #define PORT0_OMR_PR3_Pos         19                                                              /*!< PORT0 OMR: PR3 Position                 */
    #define PORT0_OMR_PR3_Msk         ( 0x01UL << PORT0_OMR_PR3_Pos )                                 /*!< PORT0 OMR: PR3 Mask                     */
    #define PORT0_OMR_PR4_Pos         20                                                              /*!< PORT0 OMR: PR4 Position                 */
    #define PORT0_OMR_PR4_Msk         ( 0x01UL << PORT0_OMR_PR4_Pos )                                 /*!< PORT0 OMR: PR4 Mask                     */
    #define PORT0_OMR_PR5_Pos         21                                                              /*!< PORT0 OMR: PR5 Position                 */
    #define PORT0_OMR_PR5_Msk         ( 0x01UL << PORT0_OMR_PR5_Pos )                                 /*!< PORT0 OMR: PR5 Mask                     */
    #define PORT0_OMR_PR6_Pos         22                                                              /*!< PORT0 OMR: PR6 Position                 */
    #define PORT0_OMR_PR6_Msk         ( 0x01UL << PORT0_OMR_PR6_Pos )                                 /*!< PORT0 OMR: PR6 Mask                     */
    #define PORT0_OMR_PR7_Pos         23                                                              /*!< PORT0 OMR: PR7 Position                 */
    #define PORT0_OMR_PR7_Msk         ( 0x01UL << PORT0_OMR_PR7_Pos )                                 /*!< PORT0 OMR: PR7 Mask                     */
    #define PORT0_OMR_PR8_Pos         24                                                              /*!< PORT0 OMR: PR8 Position                 */
    #define PORT0_OMR_PR8_Msk         ( 0x01UL << PORT0_OMR_PR8_Pos )                                 /*!< PORT0 OMR: PR8 Mask                     */
    #define PORT0_OMR_PR9_Pos         25                                                              /*!< PORT0 OMR: PR9 Position                 */
    #define PORT0_OMR_PR9_Msk         ( 0x01UL << PORT0_OMR_PR9_Pos )                                 /*!< PORT0 OMR: PR9 Mask                     */
    #define PORT0_OMR_PR10_Pos        26                                                              /*!< PORT0 OMR: PR10 Position                */
    #define PORT0_OMR_PR10_Msk        ( 0x01UL << PORT0_OMR_PR10_Pos )                                /*!< PORT0 OMR: PR10 Mask                    */
    #define PORT0_OMR_PR11_Pos        27                                                              /*!< PORT0 OMR: PR11 Position                */
    #define PORT0_OMR_PR11_Msk        ( 0x01UL << PORT0_OMR_PR11_Pos )                                /*!< PORT0 OMR: PR11 Mask                    */
    #define PORT0_OMR_PR12_Pos        28                                                              /*!< PORT0 OMR: PR12 Position                */
    #define PORT0_OMR_PR12_Msk        ( 0x01UL << PORT0_OMR_PR12_Pos )                                /*!< PORT0 OMR: PR12 Mask                    */
    #define PORT0_OMR_PR13_Pos        29                                                              /*!< PORT0 OMR: PR13 Position                */
    #define PORT0_OMR_PR13_Msk        ( 0x01UL << PORT0_OMR_PR13_Pos )                                /*!< PORT0 OMR: PR13 Mask                    */
    #define PORT0_OMR_PR14_Pos        30                                                              /*!< PORT0 OMR: PR14 Position                */
    #define PORT0_OMR_PR14_Msk        ( 0x01UL << PORT0_OMR_PR14_Pos )                                /*!< PORT0 OMR: PR14 Mask                    */
    #define PORT0_OMR_PR15_Pos        31                                                              /*!< PORT0 OMR: PR15 Position                */
    #define PORT0_OMR_PR15_Msk        ( 0x01UL << PORT0_OMR_PR15_Pos )                                /*!< PORT0 OMR: PR15 Mask                    */

/* ---------------------------------  PORT0_IOCR0  -------------------------------- */
    #define PORT0_IOCR0_PC0_Pos       3                                                               /*!< PORT0 IOCR0: PC0 Position               */
    #define PORT0_IOCR0_PC0_Msk       ( 0x1fUL << PORT0_IOCR0_PC0_Pos )                               /*!< PORT0 IOCR0: PC0 Mask                   */
    #define PORT0_IOCR0_PC1_Pos       11                                                              /*!< PORT0 IOCR0: PC1 Position               */
    #define PORT0_IOCR0_PC1_Msk       ( 0x1fUL << PORT0_IOCR0_PC1_Pos )                               /*!< PORT0 IOCR0: PC1 Mask                   */
    #define PORT0_IOCR0_PC2_Pos       19                                                              /*!< PORT0 IOCR0: PC2 Position               */
    #define PORT0_IOCR0_PC2_Msk       ( 0x1fUL << PORT0_IOCR0_PC2_Pos )                               /*!< PORT0 IOCR0: PC2 Mask                   */
    #define PORT0_IOCR0_PC3_Pos       27                                                              /*!< PORT0 IOCR0: PC3 Position               */
    #define PORT0_IOCR0_PC3_Msk       ( 0x1fUL << PORT0_IOCR0_PC3_Pos )                               /*!< PORT0 IOCR0: PC3 Mask                   */

