FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  PORT0_IOCR4  -------------------------------- */
    #define PORT0_IOCR4_PC4_Pos       3                                                               /*!< PORT0 IOCR4: PC4 Position               */
    #define PORT0_IOCR4_PC4_Msk       ( 0x1fUL << PORT0_IOCR4_PC4_Pos )                               /*!< PORT0 IOCR4: PC4 Mask                   */
    #define PORT0_IOCR4_PC5_Pos       11                                                              /*!< PORT0 IOCR4: PC5 Position               */
    #define PORT0_IOCR4_PC5_Msk       ( 0x1fUL << PORT0_IOCR4_PC5_Pos )                               /*!< PORT0 IOCR4: PC5 Mask                   */
    #define PORT0_IOCR4_PC6_Pos       19                                                              /*!< PORT0 IOCR4: PC6 Position               */
    #define PORT0_IOCR4_PC6_Msk       ( 0x1fUL << PORT0_IOCR4_PC6_Pos )                               /*!< PORT0 IOCR4: PC6 Mask                   */
    #define PORT0_IOCR4_PC7_Pos       27                                                              /*!< PORT0 IOCR4: PC7 Position               */
    #define PORT0_IOCR4_PC7_Msk       ( 0x1fUL << PORT0_IOCR4_PC7_Pos )                               /*!< PORT0 IOCR4: PC7 Mask                   */

/* ---------------------------------  PORT0_IOCR8  -------------------------------- */
    #define PORT0_IOCR8_PC8_Pos       3                                                               /*!< PORT0 IOCR8: PC8 Position               */
    #define PORT0_IOCR8_PC8_Msk       ( 0x1fUL << PORT0_IOCR8_PC8_Pos )                               /*!< PORT0 IOCR8: PC8 Mask                   */
    #define PORT0_IOCR8_PC9_Pos       11                                                              /*!< PORT0 IOCR8: PC9 Position               */
    #define PORT0_IOCR8_PC9_Msk       ( 0x1fUL << PORT0_IOCR8_PC9_Pos )                               /*!< PORT0 IOCR8: PC9 Mask                   */
    #define PORT0_IOCR8_PC10_Pos      19                                                              /*!< PORT0 IOCR8: PC10 Position              */
    #define PORT0_IOCR8_PC10_Msk      ( 0x1fUL << PORT0_IOCR8_PC10_Pos )                              /*!< PORT0 IOCR8: PC10 Mask                  */
    #define PORT0_IOCR8_PC11_Pos      27                                                              /*!< PORT0 IOCR8: PC11 Position              */
    #define PORT0_IOCR8_PC11_Msk      ( 0x1fUL << PORT0_IOCR8_PC11_Pos )                              /*!< PORT0 IOCR8: PC11 Mask                  */

/* --------------------------------  PORT0_IOCR12  -------------------------------- */
    #define PORT0_IOCR12_PC12_Pos     3                                                               /*!< PORT0 IOCR12: PC12 Position             */
    #define PORT0_IOCR12_PC12_Msk     ( 0x1fUL << PORT0_IOCR12_PC12_Pos )                             /*!< PORT0 IOCR12: PC12 Mask                 */
    #define PORT0_IOCR12_PC13_Pos     11                                                              /*!< PORT0 IOCR12: PC13 Position             */
    #define PORT0_IOCR12_PC13_Msk     ( 0x1fUL << PORT0_IOCR12_PC13_Pos )                             /*!< PORT0 IOCR12: PC13 Mask                 */
    #define PORT0_IOCR12_PC14_Pos     19                                                              /*!< PORT0 IOCR12: PC14 Position             */
    #define PORT0_IOCR12_PC14_Msk     ( 0x1fUL << PORT0_IOCR12_PC14_Pos )                             /*!< PORT0 IOCR12: PC14 Mask                 */
    #define PORT0_IOCR12_PC15_Pos     27                                                              /*!< PORT0 IOCR12: PC15 Position             */
    #define PORT0_IOCR12_PC15_Msk     ( 0x1fUL << PORT0_IOCR12_PC15_Pos )                             /*!< PORT0 IOCR12: PC15 Mask                 */

/* ----------------------------------  PORT0_IN  ---------------------------------- */
    #define PORT0_IN_P0_Pos           0                                                               /*!< PORT0 IN: P0 Position                   */
    #define PORT0_IN_P0_Msk           ( 0x01UL << PORT0_IN_P0_Pos )                                   /*!< PORT0 IN: P0 Mask                       */
    #define PORT0_IN_P1_Pos           1                                                               /*!< PORT0 IN: P1 Position                   */
    #define PORT0_IN_P1_Msk           ( 0x01UL << PORT0_IN_P1_Pos )                                   /*!< PORT0 IN: P1 Mask                       */
    #define PORT0_IN_P2_Pos           2                                                               /*!< PORT0 IN: P2 Position                   */
    #define PORT0_IN_P2_Msk           ( 0x01UL << PORT0_IN_P2_Pos )                                   /*!< PORT0 IN: P2 Mask                       */
    #define PORT0_IN_P3_Pos           3                                                               /*!< PORT0 IN: P3 Position                   */
    #define PORT0_IN_P3_Msk           ( 0x01UL << PORT0_IN_P3_Pos )                                   /*!< PORT0 IN: P3 Mask                       */
    #define PORT0_IN_P4_Pos           4                                                               /*!< PORT0 IN: P4 Position                   */
    #define PORT0_IN_P4_Msk           ( 0x01UL << PORT0_IN_P4_Pos )                                   /*!< PORT0 IN: P4 Mask                       */
    #define PORT0_IN_P5_Pos           5                                                               /*!< PORT0 IN: P5 Position                   */
    #define PORT0_IN_P5_Msk           ( 0x01UL << PORT0_IN_P5_Pos )                                   /*!< PORT0 IN: P5 Mask                       */
    #define PORT0_IN_P6_Pos           6                                                               /*!< PORT0 IN: P6 Position                   */
    #define PORT0_IN_P6_Msk           ( 0x01UL << PORT0_IN_P6_Pos )                                   /*!< PORT0 IN: P6 Mask                       */
    #define PORT0_IN_P7_Pos           7                                                               /*!< PORT0 IN: P7 Position                   */
    #define PORT0_IN_P7_Msk           ( 0x01UL << PORT0_IN_P7_Pos )                                   /*!< PORT0 IN: P7 Mask                       */
    #define PORT0_IN_P8_Pos           8                                                               /*!< PORT0 IN: P8 Position                   */
    #define PORT0_IN_P8_Msk           ( 0x01UL << PORT0_IN_P8_Pos )                                   /*!< PORT0 IN: P8 Mask                       */
    #define PORT0_IN_P9_Pos           9                                                               /*!< PORT0 IN: P9 Position                   */
    #define PORT0_IN_P9_Msk           ( 0x01UL << PORT0_IN_P9_Pos )                                   /*!< PORT0 IN: P9 Mask                       */
    #define PORT0_IN_P10_Pos          10                                                              /*!< PORT0 IN: P10 Position                  */
    #define PORT0_IN_P10_Msk          ( 0x01UL << PORT0_IN_P10_Pos )                                  /*!< PORT0 IN: P10 Mask                      */
    #define PORT0_IN_P11_Pos          11                                                              /*!< PORT0 IN: P11 Position                  */
    #define PORT0_IN_P11_Msk          ( 0x01UL << PORT0_IN_P11_Pos )                                  /*!< PORT0 IN: P11 Mask                      */
    #define PORT0_IN_P12_Pos          12                                                              /*!< PORT0 IN: P12 Position                  */
    #define PORT0_IN_P12_Msk          ( 0x01UL << PORT0_IN_P12_Pos )                                  /*!< PORT0 IN: P12 Mask                      */
    #define PORT0_IN_P13_Pos          13                                                              /*!< PORT0 IN: P13 Position                  */
    #define PORT0_IN_P13_Msk          ( 0x01UL << PORT0_IN_P13_Pos )                                  /*!< PORT0 IN: P13 Mask                      */
    #define PORT0_IN_P14_Pos          14                                                              /*!< PORT0 IN: P14 Position                  */
    #define PORT0_IN_P14_Msk          ( 0x01UL << PORT0_IN_P14_Pos )                                  /*!< PORT0 IN: P14 Mask                      */
    #define PORT0_IN_P15_Pos          15                                                              /*!< PORT0 IN: P15 Position                  */
    #define PORT0_IN_P15_Msk          ( 0x01UL << PORT0_IN_P15_Pos )                                  /*!< PORT0 IN: P15 Mask                      */

