FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  PORT0_PHCR0  -------------------------------- */
    #define PORT0_PHCR0_PH0_Pos       2                                                               /*!< PORT0 PHCR0: PH0 Position               */
    #define PORT0_PHCR0_PH0_Msk       ( 0x01UL << PORT0_PHCR0_PH0_Pos )                               /*!< PORT0 PHCR0: PH0 Mask                   */
    #define PORT0_PHCR0_PH1_Pos       6                                                               /*!< PORT0 PHCR0: PH1 Position               */
    #define PORT0_PHCR0_PH1_Msk       ( 0x01UL << PORT0_PHCR0_PH1_Pos )                               /*!< PORT0 PHCR0: PH1 Mask                   */
    #define PORT0_PHCR0_PH2_Pos       10                                                              /*!< PORT0 PHCR0: PH2 Position               */
    #define PORT0_PHCR0_PH2_Msk       ( 0x01UL << PORT0_PHCR0_PH2_Pos )                               /*!< PORT0 PHCR0: PH2 Mask                   */
    #define PORT0_PHCR0_PH3_Pos       14                                                              /*!< PORT0 PHCR0: PH3 Position               */
    #define PORT0_PHCR0_PH3_Msk       ( 0x01UL << PORT0_PHCR0_PH3_Pos )                               /*!< PORT0 PHCR0: PH3 Mask                   */
    #define PORT0_PHCR0_PH4_Pos       18                                                              /*!< PORT0 PHCR0: PH4 Position               */
    #define PORT0_PHCR0_PH4_Msk       ( 0x01UL << PORT0_PHCR0_PH4_Pos )                               /*!< PORT0 PHCR0: PH4 Mask                   */
    #define PORT0_PHCR0_PH5_Pos       22                                                              /*!< PORT0 PHCR0: PH5 Position               */
    #define PORT0_PHCR0_PH5_Msk       ( 0x01UL << PORT0_PHCR0_PH5_Pos )                               /*!< PORT0 PHCR0: PH5 Mask                   */
    #define PORT0_PHCR0_PH6_Pos       26                                                              /*!< PORT0 PHCR0: PH6 Position               */
    #define PORT0_PHCR0_PH6_Msk       ( 0x01UL << PORT0_PHCR0_PH6_Pos )                               /*!< PORT0 PHCR0: PH6 Mask                   */
    #define PORT0_PHCR0_PH7_Pos       30                                                              /*!< PORT0 PHCR0: PH7 Position               */
    #define PORT0_PHCR0_PH7_Msk       ( 0x01UL << PORT0_PHCR0_PH7_Pos )                               /*!< PORT0 PHCR0: PH7 Mask                   */

/* ---------------------------------  PORT0_PHCR1  -------------------------------- */
    #define PORT0_PHCR1_PH8_Pos       2                                                               /*!< PORT0 PHCR1: PH8 Position               */
    #define PORT0_PHCR1_PH8_Msk       ( 0x01UL << PORT0_PHCR1_PH8_Pos )                               /*!< PORT0 PHCR1: PH8 Mask                   */
    #define PORT0_PHCR1_PH9_Pos       6                                                               /*!< PORT0 PHCR1: PH9 Position               */
    #define PORT0_PHCR1_PH9_Msk       ( 0x01UL << PORT0_PHCR1_PH9_Pos )                               /*!< PORT0 PHCR1: PH9 Mask                   */
    #define PORT0_PHCR1_PH10_Pos      10                                                              /*!< PORT0 PHCR1: PH10 Position              */
    #define PORT0_PHCR1_PH10_Msk      ( 0x01UL << PORT0_PHCR1_PH10_Pos )                              /*!< PORT0 PHCR1: PH10 Mask                  */
    #define PORT0_PHCR1_PH11_Pos      14                                                              /*!< PORT0 PHCR1: PH11 Position              */
    #define PORT0_PHCR1_PH11_Msk      ( 0x01UL << PORT0_PHCR1_PH11_Pos )                              /*!< PORT0 PHCR1: PH11 Mask                  */
    #define PORT0_PHCR1_PH12_Pos      18                                                              /*!< PORT0 PHCR1: PH12 Position              */
    #define PORT0_PHCR1_PH12_Msk      ( 0x01UL << PORT0_PHCR1_PH12_Pos )                              /*!< PORT0 PHCR1: PH12 Mask                  */
    #define PORT0_PHCR1_PH13_Pos      22                                                              /*!< PORT0 PHCR1: PH13 Position              */
    #define PORT0_PHCR1_PH13_Msk      ( 0x01UL << PORT0_PHCR1_PH13_Pos )                              /*!< PORT0 PHCR1: PH13 Mask                  */
    #define PORT0_PHCR1_PH14_Pos      26                                                              /*!< PORT0 PHCR1: PH14 Position              */
    #define PORT0_PHCR1_PH14_Msk      ( 0x01UL << PORT0_PHCR1_PH14_Pos )                              /*!< PORT0 PHCR1: PH14 Mask                  */
    #define PORT0_PHCR1_PH15_Pos      30                                                              /*!< PORT0 PHCR1: PH15 Position              */
    #define PORT0_PHCR1_PH15_Msk      ( 0x01UL << PORT0_PHCR1_PH15_Pos )                              /*!< PORT0 PHCR1: PH15 Mask                  */

/* ---------------------------------  PORT0_PDISC  -------------------------------- */
    #define PORT0_PDISC_PDIS0_Pos     0                                                               /*!< PORT0 PDISC: PDIS0 Position             */
    #define PORT0_PDISC_PDIS0_Msk     ( 0x01UL << PORT0_PDISC_PDIS0_Pos )                             /*!< PORT0 PDISC: PDIS0 Mask                 */
    #define PORT0_PDISC_PDIS1_Pos     1                                                               /*!< PORT0 PDISC: PDIS1 Position             */
    #define PORT0_PDISC_PDIS1_Msk     ( 0x01UL << PORT0_PDISC_PDIS1_Pos )                             /*!< PORT0 PDISC: PDIS1 Mask                 */
    #define PORT0_PDISC_PDIS2_Pos     2                                                               /*!< PORT0 PDISC: PDIS2 Position             */
    #define PORT0_PDISC_PDIS2_Msk     ( 0x01UL << PORT0_PDISC_PDIS2_Pos )                             /*!< PORT0 PDISC: PDIS2 Mask                 */
    #define PORT0_PDISC_PDIS3_Pos     3                                                               /*!< PORT0 PDISC: PDIS3 Position             */
    #define PORT0_PDISC_PDIS3_Msk     ( 0x01UL << PORT0_PDISC_PDIS3_Pos )                             /*!< PORT0 PDISC: PDIS3 Mask                 */
    #define PORT0_PDISC_PDIS4_Pos     4                                                               /*!< PORT0 PDISC: PDIS4 Position             */
    #define PORT0_PDISC_PDIS4_Msk     ( 0x01UL << PORT0_PDISC_PDIS4_Pos )                             /*!< PORT0 PDISC: PDIS4 Mask                 */
    #define PORT0_PDISC_PDIS5_Pos     5                                                               /*!< PORT0 PDISC: PDIS5 Position             */
    #define PORT0_PDISC_PDIS5_Msk     ( 0x01UL << PORT0_PDISC_PDIS5_Pos )                             /*!< PORT0 PDISC: PDIS5 Mask                 */
    #define PORT0_PDISC_PDIS6_Pos     6                                                               /*!< PORT0 PDISC: PDIS6 Position             */
    #define PORT0_PDISC_PDIS6_Msk     ( 0x01UL << PORT0_PDISC_PDIS6_Pos )                             /*!< PORT0 PDISC: PDIS6 Mask                 */
    #define PORT0_PDISC_PDIS7_Pos     7                                                               /*!< PORT0 PDISC: PDIS7 Position             */
    #define PORT0_PDISC_PDIS7_Msk     ( 0x01UL << PORT0_PDISC_PDIS7_Pos )                             /*!< PORT0 PDISC: PDIS7 Mask                 */
    #define PORT0_PDISC_PDIS8_Pos     8                                                               /*!< PORT0 PDISC: PDIS8 Position             */
    #define PORT0_PDISC_PDIS8_Msk     ( 0x01UL << PORT0_PDISC_PDIS8_Pos )                             /*!< PORT0 PDISC: PDIS8 Mask                 */
    #define PORT0_PDISC_PDIS9_Pos     9                                                               /*!< PORT0 PDISC: PDIS9 Position             */
    #define PORT0_PDISC_PDIS9_Msk     ( 0x01UL << PORT0_PDISC_PDIS9_Pos )                             /*!< PORT0 PDISC: PDIS9 Mask                 */
    #define PORT0_PDISC_PDIS10_Pos    10                                                              /*!< PORT0 PDISC: PDIS10 Position            */
    #define PORT0_PDISC_PDIS10_Msk    ( 0x01UL << PORT0_PDISC_PDIS10_Pos )                            /*!< PORT0 PDISC: PDIS10 Mask                */
    #define PORT0_PDISC_PDIS11_Pos    11                                                              /*!< PORT0 PDISC: PDIS11 Position            */
    #define PORT0_PDISC_PDIS11_Msk    ( 0x01UL << PORT0_PDISC_PDIS11_Pos )                            /*!< PORT0 PDISC: PDIS11 Mask                */
    #define PORT0_PDISC_PDIS12_Pos    12                                                              /*!< PORT0 PDISC: PDIS12 Position            */
    #define PORT0_PDISC_PDIS12_Msk    ( 0x01UL << PORT0_PDISC_PDIS12_Pos )                            /*!< PORT0 PDISC: PDIS12 Mask                */
    #define PORT0_PDISC_PDIS13_Pos    13                                                              /*!< PORT0 PDISC: PDIS13 Position            */
    #define PORT0_PDISC_PDIS13_Msk    ( 0x01UL << PORT0_PDISC_PDIS13_Pos )                            /*!< PORT0 PDISC: PDIS13 Mask                */
    #define PORT0_PDISC_PDIS14_Pos    14                                                              /*!< PORT0 PDISC: PDIS14 Position            */
    #define PORT0_PDISC_PDIS14_Msk    ( 0x01UL << PORT0_PDISC_PDIS14_Pos )                            /*!< PORT0 PDISC: PDIS14 Mask                */
    #define PORT0_PDISC_PDIS15_Pos    15                                                              /*!< PORT0 PDISC: PDIS15 Position            */
    #define PORT0_PDISC_PDIS15_Msk    ( 0x01UL << PORT0_PDISC_PDIS15_Pos )                            /*!< PORT0 PDISC: PDIS15 Mask                */

/* ----------------------------------  PORT0_PPS  --------------------------------- */
    #define PORT0_PPS_PPS0_Pos        0                                                               /*!< PORT0 PPS: PPS0 Position                */
    #define PORT0_PPS_PPS0_Msk        ( 0x01UL << PORT0_PPS_PPS0_Pos )                                /*!< PORT0 PPS: PPS0 Mask                    */
    #define PORT0_PPS_PPS1_Pos        1                                                               /*!< PORT0 PPS: PPS1 Position                */
    #define PORT0_PPS_PPS1_Msk        ( 0x01UL << PORT0_PPS_PPS1_Pos )                                /*!< PORT0 PPS: PPS1 Mask                    */
    #define PORT0_PPS_PPS2_Pos        2                                                               /*!< PORT0 PPS: PPS2 Position                */
    #define PORT0_PPS_PPS2_Msk        ( 0x01UL << PORT0_PPS_PPS2_Pos )                                /*!< PORT0 PPS: PPS2 Mask                    */
    #define PORT0_PPS_PPS3_Pos        3                                                               /*!< PORT0 PPS: PPS3 Position                */
    #define PORT0_PPS_PPS3_Msk        ( 0x01UL << PORT0_PPS_PPS3_Pos )                                /*!< PORT0 PPS: PPS3 Mask                    */
    #define PORT0_PPS_PPS4_Pos        4                                                               /*!< PORT0 PPS: PPS4 Position                */
    #define PORT0_PPS_PPS4_Msk        ( 0x01UL << PORT0_PPS_PPS4_Pos )                                /*!< PORT0 PPS: PPS4 Mask                    */
    #define PORT0_PPS_PPS5_Pos        5                                                               /*!< PORT0 PPS: PPS5 Position                */
    #define PORT0_PPS_PPS5_Msk        ( 0x01UL << PORT0_PPS_PPS5_Pos )                                /*!< PORT0 PPS: PPS5 Mask                    */
    #define PORT0_PPS_PPS6_Pos        6                                                               /*!< PORT0 PPS: PPS6 Position                */
    #define PORT0_PPS_PPS6_Msk        ( 0x01UL << PORT0_PPS_PPS6_Pos )                                /*!< PORT0 PPS: PPS6 Mask                    */
    #define PORT0_PPS_PPS7_Pos        7                                                               /*!< PORT0 PPS: PPS7 Position                */
    #define PORT0_PPS_PPS7_Msk        ( 0x01UL << PORT0_PPS_PPS7_Pos )                                /*!< PORT0 PPS: PPS7 Mask                    */
    #define PORT0_PPS_PPS8_Pos        8                                                               /*!< PORT0 PPS: PPS8 Position                */
    #define PORT0_PPS_PPS8_Msk        ( 0x01UL << PORT0_PPS_PPS8_Pos )                                /*!< PORT0 PPS: PPS8 Mask                    */
    #define PORT0_PPS_PPS9_Pos        9                                                               /*!< PORT0 PPS: PPS9 Position                */
    #define PORT0_PPS_PPS9_Msk        ( 0x01UL << PORT0_PPS_PPS9_Pos )                                /*!< PORT0 PPS: PPS9 Mask                    */
    #define PORT0_PPS_PPS10_Pos       10                                                              /*!< PORT0 PPS: PPS10 Position               */
    #define PORT0_PPS_PPS10_Msk       ( 0x01UL << PORT0_PPS_PPS10_Pos )                               /*!< PORT0 PPS: PPS10 Mask                   */
    #define PORT0_PPS_PPS11_Pos       11                                                              /*!< PORT0 PPS: PPS11 Position               */
    #define PORT0_PPS_PPS11_Msk       ( 0x01UL << PORT0_PPS_PPS11_Pos )                               /*!< PORT0 PPS: PPS11 Mask                   */
    #define PORT0_PPS_PPS12_Pos       12                                                              /*!< PORT0 PPS: PPS12 Position               */
    #define PORT0_PPS_PPS12_Msk       ( 0x01UL << PORT0_PPS_PPS12_Pos )                               /*!< PORT0 PPS: PPS12 Mask                   */
    #define PORT0_PPS_PPS13_Pos       13                                                              /*!< PORT0 PPS: PPS13 Position               */
    #define PORT0_PPS_PPS13_Msk       ( 0x01UL << PORT0_PPS_PPS13_Pos )                               /*!< PORT0 PPS: PPS13 Mask                   */
    #define PORT0_PPS_PPS14_Pos       14                                                              /*!< PORT0 PPS: PPS14 Position               */
    #define PORT0_PPS_PPS14_Msk       ( 0x01UL << PORT0_PPS_PPS14_Pos )                               /*!< PORT0 PPS: PPS14 Mask                   */
    #define PORT0_PPS_PPS15_Pos       15                                                              /*!< PORT0 PPS: PPS15 Position               */
    #define PORT0_PPS_PPS15_Msk       ( 0x01UL << PORT0_PPS_PPS15_Pos )                               /*!< PORT0 PPS: PPS15 Mask                   */

/* ---------------------------------  PORT0_HWSEL  -------------------------------- */
    #define PORT0_HWSEL_HW0_Pos       0                                                               /*!< PORT0 HWSEL: HW0 Position               */
    #define PORT0_HWSEL_HW0_Msk       ( 0x03UL << PORT0_HWSEL_HW0_Pos )                               /*!< PORT0 HWSEL: HW0 Mask                   */
    #define PORT0_HWSEL_HW1_Pos       2                                                               /*!< PORT0 HWSEL: HW1 Position               */
    #define PORT0_HWSEL_HW1_Msk       ( 0x03UL << PORT0_HWSEL_HW1_Pos )                               /*!< PORT0 HWSEL: HW1 Mask                   */
    #define PORT0_HWSEL_HW2_Pos       4                                                               /*!< PORT0 HWSEL: HW2 Position               */
    #define PORT0_HWSEL_HW2_Msk       ( 0x03UL << PORT0_HWSEL_HW2_Pos )                               /*!< PORT0 HWSEL: HW2 Mask                   */
    #define PORT0_HWSEL_HW3_Pos       6                                                               /*!< PORT0 HWSEL: HW3 Position               */
    #define PORT0_HWSEL_HW3_Msk       ( 0x03UL << PORT0_HWSEL_HW3_Pos )                               /*!< PORT0 HWSEL: HW3 Mask                   */
    #define PORT0_HWSEL_HW4_Pos       8                                                               /*!< PORT0 HWSEL: HW4 Position               */
    #define PORT0_HWSEL_HW4_Msk       ( 0x03UL << PORT0_HWSEL_HW4_Pos )                               /*!< PORT0 HWSEL: HW4 Mask                   */
    #define PORT0_HWSEL_HW5_Pos       10                                                              /*!< PORT0 HWSEL: HW5 Position               */
    #define PORT0_HWSEL_HW5_Msk       ( 0x03UL << PORT0_HWSEL_HW5_Pos )                               /*!< PORT0 HWSEL: HW5 Mask                   */
    #define PORT0_HWSEL_HW6_Pos       12                                                              /*!< PORT0 HWSEL: HW6 Position               */
    #define PORT0_HWSEL_HW6_Msk       ( 0x03UL << PORT0_HWSEL_HW6_Pos )                               /*!< PORT0 HWSEL: HW6 Mask                   */
    #define PORT0_HWSEL_HW7_Pos       14                                                              /*!< PORT0 HWSEL: HW7 Position               */
    #define PORT0_HWSEL_HW7_Msk       ( 0x03UL << PORT0_HWSEL_HW7_Pos )                               /*!< PORT0 HWSEL: HW7 Mask                   */
    #define PORT0_HWSEL_HW8_Pos       16                                                              /*!< PORT0 HWSEL: HW8 Position               */
    #define PORT0_HWSEL_HW8_Msk       ( 0x03UL << PORT0_HWSEL_HW8_Pos )                               /*!< PORT0 HWSEL: HW8 Mask                   */
    #define PORT0_HWSEL_HW9_Pos       18                                                              /*!< PORT0 HWSEL: HW9 Position               */
    #define PORT0_HWSEL_HW9_Msk       ( 0x03UL << PORT0_HWSEL_HW9_Pos )                               /*!< PORT0 HWSEL: HW9 Mask                   */
    #define PORT0_HWSEL_HW10_Pos      20                                                              /*!< PORT0 HWSEL: HW10 Position              */
    #define PORT0_HWSEL_HW10_Msk      ( 0x03UL << PORT0_HWSEL_HW10_Pos )                              /*!< PORT0 HWSEL: HW10 Mask                  */
    #define PORT0_HWSEL_HW11_Pos      22                                                              /*!< PORT0 HWSEL: HW11 Position              */
    #define PORT0_HWSEL_HW11_Msk      ( 0x03UL << PORT0_HWSEL_HW11_Pos )                              /*!< PORT0 HWSEL: HW11 Mask                  */
    #define PORT0_HWSEL_HW12_Pos      24                                                              /*!< PORT0 HWSEL: HW12 Position              */
    #define PORT0_HWSEL_HW12_Msk      ( 0x03UL << PORT0_HWSEL_HW12_Pos )                              /*!< PORT0 HWSEL: HW12 Mask                  */
    #define PORT0_HWSEL_HW13_Pos      26                                                              /*!< PORT0 HWSEL: HW13 Position              */
    #define PORT0_HWSEL_HW13_Msk      ( 0x03UL << PORT0_HWSEL_HW13_Pos )                              /*!< PORT0 HWSEL: HW13 Mask                  */
    #define PORT0_HWSEL_HW14_Pos      28                                                              /*!< PORT0 HWSEL: HW14 Position              */
    #define PORT0_HWSEL_HW14_Msk      ( 0x03UL << PORT0_HWSEL_HW14_Pos )                              /*!< PORT0 HWSEL: HW14 Mask                  */
    #define PORT0_HWSEL_HW15_Pos      30                                                              /*!< PORT0 HWSEL: HW15 Position              */
    #define PORT0_HWSEL_HW15_Msk      ( 0x03UL << PORT0_HWSEL_HW15_Pos )                              /*!< PORT0 HWSEL: HW15 Mask                  */


/* ================================================================================ */
/* ================         struct 'PORT1' Position & Mask         ================ */
/* ================================================================================ */


