FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  PORT1_OUT  --------------------------------- */
    #define PORT1_OUT_P0_Pos         0                                                                /*!< PORT1 OUT: P0 Position                  */
    #define PORT1_OUT_P0_Msk         ( 0x01UL << PORT1_OUT_P0_Pos )                                   /*!< PORT1 OUT: P0 Mask                      */
    #define PORT1_OUT_P1_Pos         1                                                                /*!< PORT1 OUT: P1 Position                  */
    #define PORT1_OUT_P1_Msk         ( 0x01UL << PORT1_OUT_P1_Pos )                                   /*!< PORT1 OUT: P1 Mask                      */
    #define PORT1_OUT_P2_Pos         2                                                                /*!< PORT1 OUT: P2 Position                  */
    #define PORT1_OUT_P2_Msk         ( 0x01UL << PORT1_OUT_P2_Pos )                                   /*!< PORT1 OUT: P2 Mask                      */
    #define PORT1_OUT_P3_Pos         3                                                                /*!< PORT1 OUT: P3 Position                  */
    #define PORT1_OUT_P3_Msk         ( 0x01UL << PORT1_OUT_P3_Pos )                                   /*!< PORT1 OUT: P3 Mask                      */
    #define PORT1_OUT_P4_Pos         4                                                                /*!< PORT1 OUT: P4 Position                  */
    #define PORT1_OUT_P4_Msk         ( 0x01UL << PORT1_OUT_P4_Pos )                                   /*!< PORT1 OUT: P4 Mask                      */
    #define PORT1_OUT_P5_Pos         5                                                                /*!< PORT1 OUT: P5 Position                  */
    #define PORT1_OUT_P5_Msk         ( 0x01UL << PORT1_OUT_P5_Pos )                                   /*!< PORT1 OUT: P5 Mask                      */

/* ----------------------------------  PORT1_OMR  --------------------------------- */
    #define PORT1_OMR_PS0_Pos        0                                                                /*!< PORT1 OMR: PS0 Position                 */
    #define PORT1_OMR_PS0_Msk        ( 0x01UL << PORT1_OMR_PS0_Pos )                                  /*!< PORT1 OMR: PS0 Mask                     */
    #define PORT1_OMR_PS1_Pos        1                                                                /*!< PORT1 OMR: PS1 Position                 */
    #define PORT1_OMR_PS1_Msk        ( 0x01UL << PORT1_OMR_PS1_Pos )                                  /*!< PORT1 OMR: PS1 Mask                     */
    #define PORT1_OMR_PS2_Pos        2                                                                /*!< PORT1 OMR: PS2 Position                 */
    #define PORT1_OMR_PS2_Msk        ( 0x01UL << PORT1_OMR_PS2_Pos )                                  /*!< PORT1 OMR: PS2 Mask                     */
    #define PORT1_OMR_PS3_Pos        3                                                                /*!< PORT1 OMR: PS3 Position                 */
    #define PORT1_OMR_PS3_Msk        ( 0x01UL << PORT1_OMR_PS3_Pos )                                  /*!< PORT1 OMR: PS3 Mask                     */
    #define PORT1_OMR_PS4_Pos        4                                                                /*!< PORT1 OMR: PS4 Position                 */
    #define PORT1_OMR_PS4_Msk        ( 0x01UL << PORT1_OMR_PS4_Pos )                                  /*!< PORT1 OMR: PS4 Mask                     */
    #define PORT1_OMR_PS5_Pos        5                                                                /*!< PORT1 OMR: PS5 Position                 */
    #define PORT1_OMR_PS5_Msk        ( 0x01UL << PORT1_OMR_PS5_Pos )                                  /*!< PORT1 OMR: PS5 Mask                     */
    #define PORT1_OMR_PR0_Pos        16                                                               /*!< PORT1 OMR: PR0 Position                 */
    #define PORT1_OMR_PR0_Msk        ( 0x01UL << PORT1_OMR_PR0_Pos )                                  /*!< PORT1 OMR: PR0 Mask                     */
    #define PORT1_OMR_PR1_Pos        17                                                               /*!< PORT1 OMR: PR1 Position                 */
    #define PORT1_OMR_PR1_Msk        ( 0x01UL << PORT1_OMR_PR1_Pos )                                  /*!< PORT1 OMR: PR1 Mask                     */
    #define PORT1_OMR_PR2_Pos        18                                                               /*!< PORT1 OMR: PR2 Position                 */
    #define PORT1_OMR_PR2_Msk        ( 0x01UL << PORT1_OMR_PR2_Pos )                                  /*!< PORT1 OMR: PR2 Mask                     */
    #define PORT1_OMR_PR3_Pos        19                                                               /*!< PORT1 OMR: PR3 Position                 */
    #define PORT1_OMR_PR3_Msk        ( 0x01UL << PORT1_OMR_PR3_Pos )                                  /*!< PORT1 OMR: PR3 Mask                     */
    #define PORT1_OMR_PR4_Pos        20                                                               /*!< PORT1 OMR: PR4 Position                 */
    #define PORT1_OMR_PR4_Msk        ( 0x01UL << PORT1_OMR_PR4_Pos )                                  /*!< PORT1 OMR: PR4 Mask                     */
    #define PORT1_OMR_PR5_Pos        21                                                               /*!< PORT1 OMR: PR5 Position                 */
    #define PORT1_OMR_PR5_Msk        ( 0x01UL << PORT1_OMR_PR5_Pos )                                  /*!< PORT1 OMR: PR5 Mask                     */

/* ---------------------------------  PORT1_IOCR0  -------------------------------- */
    #define PORT1_IOCR0_PC0_Pos      3                                                                /*!< PORT1 IOCR0: PC0 Position               */
    #define PORT1_IOCR0_PC0_Msk      ( 0x1fUL << PORT1_IOCR0_PC0_Pos )                                /*!< PORT1 IOCR0: PC0 Mask                   */
    #define PORT1_IOCR0_PC1_Pos      11                                                               /*!< PORT1 IOCR0: PC1 Position               */
    #define PORT1_IOCR0_PC1_Msk      ( 0x1fUL << PORT1_IOCR0_PC1_Pos )                                /*!< PORT1 IOCR0: PC1 Mask                   */
    #define PORT1_IOCR0_PC2_Pos      19                                                               /*!< PORT1 IOCR0: PC2 Position               */
    #define PORT1_IOCR0_PC2_Msk      ( 0x1fUL << PORT1_IOCR0_PC2_Pos )                                /*!< PORT1 IOCR0: PC2 Mask                   */
    #define PORT1_IOCR0_PC3_Pos      27                                                               /*!< PORT1 IOCR0: PC3 Position               */
    #define PORT1_IOCR0_PC3_Msk      ( 0x1fUL << PORT1_IOCR0_PC3_Pos )                                /*!< PORT1 IOCR0: PC3 Mask                   */

/* ---------------------------------  PORT1_IOCR4  -------------------------------- */
    #define PORT1_IOCR4_PC4_Pos      3                                                                /*!< PORT1 IOCR4: PC4 Position               */
    #define PORT1_IOCR4_PC4_Msk      ( 0x1fUL << PORT1_IOCR4_PC4_Pos )                                /*!< PORT1 IOCR4: PC4 Mask                   */
    #define PORT1_IOCR4_PC5_Pos      11                                                               /*!< PORT1 IOCR4: PC5 Position               */
    #define PORT1_IOCR4_PC5_Msk      ( 0x1fUL << PORT1_IOCR4_PC5_Pos )                                /*!< PORT1 IOCR4: PC5 Mask                   */

/* ----------------------------------  PORT1_IN  ---------------------------------- */
    #define PORT1_IN_P0_Pos          0                                                                /*!< PORT1 IN: P0 Position                   */
    #define PORT1_IN_P0_Msk          ( 0x01UL << PORT1_IN_P0_Pos )                                    /*!< PORT1 IN: P0 Mask                       */
    #define PORT1_IN_P1_Pos          1                                                                /*!< PORT1 IN: P1 Position                   */
    #define PORT1_IN_P1_Msk          ( 0x01UL << PORT1_IN_P1_Pos )                                    /*!< PORT1 IN: P1 Mask                       */
    #define PORT1_IN_P2_Pos          2                                                                /*!< PORT1 IN: P2 Position                   */
    #define PORT1_IN_P2_Msk          ( 0x01UL << PORT1_IN_P2_Pos )                                    /*!< PORT1 IN: P2 Mask                       */
    #define PORT1_IN_P3_Pos          3                                                                /*!< PORT1 IN: P3 Position                   */
    #define PORT1_IN_P3_Msk          ( 0x01UL << PORT1_IN_P3_Pos )                                    /*!< PORT1 IN: P3 Mask                       */
    #define PORT1_IN_P4_Pos          4                                                                /*!< PORT1 IN: P4 Position                   */
    #define PORT1_IN_P4_Msk          ( 0x01UL << PORT1_IN_P4_Pos )                                    /*!< PORT1 IN: P4 Mask                       */
    #define PORT1_IN_P5_Pos          5                                                                /*!< PORT1 IN: P5 Position                   */
    #define PORT1_IN_P5_Msk          ( 0x01UL << PORT1_IN_P5_Pos )                                    /*!< PORT1 IN: P5 Mask                       */

/* ---------------------------------  PORT1_PHCR0  -------------------------------- */
    #define PORT1_PHCR0_PH0_Pos      2                                                                /*!< PORT1 PHCR0: PH0 Position               */
    #define PORT1_PHCR0_PH0_Msk      ( 0x01UL << PORT1_PHCR0_PH0_Pos )                                /*!< PORT1 PHCR0: PH0 Mask                   */
    #define PORT1_PHCR0_PH1_Pos      6                                                                /*!< PORT1 PHCR0: PH1 Position               */
    #define PORT1_PHCR0_PH1_Msk      ( 0x01UL << PORT1_PHCR0_PH1_Pos )                                /*!< PORT1 PHCR0: PH1 Mask                   */
    #define PORT1_PHCR0_PH2_Pos      10                                                               /*!< PORT1 PHCR0: PH2 Position               */
    #define PORT1_PHCR0_PH2_Msk      ( 0x01UL << PORT1_PHCR0_PH2_Pos )                                /*!< PORT1 PHCR0: PH2 Mask                   */
    #define PORT1_PHCR0_PH3_Pos      14                                                               /*!< PORT1 PHCR0: PH3 Position               */
    #define PORT1_PHCR0_PH3_Msk      ( 0x01UL << PORT1_PHCR0_PH3_Pos )                                /*!< PORT1 PHCR0: PH3 Mask                   */
    #define PORT1_PHCR0_PH4_Pos      18                                                               /*!< PORT1 PHCR0: PH4 Position               */
    #define PORT1_PHCR0_PH4_Msk      ( 0x01UL << PORT1_PHCR0_PH4_Pos )                                /*!< PORT1 PHCR0: PH4 Mask                   */
    #define PORT1_PHCR0_PH5_Pos      22                                                               /*!< PORT1 PHCR0: PH5 Position               */
    #define PORT1_PHCR0_PH5_Msk      ( 0x01UL << PORT1_PHCR0_PH5_Pos )                                /*!< PORT1 PHCR0: PH5 Mask                   */

/* ---------------------------------  PORT1_PDISC  -------------------------------- */
    #define PORT1_PDISC_PDIS0_Pos    0                                                                /*!< PORT1 PDISC: PDIS0 Position             */
    #define PORT1_PDISC_PDIS0_Msk    ( 0x01UL << PORT1_PDISC_PDIS0_Pos )                              /*!< PORT1 PDISC: PDIS0 Mask                 */
    #define PORT1_PDISC_PDIS1_Pos    1                                                                /*!< PORT1 PDISC: PDIS1 Position             */
    #define PORT1_PDISC_PDIS1_Msk    ( 0x01UL << PORT1_PDISC_PDIS1_Pos )                              /*!< PORT1 PDISC: PDIS1 Mask                 */
    #define PORT1_PDISC_PDIS2_Pos    2                                                                /*!< PORT1 PDISC: PDIS2 Position             */
    #define PORT1_PDISC_PDIS2_Msk    ( 0x01UL << PORT1_PDISC_PDIS2_Pos )                              /*!< PORT1 PDISC: PDIS2 Mask                 */
    #define PORT1_PDISC_PDIS3_Pos    3                                                                /*!< PORT1 PDISC: PDIS3 Position             */
    #define PORT1_PDISC_PDIS3_Msk    ( 0x01UL << PORT1_PDISC_PDIS3_Pos )                              /*!< PORT1 PDISC: PDIS3 Mask                 */
    #define PORT1_PDISC_PDIS4_Pos    4                                                                /*!< PORT1 PDISC: PDIS4 Position             */
    #define PORT1_PDISC_PDIS4_Msk    ( 0x01UL << PORT1_PDISC_PDIS4_Pos )                              /*!< PORT1 PDISC: PDIS4 Mask                 */
    #define PORT1_PDISC_PDIS5_Pos    5                                                                /*!< PORT1 PDISC: PDIS5 Position             */
    #define PORT1_PDISC_PDIS5_Msk    ( 0x01UL << PORT1_PDISC_PDIS5_Pos )                              /*!< PORT1 PDISC: PDIS5 Mask                 */

/* ----------------------------------  PORT1_PPS  --------------------------------- */
    #define PORT1_PPS_PPS0_Pos       0                                                                /*!< PORT1 PPS: PPS0 Position                */
    #define PORT1_PPS_PPS0_Msk       ( 0x01UL << PORT1_PPS_PPS0_Pos )                                 /*!< PORT1 PPS: PPS0 Mask                    */
    #define PORT1_PPS_PPS1_Pos       1                                                                /*!< PORT1 PPS: PPS1 Position                */
    #define PORT1_PPS_PPS1_Msk       ( 0x01UL << PORT1_PPS_PPS1_Pos )                                 /*!< PORT1 PPS: PPS1 Mask                    */
    #define PORT1_PPS_PPS2_Pos       2                                                                /*!< PORT1 PPS: PPS2 Position                */
    #define PORT1_PPS_PPS2_Msk       ( 0x01UL << PORT1_PPS_PPS2_Pos )                                 /*!< PORT1 PPS: PPS2 Mask                    */
    #define PORT1_PPS_PPS3_Pos       3                                                                /*!< PORT1 PPS: PPS3 Position                */
    #define PORT1_PPS_PPS3_Msk       ( 0x01UL << PORT1_PPS_PPS3_Pos )                                 /*!< PORT1 PPS: PPS3 Mask                    */
    #define PORT1_PPS_PPS4_Pos       4                                                                /*!< PORT1 PPS: PPS4 Position                */
    #define PORT1_PPS_PPS4_Msk       ( 0x01UL << PORT1_PPS_PPS4_Pos )                                 /*!< PORT1 PPS: PPS4 Mask                    */
    #define PORT1_PPS_PPS5_Pos       5                                                                /*!< PORT1 PPS: PPS5 Position                */
    #define PORT1_PPS_PPS5_Msk       ( 0x01UL << PORT1_PPS_PPS5_Pos )                                 /*!< PORT1 PPS: PPS5 Mask                    */

/* ---------------------------------  PORT1_HWSEL  -------------------------------- */
    #define PORT1_HWSEL_HW0_Pos      0                                                                /*!< PORT1 HWSEL: HW0 Position               */
    #define PORT1_HWSEL_HW0_Msk      ( 0x03UL << PORT1_HWSEL_HW0_Pos )                                /*!< PORT1 HWSEL: HW0 Mask                   */
    #define PORT1_HWSEL_HW1_Pos      2                                                                /*!< PORT1 HWSEL: HW1 Position               */
    #define PORT1_HWSEL_HW1_Msk      ( 0x03UL << PORT1_HWSEL_HW1_Pos )                                /*!< PORT1 HWSEL: HW1 Mask                   */
    #define PORT1_HWSEL_HW2_Pos      4                                                                /*!< PORT1 HWSEL: HW2 Position               */
    #define PORT1_HWSEL_HW2_Msk      ( 0x03UL << PORT1_HWSEL_HW2_Pos )                                /*!< PORT1 HWSEL: HW2 Mask                   */
    #define PORT1_HWSEL_HW3_Pos      6                                                                /*!< PORT1 HWSEL: HW3 Position               */
    #define PORT1_HWSEL_HW3_Msk      ( 0x03UL << PORT1_HWSEL_HW3_Pos )                                /*!< PORT1 HWSEL: HW3 Mask                   */
    #define PORT1_HWSEL_HW4_Pos      8                                                                /*!< PORT1 HWSEL: HW4 Position               */
    #define PORT1_HWSEL_HW4_Msk      ( 0x03UL << PORT1_HWSEL_HW4_Pos )                                /*!< PORT1 HWSEL: HW4 Mask                   */
    #define PORT1_HWSEL_HW5_Pos      10                                                               /*!< PORT1 HWSEL: HW5 Position               */
    #define PORT1_HWSEL_HW5_Msk      ( 0x03UL << PORT1_HWSEL_HW5_Pos )                                /*!< PORT1 HWSEL: HW5 Mask                   */


/* ================================================================================ */
/* ================         struct 'PORT2' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  PORT2_OUT  --------------------------------- */
    #define PORT2_OUT_P0_Pos          0                                                               /*!< PORT2 OUT: P0 Position                  */
    #define PORT2_OUT_P0_Msk          ( 0x01UL << PORT2_OUT_P0_Pos )                                  /*!< PORT2 OUT: P0 Mask                      */
    #define PORT2_OUT_P1_Pos          1                                                               /*!< PORT2 OUT: P1 Position                  */
    #define PORT2_OUT_P1_Msk          ( 0x01UL << PORT2_OUT_P1_Pos )                                  /*!< PORT2 OUT: P1 Mask                      */
    #define PORT2_OUT_P2_Pos          2                                                               /*!< PORT2 OUT: P2 Position                  */
    #define PORT2_OUT_P2_Msk          ( 0x01UL << PORT2_OUT_P2_Pos )                                  /*!< PORT2 OUT: P2 Mask                      */
    #define PORT2_OUT_P3_Pos          3                                                               /*!< PORT2 OUT: P3 Position                  */
    #define PORT2_OUT_P3_Msk          ( 0x01UL << PORT2_OUT_P3_Pos )                                  /*!< PORT2 OUT: P3 Mask                      */
    #define PORT2_OUT_P4_Pos          4                                                               /*!< PORT2 OUT: P4 Position                  */
    #define PORT2_OUT_P4_Msk          ( 0x01UL << PORT2_OUT_P4_Pos )                                  /*!< PORT2 OUT: P4 Mask                      */
    #define PORT2_OUT_P5_Pos          5                                                               /*!< PORT2 OUT: P5 Position                  */
    #define PORT2_OUT_P5_Msk          ( 0x01UL << PORT2_OUT_P5_Pos )                                  /*!< PORT2 OUT: P5 Mask                      */
    #define PORT2_OUT_P6_Pos          6                                                               /*!< PORT2 OUT: P6 Position                  */
    #define PORT2_OUT_P6_Msk          ( 0x01UL << PORT2_OUT_P6_Pos )                                  /*!< PORT2 OUT: P6 Mask                      */
    #define PORT2_OUT_P7_Pos          7                                                               /*!< PORT2 OUT: P7 Position                  */
    #define PORT2_OUT_P7_Msk          ( 0x01UL << PORT2_OUT_P7_Pos )                                  /*!< PORT2 OUT: P7 Mask                      */
    #define PORT2_OUT_P8_Pos          8                                                               /*!< PORT2 OUT: P8 Position                  */
    #define PORT2_OUT_P8_Msk          ( 0x01UL << PORT2_OUT_P8_Pos )                                  /*!< PORT2 OUT: P8 Mask                      */
    #define PORT2_OUT_P9_Pos          9                                                               /*!< PORT2 OUT: P9 Position                  */
    #define PORT2_OUT_P9_Msk          ( 0x01UL << PORT2_OUT_P9_Pos )                                  /*!< PORT2 OUT: P9 Mask                      */
    #define PORT2_OUT_P10_Pos         10                                                              /*!< PORT2 OUT: P10 Position                 */
    #define PORT2_OUT_P10_Msk         ( 0x01UL << PORT2_OUT_P10_Pos )                                 /*!< PORT2 OUT: P10 Mask                     */
    #define PORT2_OUT_P11_Pos         11                                                              /*!< PORT2 OUT: P11 Position                 */
    #define PORT2_OUT_P11_Msk         ( 0x01UL << PORT2_OUT_P11_Pos )                                 /*!< PORT2 OUT: P11 Mask                     */

