FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ----------------------------------  PORT2_OMR  --------------------------------- */
    #define PORT2_OMR_PS0_Pos         0                                                               /*!< PORT2 OMR: PS0 Position                 */
    #define PORT2_OMR_PS0_Msk         ( 0x01UL << PORT2_OMR_PS0_Pos )                                 /*!< PORT2 OMR: PS0 Mask                     */
    #define PORT2_OMR_PS1_Pos         1                                                               /*!< PORT2 OMR: PS1 Position                 */
    #define PORT2_OMR_PS1_Msk         ( 0x01UL << PORT2_OMR_PS1_Pos )                                 /*!< PORT2 OMR: PS1 Mask                     */
    #define PORT2_OMR_PS2_Pos         2                                                               /*!< PORT2 OMR: PS2 Position                 */
    #define PORT2_OMR_PS2_Msk         ( 0x01UL << PORT2_OMR_PS2_Pos )                                 /*!< PORT2 OMR: PS2 Mask                     */
    #define PORT2_OMR_PS3_Pos         3                                                               /*!< PORT2 OMR: PS3 Position                 */
    #define PORT2_OMR_PS3_Msk         ( 0x01UL << PORT2_OMR_PS3_Pos )                                 /*!< PORT2 OMR: PS3 Mask                     */
    #define PORT2_OMR_PS4_Pos         4                                                               /*!< PORT2 OMR: PS4 Position                 */
    #define PORT2_OMR_PS4_Msk         ( 0x01UL << PORT2_OMR_PS4_Pos )                                 /*!< PORT2 OMR: PS4 Mask                     */
    #define PORT2_OMR_PS5_Pos         5                                                               /*!< PORT2 OMR: PS5 Position                 */
    #define PORT2_OMR_PS5_Msk         ( 0x01UL << PORT2_OMR_PS5_Pos )                                 /*!< PORT2 OMR: PS5 Mask                     */
    #define PORT2_OMR_PS6_Pos         6                                                               /*!< PORT2 OMR: PS6 Position                 */
    #define PORT2_OMR_PS6_Msk         ( 0x01UL << PORT2_OMR_PS6_Pos )                                 /*!< PORT2 OMR: PS6 Mask                     */
    #define PORT2_OMR_PS7_Pos         7                                                               /*!< PORT2 OMR: PS7 Position                 */
    #define PORT2_OMR_PS7_Msk         ( 0x01UL << PORT2_OMR_PS7_Pos )                                 /*!< PORT2 OMR: PS7 Mask                     */
    #define PORT2_OMR_PS8_Pos         8                                                               /*!< PORT2 OMR: PS8 Position                 */
    #define PORT2_OMR_PS8_Msk         ( 0x01UL << PORT2_OMR_PS8_Pos )                                 /*!< PORT2 OMR: PS8 Mask                     */
    #define PORT2_OMR_PS9_Pos         9                                                               /*!< PORT2 OMR: PS9 Position                 */
    #define PORT2_OMR_PS9_Msk         ( 0x01UL << PORT2_OMR_PS9_Pos )                                 /*!< PORT2 OMR: PS9 Mask                     */
    #define PORT2_OMR_PS10_Pos        10                                                              /*!< PORT2 OMR: PS10 Position                */
    #define PORT2_OMR_PS10_Msk        ( 0x01UL << PORT2_OMR_PS10_Pos )                                /*!< PORT2 OMR: PS10 Mask                    */
    #define PORT2_OMR_PS11_Pos        11                                                              /*!< PORT2 OMR: PS11 Position                */
    #define PORT2_OMR_PS11_Msk        ( 0x01UL << PORT2_OMR_PS11_Pos )                                /*!< PORT2 OMR: PS11 Mask                    */
    #define PORT2_OMR_PR0_Pos         16                                                              /*!< PORT2 OMR: PR0 Position                 */
    #define PORT2_OMR_PR0_Msk         ( 0x01UL << PORT2_OMR_PR0_Pos )                                 /*!< PORT2 OMR: PR0 Mask                     */
    #define PORT2_OMR_PR1_Pos         17                                                              /*!< PORT2 OMR: PR1 Position                 */
    #define PORT2_OMR_PR1_Msk         ( 0x01UL << PORT2_OMR_PR1_Pos )                                 /*!< PORT2 OMR: PR1 Mask                     */
    #define PORT2_OMR_PR2_Pos         18                                                              /*!< PORT2 OMR: PR2 Position                 */
    #define PORT2_OMR_PR2_Msk         ( 0x01UL << PORT2_OMR_PR2_Pos )                                 /*!< PORT2 OMR: PR2 Mask                     */
    #define PORT2_OMR_PR3_Pos         19                                                              /*!< PORT2 OMR: PR3 Position                 */
    #define PORT2_OMR_PR3_Msk         ( 0x01UL << PORT2_OMR_PR3_Pos )                                 /*!< PORT2 OMR: PR3 Mask                     */
    #define PORT2_OMR_PR4_Pos         20                                                              /*!< PORT2 OMR: PR4 Position                 */
    #define PORT2_OMR_PR4_Msk         ( 0x01UL << PORT2_OMR_PR4_Pos )                                 /*!< PORT2 OMR: PR4 Mask                     */
    #define PORT2_OMR_PR5_Pos         21                                                              /*!< PORT2 OMR: PR5 Position                 */
    #define PORT2_OMR_PR5_Msk         ( 0x01UL << PORT2_OMR_PR5_Pos )                                 /*!< PORT2 OMR: PR5 Mask                     */
    #define PORT2_OMR_PR6_Pos         22                                                              /*!< PORT2 OMR: PR6 Position                 */
    #define PORT2_OMR_PR6_Msk         ( 0x01UL << PORT2_OMR_PR6_Pos )                                 /*!< PORT2 OMR: PR6 Mask                     */
    #define PORT2_OMR_PR7_Pos         23                                                              /*!< PORT2 OMR: PR7 Position                 */
    #define PORT2_OMR_PR7_Msk         ( 0x01UL << PORT2_OMR_PR7_Pos )                                 /*!< PORT2 OMR: PR7 Mask                     */
    #define PORT2_OMR_PR8_Pos         24                                                              /*!< PORT2 OMR: PR8 Position                 */
    #define PORT2_OMR_PR8_Msk         ( 0x01UL << PORT2_OMR_PR8_Pos )                                 /*!< PORT2 OMR: PR8 Mask                     */
    #define PORT2_OMR_PR9_Pos         25                                                              /*!< PORT2 OMR: PR9 Position                 */
    #define PORT2_OMR_PR9_Msk         ( 0x01UL << PORT2_OMR_PR9_Pos )                                 /*!< PORT2 OMR: PR9 Mask                     */
    #define PORT2_OMR_PR10_Pos        26                                                              /*!< PORT2 OMR: PR10 Position                */
    #define PORT2_OMR_PR10_Msk        ( 0x01UL << PORT2_OMR_PR10_Pos )                                /*!< PORT2 OMR: PR10 Mask                    */
    #define PORT2_OMR_PR11_Pos        27                                                              /*!< PORT2 OMR: PR11 Position                */
    #define PORT2_OMR_PR11_Msk        ( 0x01UL << PORT2_OMR_PR11_Pos )                                /*!< PORT2 OMR: PR11 Mask                    */

/* ---------------------------------  PORT2_IOCR0  -------------------------------- */
    #define PORT2_IOCR0_PC0_Pos       3                                                               /*!< PORT2 IOCR0: PC0 Position               */
    #define PORT2_IOCR0_PC0_Msk       ( 0x1fUL << PORT2_IOCR0_PC0_Pos )                               /*!< PORT2 IOCR0: PC0 Mask                   */
    #define PORT2_IOCR0_PC1_Pos       11                                                              /*!< PORT2 IOCR0: PC1 Position               */
    #define PORT2_IOCR0_PC1_Msk       ( 0x1fUL << PORT2_IOCR0_PC1_Pos )                               /*!< PORT2 IOCR0: PC1 Mask                   */
    #define PORT2_IOCR0_PC2_Pos       19                                                              /*!< PORT2 IOCR0: PC2 Position               */
    #define PORT2_IOCR0_PC2_Msk       ( 0x1fUL << PORT2_IOCR0_PC2_Pos )                               /*!< PORT2 IOCR0: PC2 Mask                   */
    #define PORT2_IOCR0_PC3_Pos       27                                                              /*!< PORT2 IOCR0: PC3 Position               */
    #define PORT2_IOCR0_PC3_Msk       ( 0x1fUL << PORT2_IOCR0_PC3_Pos )                               /*!< PORT2 IOCR0: PC3 Mask                   */

