FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  PORT2_IOCR4  -------------------------------- */
    #define PORT2_IOCR4_PC4_Pos       3                                                               /*!< PORT2 IOCR4: PC4 Position               */
    #define PORT2_IOCR4_PC4_Msk       ( 0x1fUL << PORT2_IOCR4_PC4_Pos )                               /*!< PORT2 IOCR4: PC4 Mask                   */
    #define PORT2_IOCR4_PC5_Pos       11                                                              /*!< PORT2 IOCR4: PC5 Position               */
    #define PORT2_IOCR4_PC5_Msk       ( 0x1fUL << PORT2_IOCR4_PC5_Pos )                               /*!< PORT2 IOCR4: PC5 Mask                   */
    #define PORT2_IOCR4_PC6_Pos       19                                                              /*!< PORT2 IOCR4: PC6 Position               */
    #define PORT2_IOCR4_PC6_Msk       ( 0x1fUL << PORT2_IOCR4_PC6_Pos )                               /*!< PORT2 IOCR4: PC6 Mask                   */
    #define PORT2_IOCR4_PC7_Pos       27                                                              /*!< PORT2 IOCR4: PC7 Position               */
    #define PORT2_IOCR4_PC7_Msk       ( 0x1fUL << PORT2_IOCR4_PC7_Pos )                               /*!< PORT2 IOCR4: PC7 Mask                   */

/* ---------------------------------  PORT2_IOCR8  -------------------------------- */
    #define PORT2_IOCR8_PC8_Pos       3                                                               /*!< PORT2 IOCR8: PC8 Position               */
    #define PORT2_IOCR8_PC8_Msk       ( 0x1fUL << PORT2_IOCR8_PC8_Pos )                               /*!< PORT2 IOCR8: PC8 Mask                   */
    #define PORT2_IOCR8_PC9_Pos       11                                                              /*!< PORT2 IOCR8: PC9 Position               */
    #define PORT2_IOCR8_PC9_Msk       ( 0x1fUL << PORT2_IOCR8_PC9_Pos )                               /*!< PORT2 IOCR8: PC9 Mask                   */
    #define PORT2_IOCR8_PC10_Pos      19                                                              /*!< PORT2 IOCR8: PC10 Position              */
    #define PORT2_IOCR8_PC10_Msk      ( 0x1fUL << PORT2_IOCR8_PC10_Pos )                              /*!< PORT2 IOCR8: PC10 Mask                  */
    #define PORT2_IOCR8_PC11_Pos      27                                                              /*!< PORT2 IOCR8: PC11 Position              */
    #define PORT2_IOCR8_PC11_Msk      ( 0x1fUL << PORT2_IOCR8_PC11_Pos )                              /*!< PORT2 IOCR8: PC11 Mask                  */

/* ----------------------------------  PORT2_IN  ---------------------------------- */
    #define PORT2_IN_P0_Pos           0                                                               /*!< PORT2 IN: P0 Position                   */
    #define PORT2_IN_P0_Msk           ( 0x01UL << PORT2_IN_P0_Pos )                                   /*!< PORT2 IN: P0 Mask                       */
    #define PORT2_IN_P1_Pos           1                                                               /*!< PORT2 IN: P1 Position                   */
    #define PORT2_IN_P1_Msk           ( 0x01UL << PORT2_IN_P1_Pos )                                   /*!< PORT2 IN: P1 Mask                       */
    #define PORT2_IN_P2_Pos           2                                                               /*!< PORT2 IN: P2 Position                   */
    #define PORT2_IN_P2_Msk           ( 0x01UL << PORT2_IN_P2_Pos )                                   /*!< PORT2 IN: P2 Mask                       */
    #define PORT2_IN_P3_Pos           3                                                               /*!< PORT2 IN: P3 Position                   */
    #define PORT2_IN_P3_Msk           ( 0x01UL << PORT2_IN_P3_Pos )                                   /*!< PORT2 IN: P3 Mask                       */
    #define PORT2_IN_P4_Pos           4                                                               /*!< PORT2 IN: P4 Position                   */
    #define PORT2_IN_P4_Msk           ( 0x01UL << PORT2_IN_P4_Pos )                                   /*!< PORT2 IN: P4 Mask                       */
    #define PORT2_IN_P5_Pos           5                                                               /*!< PORT2 IN: P5 Position                   */
    #define PORT2_IN_P5_Msk           ( 0x01UL << PORT2_IN_P5_Pos )                                   /*!< PORT2 IN: P5 Mask                       */
    #define PORT2_IN_P6_Pos           6                                                               /*!< PORT2 IN: P6 Position                   */
    #define PORT2_IN_P6_Msk           ( 0x01UL << PORT2_IN_P6_Pos )                                   /*!< PORT2 IN: P6 Mask                       */
    #define PORT2_IN_P7_Pos           7                                                               /*!< PORT2 IN: P7 Position                   */
    #define PORT2_IN_P7_Msk           ( 0x01UL << PORT2_IN_P7_Pos )                                   /*!< PORT2 IN: P7 Mask                       */
    #define PORT2_IN_P8_Pos           8                                                               /*!< PORT2 IN: P8 Position                   */
    #define PORT2_IN_P8_Msk           ( 0x01UL << PORT2_IN_P8_Pos )                                   /*!< PORT2 IN: P8 Mask                       */
    #define PORT2_IN_P9_Pos           9                                                               /*!< PORT2 IN: P9 Position                   */
    #define PORT2_IN_P9_Msk           ( 0x01UL << PORT2_IN_P9_Pos )                                   /*!< PORT2 IN: P9 Mask                       */
    #define PORT2_IN_P10_Pos          10                                                              /*!< PORT2 IN: P10 Position                  */
    #define PORT2_IN_P10_Msk          ( 0x01UL << PORT2_IN_P10_Pos )                                  /*!< PORT2 IN: P10 Mask                      */
    #define PORT2_IN_P11_Pos          11                                                              /*!< PORT2 IN: P11 Position                  */
    #define PORT2_IN_P11_Msk          ( 0x01UL << PORT2_IN_P11_Pos )                                  /*!< PORT2 IN: P11 Mask                      */

