FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
/* ---------------------------------  PORT2_PHCR0  -------------------------------- */
    #define PORT2_PHCR0_PH0_Pos       2                                                               /*!< PORT2 PHCR0: PH0 Position               */
    #define PORT2_PHCR0_PH0_Msk       ( 0x01UL << PORT2_PHCR0_PH0_Pos )                               /*!< PORT2 PHCR0: PH0 Mask                   */
    #define PORT2_PHCR0_PH1_Pos       6                                                               /*!< PORT2 PHCR0: PH1 Position               */
    #define PORT2_PHCR0_PH1_Msk       ( 0x01UL << PORT2_PHCR0_PH1_Pos )                               /*!< PORT2 PHCR0: PH1 Mask                   */
    #define PORT2_PHCR0_PH2_Pos       10                                                              /*!< PORT2 PHCR0: PH2 Position               */
    #define PORT2_PHCR0_PH2_Msk       ( 0x01UL << PORT2_PHCR0_PH2_Pos )                               /*!< PORT2 PHCR0: PH2 Mask                   */
    #define PORT2_PHCR0_PH3_Pos       14                                                              /*!< PORT2 PHCR0: PH3 Position               */
    #define PORT2_PHCR0_PH3_Msk       ( 0x01UL << PORT2_PHCR0_PH3_Pos )                               /*!< PORT2 PHCR0: PH3 Mask                   */
    #define PORT2_PHCR0_PH4_Pos       18                                                              /*!< PORT2 PHCR0: PH4 Position               */
    #define PORT2_PHCR0_PH4_Msk       ( 0x01UL << PORT2_PHCR0_PH4_Pos )                               /*!< PORT2 PHCR0: PH4 Mask                   */
    #define PORT2_PHCR0_PH5_Pos       22                                                              /*!< PORT2 PHCR0: PH5 Position               */
    #define PORT2_PHCR0_PH5_Msk       ( 0x01UL << PORT2_PHCR0_PH5_Pos )                               /*!< PORT2 PHCR0: PH5 Mask                   */
    #define PORT2_PHCR0_PH6_Pos       26                                                              /*!< PORT2 PHCR0: PH6 Position               */
    #define PORT2_PHCR0_PH6_Msk       ( 0x01UL << PORT2_PHCR0_PH6_Pos )                               /*!< PORT2 PHCR0: PH6 Mask                   */
    #define PORT2_PHCR0_PH7_Pos       30                                                              /*!< PORT2 PHCR0: PH7 Position               */
    #define PORT2_PHCR0_PH7_Msk       ( 0x01UL << PORT2_PHCR0_PH7_Pos )                               /*!< PORT2 PHCR0: PH7 Mask                   */

/* ---------------------------------  PORT2_PHCR1  -------------------------------- */
    #define PORT2_PHCR1_PH8_Pos       2                                                               /*!< PORT2 PHCR1: PH8 Position               */
    #define PORT2_PHCR1_PH8_Msk       ( 0x01UL << PORT2_PHCR1_PH8_Pos )                               /*!< PORT2 PHCR1: PH8 Mask                   */
    #define PORT2_PHCR1_PH9_Pos       6                                                               /*!< PORT2 PHCR1: PH9 Position               */
    #define PORT2_PHCR1_PH9_Msk       ( 0x01UL << PORT2_PHCR1_PH9_Pos )                               /*!< PORT2 PHCR1: PH9 Mask                   */
    #define PORT2_PHCR1_PH10_Pos      10                                                              /*!< PORT2 PHCR1: PH10 Position              */
    #define PORT2_PHCR1_PH10_Msk      ( 0x01UL << PORT2_PHCR1_PH10_Pos )                              /*!< PORT2 PHCR1: PH10 Mask                  */
    #define PORT2_PHCR1_PH11_Pos      14                                                              /*!< PORT2 PHCR1: PH11 Position              */
    #define PORT2_PHCR1_PH11_Msk      ( 0x01UL << PORT2_PHCR1_PH11_Pos )                              /*!< PORT2 PHCR1: PH11 Mask                  */

/* ---------------------------------  PORT2_PDISC  -------------------------------- */
    #define PORT2_PDISC_PDIS0_Pos     0                                                               /*!< PORT2 PDISC: PDIS0 Position             */
    #define PORT2_PDISC_PDIS0_Msk     ( 0x01UL << PORT2_PDISC_PDIS0_Pos )                             /*!< PORT2 PDISC: PDIS0 Mask                 */
    #define PORT2_PDISC_PDIS1_Pos     1                                                               /*!< PORT2 PDISC: PDIS1 Position             */
    #define PORT2_PDISC_PDIS1_Msk     ( 0x01UL << PORT2_PDISC_PDIS1_Pos )                             /*!< PORT2 PDISC: PDIS1 Mask                 */
    #define PORT2_PDISC_PDIS2_Pos     2                                                               /*!< PORT2 PDISC: PDIS2 Position             */
    #define PORT2_PDISC_PDIS2_Msk     ( 0x01UL << PORT2_PDISC_PDIS2_Pos )                             /*!< PORT2 PDISC: PDIS2 Mask                 */
    #define PORT2_PDISC_PDIS3_Pos     3                                                               /*!< PORT2 PDISC: PDIS3 Position             */
    #define PORT2_PDISC_PDIS3_Msk     ( 0x01UL << PORT2_PDISC_PDIS3_Pos )                             /*!< PORT2 PDISC: PDIS3 Mask                 */
    #define PORT2_PDISC_PDIS4_Pos     4                                                               /*!< PORT2 PDISC: PDIS4 Position             */
    #define PORT2_PDISC_PDIS4_Msk     ( 0x01UL << PORT2_PDISC_PDIS4_Pos )                             /*!< PORT2 PDISC: PDIS4 Mask                 */
    #define PORT2_PDISC_PDIS5_Pos     5                                                               /*!< PORT2 PDISC: PDIS5 Position             */
    #define PORT2_PDISC_PDIS5_Msk     ( 0x01UL << PORT2_PDISC_PDIS5_Pos )                             /*!< PORT2 PDISC: PDIS5 Mask                 */
    #define PORT2_PDISC_PDIS6_Pos     6                                                               /*!< PORT2 PDISC: PDIS6 Position             */
    #define PORT2_PDISC_PDIS6_Msk     ( 0x01UL << PORT2_PDISC_PDIS6_Pos )                             /*!< PORT2 PDISC: PDIS6 Mask                 */
    #define PORT2_PDISC_PDIS7_Pos     7                                                               /*!< PORT2 PDISC: PDIS7 Position             */
    #define PORT2_PDISC_PDIS7_Msk     ( 0x01UL << PORT2_PDISC_PDIS7_Pos )                             /*!< PORT2 PDISC: PDIS7 Mask                 */
    #define PORT2_PDISC_PDIS8_Pos     8                                                               /*!< PORT2 PDISC: PDIS8 Position             */
    #define PORT2_PDISC_PDIS8_Msk     ( 0x01UL << PORT2_PDISC_PDIS8_Pos )                             /*!< PORT2 PDISC: PDIS8 Mask                 */
    #define PORT2_PDISC_PDIS9_Pos     9                                                               /*!< PORT2 PDISC: PDIS9 Position             */
    #define PORT2_PDISC_PDIS9_Msk     ( 0x01UL << PORT2_PDISC_PDIS9_Pos )                             /*!< PORT2 PDISC: PDIS9 Mask                 */
    #define PORT2_PDISC_PDIS10_Pos    10                                                              /*!< PORT2 PDISC: PDIS10 Position            */
    #define PORT2_PDISC_PDIS10_Msk    ( 0x01UL << PORT2_PDISC_PDIS10_Pos )                            /*!< PORT2 PDISC: PDIS10 Mask                */
    #define PORT2_PDISC_PDIS11_Pos    11                                                              /*!< PORT2 PDISC: PDIS11 Position            */
    #define PORT2_PDISC_PDIS11_Msk    ( 0x01UL << PORT2_PDISC_PDIS11_Pos )                            /*!< PORT2 PDISC: PDIS11 Mask                */

/* ----------------------------------  PORT2_PPS  --------------------------------- */
    #define PORT2_PPS_PPS0_Pos        0                                                               /*!< PORT2 PPS: PPS0 Position                */
    #define PORT2_PPS_PPS0_Msk        ( 0x01UL << PORT2_PPS_PPS0_Pos )                                /*!< PORT2 PPS: PPS0 Mask                    */
    #define PORT2_PPS_PPS1_Pos        1                                                               /*!< PORT2 PPS: PPS1 Position                */
    #define PORT2_PPS_PPS1_Msk        ( 0x01UL << PORT2_PPS_PPS1_Pos )                                /*!< PORT2 PPS: PPS1 Mask                    */
    #define PORT2_PPS_PPS2_Pos        2                                                               /*!< PORT2 PPS: PPS2 Position                */
    #define PORT2_PPS_PPS2_Msk        ( 0x01UL << PORT2_PPS_PPS2_Pos )                                /*!< PORT2 PPS: PPS2 Mask                    */
    #define PORT2_PPS_PPS3_Pos        3                                                               /*!< PORT2 PPS: PPS3 Position                */
    #define PORT2_PPS_PPS3_Msk        ( 0x01UL << PORT2_PPS_PPS3_Pos )                                /*!< PORT2 PPS: PPS3 Mask                    */
    #define PORT2_PPS_PPS4_Pos        4                                                               /*!< PORT2 PPS: PPS4 Position                */
    #define PORT2_PPS_PPS4_Msk        ( 0x01UL << PORT2_PPS_PPS4_Pos )                                /*!< PORT2 PPS: PPS4 Mask                    */
    #define PORT2_PPS_PPS5_Pos        5                                                               /*!< PORT2 PPS: PPS5 Position                */
    #define PORT2_PPS_PPS5_Msk        ( 0x01UL << PORT2_PPS_PPS5_Pos )                                /*!< PORT2 PPS: PPS5 Mask                    */
    #define PORT2_PPS_PPS6_Pos        6                                                               /*!< PORT2 PPS: PPS6 Position                */
    #define PORT2_PPS_PPS6_Msk        ( 0x01UL << PORT2_PPS_PPS6_Pos )                                /*!< PORT2 PPS: PPS6 Mask                    */
    #define PORT2_PPS_PPS7_Pos        7                                                               /*!< PORT2 PPS: PPS7 Position                */
    #define PORT2_PPS_PPS7_Msk        ( 0x01UL << PORT2_PPS_PPS7_Pos )                                /*!< PORT2 PPS: PPS7 Mask                    */
    #define PORT2_PPS_PPS8_Pos        8                                                               /*!< PORT2 PPS: PPS8 Position                */
    #define PORT2_PPS_PPS8_Msk        ( 0x01UL << PORT2_PPS_PPS8_Pos )                                /*!< PORT2 PPS: PPS8 Mask                    */
    #define PORT2_PPS_PPS9_Pos        9                                                               /*!< PORT2 PPS: PPS9 Position                */
    #define PORT2_PPS_PPS9_Msk        ( 0x01UL << PORT2_PPS_PPS9_Pos )                                /*!< PORT2 PPS: PPS9 Mask                    */
    #define PORT2_PPS_PPS10_Pos       10                                                              /*!< PORT2 PPS: PPS10 Position               */
    #define PORT2_PPS_PPS10_Msk       ( 0x01UL << PORT2_PPS_PPS10_Pos )                               /*!< PORT2 PPS: PPS10 Mask                   */
    #define PORT2_PPS_PPS11_Pos       11                                                              /*!< PORT2 PPS: PPS11 Position               */
    #define PORT2_PPS_PPS11_Msk       ( 0x01UL << PORT2_PPS_PPS11_Pos )                               /*!< PORT2 PPS: PPS11 Mask                   */

/* ---------------------------------  PORT2_HWSEL  -------------------------------- */
    #define PORT2_HWSEL_HW0_Pos       0                                                               /*!< PORT2 HWSEL: HW0 Position               */
    #define PORT2_HWSEL_HW0_Msk       ( 0x03UL << PORT2_HWSEL_HW0_Pos )                               /*!< PORT2 HWSEL: HW0 Mask                   */
    #define PORT2_HWSEL_HW1_Pos       2                                                               /*!< PORT2 HWSEL: HW1 Position               */
    #define PORT2_HWSEL_HW1_Msk       ( 0x03UL << PORT2_HWSEL_HW1_Pos )                               /*!< PORT2 HWSEL: HW1 Mask                   */
    #define PORT2_HWSEL_HW2_Pos       4                                                               /*!< PORT2 HWSEL: HW2 Position               */
    #define PORT2_HWSEL_HW2_Msk       ( 0x03UL << PORT2_HWSEL_HW2_Pos )                               /*!< PORT2 HWSEL: HW2 Mask                   */
    #define PORT2_HWSEL_HW3_Pos       6                                                               /*!< PORT2 HWSEL: HW3 Position               */
    #define PORT2_HWSEL_HW3_Msk       ( 0x03UL << PORT2_HWSEL_HW3_Pos )                               /*!< PORT2 HWSEL: HW3 Mask                   */
    #define PORT2_HWSEL_HW4_Pos       8                                                               /*!< PORT2 HWSEL: HW4 Position               */
    #define PORT2_HWSEL_HW4_Msk       ( 0x03UL << PORT2_HWSEL_HW4_Pos )                               /*!< PORT2 HWSEL: HW4 Mask                   */
    #define PORT2_HWSEL_HW5_Pos       10                                                              /*!< PORT2 HWSEL: HW5 Position               */
    #define PORT2_HWSEL_HW5_Msk       ( 0x03UL << PORT2_HWSEL_HW5_Pos )                               /*!< PORT2 HWSEL: HW5 Mask                   */
    #define PORT2_HWSEL_HW6_Pos       12                                                              /*!< PORT2 HWSEL: HW6 Position               */
    #define PORT2_HWSEL_HW6_Msk       ( 0x03UL << PORT2_HWSEL_HW6_Pos )                               /*!< PORT2 HWSEL: HW6 Mask                   */
    #define PORT2_HWSEL_HW7_Pos       14                                                              /*!< PORT2 HWSEL: HW7 Position               */
    #define PORT2_HWSEL_HW7_Msk       ( 0x03UL << PORT2_HWSEL_HW7_Pos )                               /*!< PORT2 HWSEL: HW7 Mask                   */
    #define PORT2_HWSEL_HW8_Pos       16                                                              /*!< PORT2 HWSEL: HW8 Position               */
    #define PORT2_HWSEL_HW8_Msk       ( 0x03UL << PORT2_HWSEL_HW8_Pos )                               /*!< PORT2 HWSEL: HW8 Mask                   */
    #define PORT2_HWSEL_HW9_Pos       18                                                              /*!< PORT2 HWSEL: HW9 Position               */
    #define PORT2_HWSEL_HW9_Msk       ( 0x03UL << PORT2_HWSEL_HW9_Pos )                               /*!< PORT2 HWSEL: HW9 Mask                   */
    #define PORT2_HWSEL_HW10_Pos      20                                                              /*!< PORT2 HWSEL: HW10 Position              */
    #define PORT2_HWSEL_HW10_Msk      ( 0x03UL << PORT2_HWSEL_HW10_Pos )                              /*!< PORT2 HWSEL: HW10 Mask                  */
    #define PORT2_HWSEL_HW11_Pos      22                                                              /*!< PORT2 HWSEL: HW11 Position              */
    #define PORT2_HWSEL_HW11_Msk      ( 0x03UL << PORT2_HWSEL_HW11_Pos )                              /*!< PORT2 HWSEL: HW11 Mask                  */



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

