FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0_Infineon_XMC1000_IAR_Keil_GCC/XMC1200.h
    #define PPB_BASE              0xE000E000UL
    #define ERU0_BASE             0x40010600UL
    #define PAU_BASE              0x40000000UL
    #define NVM_BASE              0x40050000UL
    #define WDT_BASE              0x40020000UL
    #define RTC_BASE              0x40010A00UL
    #define PRNG_BASE             0x48020000UL
    #define LEDTS0_BASE           0x50020000UL
    #define LEDTS1_BASE           0x50020400UL
    #define USIC0_BASE            0x48000008UL
    #define USIC0_CH0_BASE        0x48000000UL
    #define USIC0_CH1_BASE        0x48000200UL
    #define SCU_GENERAL_BASE      0x40010000UL
    #define SCU_INTERRUPT_BASE    0x40010038UL
    #define SCU_POWER_BASE        0x40010200UL
    #define SCU_CLK_BASE          0x40010300UL
    #define SCU_RESET_BASE        0x40010400UL
    #define COMPARATOR_BASE       0x40010500UL
    #define SCU_ANALOG_BASE       0x40011000UL
    #define CCU40_BASE            0x48040000UL
    #define CCU40_CC40_BASE       0x48040100UL
    #define CCU40_CC41_BASE       0x48040200UL
    #define CCU40_CC42_BASE       0x48040300UL
    #define CCU40_CC43_BASE       0x48040400UL
    #define VADC_BASE             0x48030000UL
    #define VADC_G0_BASE          0x48030400UL
    #define VADC_G1_BASE          0x48030800UL
    #define SHS0_BASE             0x48034000UL
    #define BCCU0_BASE            0x50030000UL
    #define BCCU0_CH0_BASE        0x5003003CUL
    #define BCCU0_CH1_BASE        0x50030050UL
    #define BCCU0_CH2_BASE        0x50030064UL
    #define BCCU0_CH3_BASE        0x50030078UL
    #define BCCU0_CH4_BASE        0x5003008CUL
    #define BCCU0_CH5_BASE        0x500300A0UL
    #define BCCU0_CH6_BASE        0x500300B4UL
    #define BCCU0_CH7_BASE        0x500300C8UL
    #define BCCU0_CH8_BASE        0x500300DCUL
    #define BCCU0_DE0_BASE        0x5003017CUL
    #define BCCU0_DE1_BASE        0x50030188UL
    #define BCCU0_DE2_BASE        0x50030194UL
    #define PORT0_BASE            0x40040000UL
    #define PORT1_BASE            0x40040100UL
    #define PORT2_BASE            0x40040200UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

    #define PPB              ( ( PPB_Type * ) PPB_BASE )
    #define ERU0             ( ( ERU_GLOBAL_TypeDef * ) ERU0_BASE )
    #define PAU              ( ( PAU_Type * ) PAU_BASE )
    #define NVM              ( ( NVM_Type * ) NVM_BASE )
    #define WDT              ( ( WDT_GLOBAL_TypeDef * ) WDT_BASE )
    #define RTC              ( ( RTC_GLOBAL_TypeDef * ) RTC_BASE )
    #define PRNG             ( ( PRNG_Type * ) PRNG_BASE )
    #define LEDTS0           ( ( LEDTS0_GLOBAL_TypeDef * ) LEDTS0_BASE )
    #define LEDTS1           ( ( LEDTS0_GLOBAL_TypeDef * ) LEDTS1_BASE )
    #define USIC0            ( ( USIC_GLOBAL_TypeDef * ) USIC0_BASE )
    #define USIC0_CH0        ( ( USIC_CH_TypeDef * ) USIC0_CH0_BASE )
    #define USIC0_CH1        ( ( USIC_CH_TypeDef * ) USIC0_CH1_BASE )
    #define SCU_GENERAL      ( ( SCU_GENERAL_Type * ) SCU_GENERAL_BASE )
    #define SCU_INTERRUPT    ( ( SCU_INTERRUPT_TypeDef * ) SCU_INTERRUPT_BASE )
    #define SCU_POWER        ( ( SCU_POWER_Type * ) SCU_POWER_BASE )
    #define SCU_CLK          ( ( SCU_CLK_TypeDef * ) SCU_CLK_BASE )
    #define SCU_RESET        ( ( SCU_RESET_Type * ) SCU_RESET_BASE )
    #define COMPARATOR       ( ( COMPARATOR_Type * ) COMPARATOR_BASE )
    #define SCU_ANALOG       ( ( SCU_ANALOG_Type * ) SCU_ANALOG_BASE )
    #define CCU40            ( ( CCU4_GLOBAL_TypeDef * ) CCU40_BASE )
    #define CCU40_CC40       ( ( CCU4_CC4_TypeDef * ) CCU40_CC40_BASE )
    #define CCU40_CC41       ( ( CCU4_CC4_TypeDef * ) CCU40_CC41_BASE )
    #define CCU40_CC42       ( ( CCU4_CC4_TypeDef * ) CCU40_CC42_BASE )
    #define CCU40_CC43       ( ( CCU4_CC4_TypeDef * ) CCU40_CC43_BASE )
    #define VADC             ( ( VADC_GLOBAL_TypeDef * ) VADC_BASE )
    #define VADC_G0          ( ( VADC_G_TypeDef * ) VADC_G0_BASE )
    #define VADC_G1          ( ( VADC_G_TypeDef * ) VADC_G1_BASE )
    #define SHS0             ( ( SHS_Type * ) SHS0_BASE )
    #define BCCU0            ( ( BCCU_Type * ) BCCU0_BASE )
    #define BCCU0_CH0        ( ( BCCU_CH_Type * ) BCCU0_CH0_BASE )
    #define BCCU0_CH1        ( ( BCCU_CH_Type * ) BCCU0_CH1_BASE )
    #define BCCU0_CH2        ( ( BCCU_CH_Type * ) BCCU0_CH2_BASE )
    #define BCCU0_CH3        ( ( BCCU_CH_Type * ) BCCU0_CH3_BASE )
    #define BCCU0_CH4        ( ( BCCU_CH_Type * ) BCCU0_CH4_BASE )
    #define BCCU0_CH5        ( ( BCCU_CH_Type * ) BCCU0_CH5_BASE )
    #define BCCU0_CH6        ( ( BCCU_CH_Type * ) BCCU0_CH6_BASE )
    #define BCCU0_CH7        ( ( BCCU_CH_Type * ) BCCU0_CH7_BASE )
    #define BCCU0_CH8        ( ( BCCU_CH_Type * ) BCCU0_CH8_BASE )
    #define BCCU0_DE0        ( ( BCCU_DE_Type * ) BCCU0_DE0_BASE )
    #define BCCU0_DE1        ( ( BCCU_DE_Type * ) BCCU0_DE1_BASE )
    #define BCCU0_DE2        ( ( BCCU_DE_Type * ) BCCU0_DE2_BASE )
    #define PORT0            ( ( PORT0_Type * ) PORT0_BASE )
    #define PORT1            ( ( PORT1_Type * ) PORT1_BASE )
    #define PORT2            ( ( PORT2_Type * ) PORT2_BASE )


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group XMC1200 */
/** @} */ /* End of group Infineon */

    #ifdef __cplusplus
    }
    #endif


#endif /* XMC1200_H */
